{
  "240": [
    239,
    188
  ],
  "241": [
    240,
    140
  ],
  "242": [
    228,
    184
  ],
  "243": [
    227,
    128
  ],
  "244": [
    243,
    130
  ],
  "245": [
    226,
    128
  ],
  "246": [
    228,
    186
  ],
  "247": [
    229,
    133
  ],
  "248": [
    228,
    185
  ],
  "249": [
    229,
    164
  ],
  "250": [
    230,
    155
  ],
  "251": [
    229,
    143
  ],
  "252": [
    229,
    144
  ],
  "253": [
    240,
    154
  ],
  "254": [
    245,
    156
  ],
  "255": [
    245,
    157
  ],
  "256": [
    228,
    187
  ],
  "257": [
    250,
    176
  ],
  "258": [
    248,
    139
  ],
  "259": [
    229,
    176
  ],
  "260": [
    230,
    157
  ],
  "261": [
    229,
    134
  ],
  "262": [
    230,
    156
  ],
  "263": [
    242,
    141
  ],
  "264": [
    229,
    141
  ],
  "265": [
    229,
    190
  ],
  "266": [
    229,
    174
  ],
  "267": [
    228,
    189
  ],
  "268": [
    230,
    151
  ],
  "269": [
    230,
    173
  ],
  "270": [
    229,
    136
  ],
  "271": [
    229,
    173
  ],
  "272": [
    229,
    188
  ],
  "273": [
    230,
    152
  ],
  "274": [
    246,
    186
  ],
  "275": [
    261,
    155
  ],
  "276": [
    232,
    175
  ],
  "277": [
    232,
    128
  ],
  "278": [
    247,
    181
  ],
  "279": [
    229,
    155
  ],
  "280": [
    229,
    191
  ],
  "281": [
    233,
    169
  ],
  "282": [
    230,
    149
  ],
  "283": [
    232,
    135
  ],
  "284": [
    249,
    167
  ],
  "285": [
    232,
    191
  ],
  "286": [
    242,
    128
  ],
  "287": [
    232,
    167
  ],
  "288": [
    281,
    172
  ],
  "289": [
    259,
    134
  ],
  "290": [
    229,
    183
  ],
  "291": [
    232,
    181
  ],
  "292": [
    230,
    136
  ],
  "293": [
    13,
    10
  ],
  "294": [
    228,
    188
  ],
  "295": [
    231,
    142
  ],
  "296": [
    229,
    135
  ],
  "297": [
    260,
    165
  ],
  "298": [
    32,
    32
  ],
  "299": [
    230,
    147
  ],
  "300": [
    229,
    184
  ],
  "301": [
    230,
    177
  ],
  "302": [
    233,
    151
  ],
  "303": [
    243,
    129
  ],
  "304": [
    232,
    174
  ],
  "305": [
    262,
    137
  ],
  "306": [
    231,
    155
  ],
  "307": [
    230,
    150
  ],
  "308": [
    230,
    137
  ],
  "309": [
    299,
    141
  ],
  "310": [
    231,
    187
  ],
  "311": [
    269,
    164
  ],
  "312": [
    233,
    129
  ],
  "313": [
    229,
    142
  ],
  "314": [
    246,
    142
  ],
  "315": [
    242,
    139
  ],
  "316": [
    240,
    155
  ],
  "317": [
    229,
    156
  ],
  "318": [
    240,
    159
  ],
  "319": [
    230,
    138
  ],
  "320": [
    242,
    173
  ],
  "321": [
    231,
    159
  ],
  "322": [
    231,
    148
  ],
  "323": [
    242,
    186
  ],
  "324": [
    240,
    129
  ],
  "325": [
    287,
    129
  ],
  "326": [
    232,
    176
  ],
  "327": [
    277,
    140
  ],
  "328": [
    229,
    138
  ],
  "329": [
    233,
    128
  ],
  "330": [
    229,
    185
  ],
  "331": [
    267,
    149
  ],
  "332": [
    229,
    189
  ],
  "333": [
    230,
    128
  ],
  "334": [
    296,
    186
  ],
  "335": [
    233,
    131
  ],
  "336": [
    233,
    153
  ],
  "337": [
    252,
    190
  ],
  "338": [
    228,
    190
  ],
  "339": [
    251,
    175
  ],
  "340": [
    232,
    180
  ],
  "341": [
    229,
    175
  ],
  "342": [
    265,
    183
  ],
  "343": [
    248,
    159
  ],
  "344": [
    229,
    166
  ],
  "345": [
    229,
    145
  ],
  "346": [
    252,
    142
  ],
  "347": [
    273,
    142
  ],
  "348": [
    256,
    165
  ],
  "349": [
    229,
    165
  ],
  "350": [
    250,
    185
  ],
  "351": [
    247,
    172
  ],
  "352": [
    242,
    138
  ],
  "353": [
    229,
    137
  ],
  "354": [
    229,
    177
  ],
  "355": [
    229,
    159
  ],
  "356": [
    232,
    161
  ],
  "357": [
    231,
    154
  ],
  "358": [
    293,
    293
  ],
  "359": [
    256,
    138
  ],
  "360": [
    230,
    139
  ],
  "361": [
    233,
    152
  ],
  "362": [
    295,
    132
  ],
  "363": [
    242,
    142
  ],
  "364": [
    272,
    160
  ],
  "365": [
    313,
    187
  ],
  "366": [
    247,
    182
  ],
  "367": [
    231,
    173
  ],
  "368": [
    362,
    342
  ],
  "369": [
    232,
    131
  ],
  "370": [
    230,
    172
  ],
  "371": [
    355,
    142
  ],
  "372": [
    268,
    165
  ],
  "373": [
    256,
    164
  ],
  "374": [
    232,
    190
  ],
  "375": [
    271,
    148
  ],
  "376": [
    248,
    131
  ],
  "377": [
    232,
    139
  ],
  "378": [
    229,
    186
  ],
  "379": [
    283,
    170
  ],
  "380": [
    229,
    163
  ],
  "381": [
    246,
    140
  ],
  "382": [
    279,
    158
  ],
  "383": [
    375,
    347
  ],
  "384": [
    272,
    149
  ],
  "385": [
    233,
    157
  ],
  "386": [
    168,
    128
  ],
  "387": [
    232,
    386
  ],
  "388": [
    344,
    130
  ],
  "389": [
    230,
    131
  ],
  "390": [
    317,
    168
  ],
  "391": [
    247,
    165
  ],
  "392": [
    273,
    175
  ],
  "393": [
    306,
    184
  ],
  "394": [
    265,
    151
  ],
  "395": [
    230,
    176
  ],
  "396": [
    232,
    162
  ],
  "397": [
    233,
    135
  ],
  "398": [
    268,
    160
  ],
  "399": [
    260,
    128
  ],
  "400": [
    230,
    129
  ],
  "401": [
    230,
    148
  ],
  "402": [
    298,
    32
  ],
  "403": [
    230,
    142
  ],
  "404": [
    247,
    136
  ],
  "405": [
    246,
    134
  ],
  "406": [
    242,
    137
  ],
  "407": [
    242,
    187
  ],
  "408": [
    292,
    145
  ],
  "409": [
    283,
    179
  ],
  "410": [
    353,
    141
  ],
  "411": [
    247,
    179
  ],
  "412": [
    276,
    180
  ],
  "413": [
    233,
    163
  ],
  "414": [
    232,
    183
  ],
  "415": [
    270,
    176
  ],
  "416": [
    271,
    144
  ],
  "417": [
    321,
    165
  ],
  "418": [
    249,
    169
  ],
  "419": [
    264,
    129
  ],
  "420": [
    357,
    134
  ],
  "421": [
    246,
    139
  ],
  "422": [
    230,
    132
  ],
  "423": [
    229,
    150
  ],
  "424": [
    233,
    173
  ],
  "425": [
    233,
    149
  ],
  "426": [
    280,
    133
  ],
  "427": [
    268,
    182
  ],
  "428": [
    232,
    141
  ],
  "429": [
    332,
    147
  ],
  "430": [
    231,
    153
  ],
  "431": [
    424,
    143
  ],
  "432": [
    301,
    157
  ],
  "433": [
    251,
    136
  ],
  "434": [
    270,
    152
  ],
  "435": [
    290,
    178
  ],
  "436": [
    231,
    132
  ],
  "437": [
    251,
    170
  ],
  "438": [
    354,
    177
  ],
  "439": [
    377,
    165
  ],
  "440": [
    319,
    165
  ],
  "441": [
    246,
    145
  ],
  "442": [
    294,
    151
  ],
  "443": [
    264,
    180
  ],
  "444": [
    370,
    178
  ],
  "445": [
    230,
    175
  ],
  "446": [
    269,
    163
  ],
  "447": [
    292,
    152
  ],
  "448": [
    267,
    191
  ],
  "449": [
    341,
    168
  ],
  "450": [
    414,
    175
  ],
  "451": [
    425,
    191
  ],
  "452": [
    232,
    153
  ],
  "453": [
    231,
    171
  ],
  "454": [
    231,
    156
  ],
  "455": [
    230,
    179
  ],
  "456": [
    295,
    139
  ],
  "457": [
    271,
    153
  ],
  "458": [
    231,
    165
  ],
  "459": [
    290,
    158
  ],
  "460": [
    266,
    137
  ],
  "461": [
    312,
    130
  ],
  "462": [
    231,
    186
  ],
  "463": [
    302,
    174
  ],
  "464": [
    233,
    162
  ],
  "465": [
    280,
    131
  ],
  "466": [
    233,
    170
  ],
  "467": [
    233,
    154
  ],
  "468": [
    251,
    150
  ],
  "469": [
    291,
    183
  ],
  "470": [
    269,
    187
  ],
  "471": [
    228,
    191
  ],
  "472": [
    436,
    182
  ],
  "473": [
    229,
    157
  ],
  "474": [
    229,
    140
  ],
  "475": [
    356,
    140
  ],
  "476": [
    277,
    133
  ],
  "477": [
    266,
    136
  ],
  "478": [
    252,
    180
  ],
  "479": [
    233,
    155
  ],
  "480": [
    230,
    140
  ],
  "481": [
    289,
    275
  ],
  "482": [
    304,
    161
  ],
  "483": [
    350,
    309
  ],
  "484": [
    321,
    163
  ],
  "485": [
    230,
    158
  ],
  "486": [
    232,
    189
  ],
  "487": [
    231,
    129
  ],
  "488": [
    367,
    137
  ],
  "489": [
    338,
    191
  ],
  "490": [
    270,
    134
  ],
  "491": [
    256,
    142
  ],
  "492": [
    229,
    187
  ],
  "493": [
    345,
    189
  ],
  "494": [
    233,
    161
  ],
  "495": [
    230,
    153
  ],
  "496": [
    380,
    171
  ],
  "497": [
    229,
    178
  ],
  "498": [
    233,
    130
  ],
  "499": [
    248,
    166
  ],
  "500": [
    232,
    130
  ],
  "501": [
    262,
    170
  ],
  "502": [
    276,
    184
  ],
  "503": [
    232,
    137
  ],
  "504": [
    232,
    136
  ],
  "505": [
    232,
    156
  ],
  "506": [
    300,
    131
  ],
  "507": [
    231,
    157
  ],
  "508": [
    231,
    172
  ],
  "509": [
    232,
    182
  ],
  "510": [
    232,
    145
  ],
  "511": [
    231,
    145
  ],
  "512": [
    230,
    178
  ],
  "513": [
    505,
    128
  ],
  "514": [
    232,
    165
  ],
  "515": [
    260,
    131
  ],
  "516": [
    242,
    156
  ],
  "517": [
    413,
    158
  ],
  "518": [
    338,
    175
  ],
  "519": [
    333,
    165
  ],
  "520": [
    285,
    155
  ],
  "521": [
    229,
    147
  ],
  "522": [
    385,
    162
  ],
  "523": [
    264,
    151
  ],
  "524": [
    302,
    187
  ],
  "525": [
    291,
    176
  ],
  "526": [
    231,
    137
  ],
  "527": [
    369,
    189
  ],
  "528": [
    279,
    155
  ],
  "529": [
    282,
    176
  ],
  "530": [
    230,
    184
  ],
  "531": [
    430,
    190
  ],
  "532": [
    229,
    167
  ],
  "533": [
    283,
    163
  ],
  "534": [
    264,
    179
  ],
  "535": [
    280,
    189
  ],
  "536": [
    233,
    187
  ],
  "537": [
    301,
    159
  ],
  "538": [
    335,
    189
  ],
  "539": [
    242,
    164
  ],
  "540": [
    265,
    128
  ],
  "541": [
    308,
    128
  ],
  "542": [
    249,
    135
  ],
  "543": [
    230,
    159
  ],
  "544": [
    246,
    148
  ],
  "545": [
    329,
    128
  ],
  "546": [
    330,
    179
  ],
  "547": [
    262,
    155
  ],
  "548": [
    302,
    168
  ],
  "549": [
    231,
    178
  ],
  "550": [
    230,
    181
  ],
  "551": [
    229,
    128
  ],
  "552": [
    242,
    135
  ],
  "553": [
    317,
    176
  ],
  "554": [
    301,
    137
  ],
  "555": [
    282,
    133
  ],
  "556": [
    249,
    170
  ],
  "557": [
    231,
    167
  ],
  "558": [
    231,
    149
  ],
  "559": [
    322,
    159
  ],
  "560": [
    307,
    185
  ],
  "561": [
    249,
    132
  ],
  "562": [
    229,
    139
  ],
  "563": [
    307,
    135
  ],
  "564": [
    336,
    141
  ],
  "565": [
    395,
    180
  ],
  "566": [
    232,
    144
  ],
  "567": [
    230,
    135
  ],
  "568": [
    322,
    168
  ],
  "569": [
    251,
    184
  ],
  "570": [
    259,
    143
  ],
  "571": [
    231,
    136
  ],
  "572": [
    252,
    132
  ],
  "573": [
    443,
    412
  ],
  "574": [
    514,
    191
  ],
  "575": [
    259,
    189
  ],
  "576": [
    380,
    176
  ],
  "577": [
    282,
    162
  ],
  "578": [
    232,
    186
  ],
  "579": [
    536,
    132
  ],
  "580": [
    389,
    138
  ],
  "581": [
    308,
    139
  ],
  "582": [
    267,
    153
  ],
  "583": [
    231,
    166
  ],
  "584": [
    231,
    150
  ],
  "585": [
    304,
    174
  ],
  "586": [
    230,
    183
  ],
  "587": [
    340,
    165
  ],
  "588": [
    231,
    189
  ],
  "589": [
    249,
    156
  ],
  "590": [
    567,
    191
  ],
  "591": [
    252,
    172
  ],
  "592": [
    252,
    149
  ],
  "593": [
    246,
    166
  ],
  "594": [
    242,
    148
  ],
  "595": [
    276,
    183
  ],
  "596": [
    396,
    171
  ],
  "597": [
    267,
    143
  ],
  "598": [
    340,
    188
  ],
  "599": [
    423,
    156
  ],
  "600": [
    300,
    157
  ],
  "601": [
    279,
    189
  ],
  "602": [
    231,
    174
  ],
  "603": [
    464,
    134
  ],
  "604": [
    569,
    288
  ],
  "605": [
    233,
    148
  ],
  "606": [
    233,
    171
  ],
  "607": [
    233,
    133
  ],
  "608": [
    290,
    166
  ],
  "609": [
    333,
    146
  ],
  "610": [
    511,
    156
  ],
  "611": [
    280,
    160
  ],
  "612": [
    265,
    133
  ],
  "613": [
    304,
    184
  ],
  "614": [
    230,
    180
  ],
  "615": [
    249,
    171
  ],
  "616": [
    381,
    274
  ],
  "617": [
    263,
    339
  ],
  "618": [
    252,
    141
  ],
  "619": [
    396,
    129
  ],
  "620": [
    266,
    152
  ],
  "621": [
    242,
    158
  ],
  "622": [
    233,
    166
  ],
  "623": [
    310,
    180
  ],
  "624": [
    265,
    144
  ],
  "625": [
    282,
    153
  ],
  "626": [
    385,
    158
  ],
  "627": [
    312,
    147
  ],
  "628": [
    261,
    133
  ],
  "629": [
    230,
    133
  ],
  "630": [
    578,
    171
  ],
  "631": [
    294,
    143
  ],
  "632": [
    621,
    393
  ],
  "633": [
    453,
    139
  ],
  "634": [
    249,
    154
  ],
  "635": [
    252,
    140
  ],
  "636": [
    454,
    139
  ],
  "637": [
    422,
    143
  ],
  "638": [
    378,
    148
  ],
  "639": [
    269,
    166
  ],
  "640": [
    345,
    168
  ],
  "641": [
    282,
    145
  ],
  "642": [
    361,
    179
  ],
  "643": [
    292,
    144
  ],
  "644": [
    411,
    351
  ],
  "645": [
    367,
    150
  ],
  "646": [
    310,
    141
  ],
  "647": [
    543,
    144
  ],
  "648": [
    249,
    143
  ],
  "649": [
    282,
    140
  ],
  "650": [
    360,
    156
  ],
  "651": [
    487,
    171
  ],
  "652": [
    231,
    160
  ],
  "653": [
    285,
    135
  ],
  "654": [
    252,
    136
  ],
  "655": [
    251,
    179
  ],
  "656": [
    330,
    180
  ],
  "657": [
    231,
    190
  ],
  "658": [
    361,
    181
  ],
  "659": [
    264,
    131
  ],
  "660": [
    307,
    169
  ],
  "661": [
    397,
    140
  ],
  "662": [
    229,
    148
  ],
  "663": [
    428,
    134
  ],
  "664": [
    266,
    154
  ],
  "665": [
    232,
    142
  ],
  "666": [
    300,
    136
  ],
  "667": [
    291,
    182
  ],
  "668": [
    266,
    182
  ],
  "669": [
    384,
    278
  ],
  "670": [
    508,
    145
  ],
  "671": [
    251,
    163
  ],
  "672": [
    270,
    128
  ],
  "673": [
    401,
    187
  ],
  "674": [
    330,
    182
  ],
  "675": [
    233,
    159
  ],
  "676": [
    267,
    156
  ],
  "677": [
    492,
    182
  ],
  "678": [
    231,
    144
  ],
  "679": [
    294,
    154
  ],
  "680": [
    279,
    160
  ],
  "681": [
    370,
    161
  ],
  "682": [
    549,
    174
  ],
  "683": [
    606,
    152
  ],
  "684": [
    249,
    180
  ],
  "685": [
    285,
    142
  ],
  "686": [
    229,
    130
  ],
  "687": [
    233,
    156
  ],
  "688": [
    246,
    178
  ],
  "689": [
    230,
    154
  ],
  "690": [
    474,
    151
  ],
  "691": [
    231,
    164
  ],
  "692": [
    285,
    189
  ],
  "693": [
    441,
    451
  ],
  "694": [
    249,
    150
  ],
  "695": [
    291,
    181
  ],
  "696": [
    504,
    185
  ],
  "697": [
    326,
    139
  ],
  "698": [
    252,
    155
  ],
  "699": [
    32,
    573
  ],
  "700": [
    302,
    180
  ],
  "701": [
    356,
    168
  ],
  "702": [
    369,
    156
  ],
  "703": [
    230,
    161
  ],
  "704": [
    328,
    191
  ],
  "705": [
    248,
    142
  ],
  "706": [
    230,
    141
  ],
  "707": [
    336,
    136
  ],
  "708": [
    445,
    149
  ],
  "709": [
    663,
    459
  ],
  "710": [
    231,
    140
  ],
  "711": [
    232,
    166
  ],
  "712": [
    486,
    166
  ],
  "713": [
    319,
    149
  ],
  "714": [
    260,
    142
  ],
  "715": [
    322,
    154
  ],
  "716": [
    332,
    146
  ],
  "717": [
    345,
    138
  ],
  "718": [
    326,
    147
  ],
  "719": [
    400,
    144
  ],
  "720": [
    397,
    141
  ],
  "721": [
    229,
    149
  ],
  "722": [
    232,
    138
  ],
  "723": [
    422,
    191
  ],
  "724": [
    277,
    179
  ],
  "725": [
    272,
    159
  ],
  "726": [
    312,
    163
  ],
  "727": [
    566,
    165
  ],
  "728": [
    268,
    169
  ],
  "729": [
    403,
    165
  ],
  "730": [
    251,
    145
  ],
  "731": [
    287,
    134
  ],
  "732": [
    231,
    151
  ],
  "733": [
    230,
    143
  ],
  "734": [
    256,
    150
  ],
  "735": [
    467,
    143
  ],
  "736": [
    401,
    190
  ],
  "737": [
    230,
    130
  ],
  "738": [
    233,
    165
  ],
  "739": [
    500,
    131
  ],
  "740": [
    306,
    180
  ],
  "741": [
    251,
    138
  ],
  "742": [
    452,
    189
  ],
  "743": [
    513,
    278
  ],
  "744": [
    247,
    180
  ],
  "745": [
    571,
    182
  ],
  "746": [
    622,
    150
  ],
  "747": [
    249,
    177
  ],
  "748": [
    263,
    527
  ],
  "749": [
    251,
    151
  ],
  "750": [
    231,
    168
  ],
  "751": [
    231,
    191
  ],
  "752": [
    648,
    518
  ],
  "753": [
    247,
    132
  ],
  "754": [
    383,
    257
  ],
  "755": [
    270,
    153
  ],
  "756": [
    248,
    152
  ],
  "757": [
    268,
    151
  ],
  "758": [
    284,
    599
  ],
  "759": [
    388,
    311
  ],
  "760": [
    261,
    141
  ],
  "761": [
    232,
    146
  ],
  "762": [
    233,
    146
  ],
  "763": [
    368,
    257
  ],
  "764": [
    259,
    154
  ],
  "765": [
    285,
    158
  ],
  "766": [
    233,
    190
  ],
  "767": [
    233,
    189
  ],
  "768": [
    249,
    141
  ],
  "769": [
    466,
    145
  ],
  "770": [
    273,
    173
  ],
  "771": [
    509,
    179
  ],
  "772": [
    328,
    159
  ],
  "773": [
    313,
    159
  ],
  "774": [
    349,
    143
  ],
  "775": [
    231,
    139
  ],
  "776": [
    721,
    134
  ],
  "777": [
    230,
    160
  ],
  "778": [
    364,
    517
  ],
  "779": [
    592,
    506
  ],
  "780": [
    300,
    144
  ],
  "781": [
    374,
    185
  ],
  "782": [
    294,
    145
  ],
  "783": [
    473,
    144
  ],
  "784": [
    277,
    129
  ],
  "785": [
    349,
    137
  ],
  "786": [
    335,
    161
  ],
  "787": [
    510,
    155
  ],
  "788": [
    652,
    180
  ],
  "789": [
    232,
    129
  ],
  "790": [
    607,
    146
  ],
  "791": [
    328,
    155
  ],
  "792": [
    250,
    180
  ],
  "793": [
    349,
    148
  ],
  "794": [
    259,
    129
  ],
  "795": [
    259,
    177
  ],
  "796": [
    602,
    173
  ],
  "797": [
    248,
    177
  ],
  "798": [
    248,
    133
  ],
  "799": [
    231,
    138
  ],
  "800": [
    272,
    128
  ],
  "801": [
    248,
    137
  ],
  "802": [
    231,
    180
  ],
  "803": [
    502,
    787
  ],
  "804": [
    262,
    172
  ],
  "805": [
    251,
    141
  ],
  "806": [
    231,
    131
  ],
  "807": [
    264,
    147
  ],
  "808": [
    711,
    129
  ],
  "809": [
    509,
    133
  ],
  "810": [
    233,
    178
  ],
  "811": [
    662,
    164
  ],
  "812": [
    776,
    585
  ],
  "813": [
    233,
    188
  ],
  "814": [
    584,
    145
  ],
  "815": [
    271,
    159
  ],
  "816": [
    231,
    188
  ],
  "817": [
    691,
    188
  ],
  "818": [
    766,
    153
  ],
  "819": [
    284,
    609
  ],
  "820": [
    510,
    163
  ],
  "821": [
    230,
    174
  ],
  "822": [
    287,
    163
  ],
  "823": [
    407,
    351
  ],
  "824": [
    388,
    331
  ],
  "825": [
    266,
    171
  ],
  "826": [
    497,
    130
  ],
  "827": [
    260,
    168
  ],
  "828": [
    418,
    315
  ],
  "829": [
    268,
    162
  ],
  "830": [
    395,
    145
  ],
  "831": [
    401,
    182
  ],
  "832": [
    310,
    159
  ],
  "833": [
    353,
    145
  ],
  "834": [
    328,
    168
  ],
  "835": [
    262,
    157
  ],
  "836": [
    231,
    170
  ],
  "837": [
    230,
    182
  ],
  "838": [
    431,
    677
  ],
  "839": [
    335,
    168
  ],
  "840": [
    457,
    515
  ],
  "841": [
    532,
    147
  ],
  "842": [
    279,
    190
  ],
  "843": [
    558,
    153
  ],
  "844": [
    767,
    144
  ],
  "845": [
    275,
    288
  ],
  "846": [
    397,
    145
  ],
  "847": [
    286,
    274
  ],
  "848": [
    309,
    257
  ],
  "849": [
    665,
    183
  ],
  "850": [
    507,
    163
  ],
  "851": [
    354,
    175
  ],
  "852": [
    413,
    142
  ],
  "853": [
    271,
    151
  ],
  "854": [
    299,
    146
  ],
  "855": [
    284,
    580
  ],
  "856": [
    332,
    188
  ],
  "857": [
    503,
    190
  ],
  "858": [
    695,
    441
  ],
  "859": [
    454,
    159
  ],
  "860": [
    308,
    141
  ],
  "861": [
    275,
    496
  ],
  "862": [
    532,
    156
  ],
  "863": [
    231,
    169
  ],
  "864": [
    246,
    164
  ],
  "865": [
    369,
    140
  ],
  "866": [
    229,
    160
  ],
  "867": [
    335,
    173
  ],
  "868": [
    229,
    129
  ],
  "869": [
    675,
    169
  ],
  "870": [
    608,
    655
  ],
  "871": [
    285,
    145
  ],
  "872": [
    231,
    130
  ],
  "873": [
    233,
    147
  ],
  "874": [
    431,
    278
  ],
  "875": [
    357,
    135
  ],
  "876": [
    256,
    129
  ],
  "877": [
    485,
    170
  ],
  "878": [
    467,
    190
  ],
  "879": [
    498,
    147
  ],
  "880": [
    251,
    171
  ],
  "881": [
    277,
    182
  ],
  "882": [
    287,
    130
  ],
  "883": [
    229,
    146
  ],
  "884": [
    329,
    129
  ],
  "885": [
    246,
    174
  ],
  "886": [
    455,
    149
  ],
  "887": [
    670,
    257
  ],
  "888": [
    230,
    168
  ],
  "889": [
    434,
    542
  ],
  "890": [
    265,
    132
  ],
  "891": [
    290,
    157
  ],
  "892": [
    604,
    590
  ],
  "893": [
    507,
    128
  ],
  "894": [
    262,
    136
  ],
  "895": [
    494,
    187
  ],
  "896": [
    300,
    166
  ],
  "897": [
    272,
    131
  ],
  "898": [
    615,
    274
  ],
  "899": [
    503,
    175
  ],
  "900": [
    285,
    156
  ],
  "901": [
    267,
    134
  ],
  "902": [
    232,
    133
  ],
  "903": [
    279,
    180
  ],
  "904": [
    229,
    132
  ],
  "905": [
    521,
    173
  ],
  "906": [
    285,
    152
  ],
  "907": [
    862,
    623
  ],
  "908": [
    341,
    134
  ],
  "909": [
    605,
    139
  ],
  "910": [
    231,
    143
  ],
  "911": [
    681,
    372
  ],
  "912": [
    374,
    158
  ],
  "913": [
    428,
    137
  ],
  "914": [
    267,
    160
  ],
  "915": [
    588,
    170
  ],
  "916": [
    247,
    171
  ],
  "917": [
    259,
    132
  ],
  "918": [
    395,
    148
  ],
  "919": [
    710,
    174
  ],
  "920": [
    242,
    170
  ],
  "921": [
    463,
    257
  ],
  "922": [
    810,
    129
  ],
  "923": [
    229,
    168
  ],
  "924": [
    512,
    179
  ],
  "925": [
    251,
    185
  ],
  "926": [
    333,
    157
  ],
  "927": [
    733,
    144
  ],
  "928": [
    365,
    405
  ],
  "929": [
    471,
    161
  ],
  "930": [
    290,
    174
  ],
  "931": [
    259,
    145
  ],
  "932": [
    264,
    138
  ],
  "933": [
    319,
    138
  ],
  "934": [
    430,
    189
  ],
  "935": [
    294,
    160
  ],
  "936": [
    232,
    177
  ],
  "937": [
    732,
    133
  ],
  "938": [
    230,
    162
  ],
  "939": [
    276,
    143
  ],
  "940": [
    300,
    184
  ],
  "941": [
    349,
    189
  ],
  "942": [
    738,
    174
  ],
  "943": [
    473,
    154
  ],
  "944": [
    619,
    646
  ],
  "945": [
    516,
    478
  ],
  "946": [
    251,
    183
  ],
  "947": [
    314,
    392
  ],
  "948": [
    335,
    131
  ],
  "949": [
    419,
    582
  ],
  "950": [
    308,
    147
  ],
  "951": [
    498,
    163
  ],
  "952": [
    813,
    147
  ],
  "953": [
    403,
    162
  ],
  "954": [
    562,
    191
  ],
  "955": [
    263,
    417
  ],
  "956": [
    550,
    129
  ],
  "957": [
    731,
    258
  ],
  "958": [
    230,
    144
  ],
  "959": [
    500,
    175
  ],
  "960": [
    479,
    132
  ],
  "961": [
    230,
    187
  ],
  "962": [
    502,
    289
  ],
  "963": [
    378,
    158
  ],
  "964": [
    486,
    187
  ],
  "965": [
    640,
    610
  ],
  "966": [
    266,
    158
  ],
  "967": [
    247,
    177
  ],
  "968": [
    261,
    178
  ],
  "969": [
    359,
    372
  ],
  "970": [
    262,
    141
  ],
  "971": [
    232,
    155
  ],
  "972": [
    266,
    179
  ],
  "973": [
    263,
    577
  ],
  "974": [
    231,
    146
  ],
  "975": [
    442,
    289
  ],
  "976": [
    266,
    156
  ],
  "977": [
    301,
    130
  ],
  "978": [
    326,
    162
  ],
  "979": [
    327,
    365
  ],
  "980": [
    270,
    171
  ],
  "981": [
    384,
    275
  ],
  "982": [
    256,
    187
  ],
  "983": [
    586,
    177
  ],
  "984": [
    508,
    172
  ],
  "985": [
    462,
    181
  ],
  "986": [
    326,
    183
  ],
  "987": [
    689,
    151
  ],
  "988": [
    248,
    144
  ],
  "989": [
    327,
    525
  ],
  "990": [
    261,
    179
  ],
  "991": [
    374,
    189
  ],
  "992": [
    452,
    142
  ],
  "993": [
    423,
    138
  ],
  "994": [
    274,
    288
  ],
  "995": [
    247,
    129
  ],
  "996": [
    328,
    169
  ],
  "997": [
    252,
    145
  ],
  "998": [
    304,
    190
  ],
  "999": [
    367,
    148
  ],
  "1000": [
    266,
    185
  ],
  "1001": [
    155,
    315
  ],
  "1002": [
    276,
    151
  ],
  "1003": [
    349,
    136
  ],
  "1004": [
    258,
    421
  ],
  "1005": [
    242,
    131
  ],
  "1006": [
    266,
    129
  ],
  "1007": [
    242,
    190
  ],
  "1008": [
    232,
    132
  ],
  "1009": [
    251,
    148
  ],
  "1010": [
    471,
    157
  ],
  "1011": [
    554,
    320
  ],
  "1012": [
    230,
    165
  ],
  "1013": [
    269,
    162
  ],
  "1014": [
    242,
    150
  ],
  "1015": [
    340,
    164
  ],
  "1016": [
    249,
    186
  ],
  "1017": [
    538,
    850
  ],
  "1018": [
    271,
    164
  ],
  "1019": [
    232,
    140
  ],
  "1020": [
    356,
    163
  ],
  "1021": [
    322,
    178
  ],
  "1022": [
    458,
    158
  ],
  "1023": [
    452,
    154
  ],
  "1024": [
    288,
    809
  ],
  "1025": [
    256,
    152
  ],
  "1026": [
    336,
    1001
  ],
  "1027": [
    307,
    173
  ],
  "1028": [
    761,
    153
  ],
  "1029": [
    317,
    159
  ],
  "1030": [
    330,
    184
  ],
  "1031": [
    354,
    133
  ],
  "1032": [
    326,
    129
  ],
  "1033": [
    374,
    190
  ],
  "1034": [
    273,
    159
  ],
  "1035": [
    480,
    135
  ],
  "1036": [
    308,
    191
  ],
  "1037": [
    341,
    185
  ],
  "1038": [
    265,
    129
  ],
  "1039": [
    232,
    163
  ],
  "1040": [
    233,
    184
  ],
  "1041": [
    338,
    141
  ],
  "1042": [
    251,
    172
  ],
  "1043": [
    923,
    129
  ],
  "1044": [
    251,
    178
  ],
  "1045": [
    418,
    416
  ],
  "1046": [
    437,
    325
  ],
  "1047": [
    232,
    148
  ],
  "1048": [
    750,
    139
  ],
  "1049": [
    400,
    169
  ],
  "1050": [
    530,
    161
  ],
  "1051": [
    346,
    407
  ],
  "1052": [
    413,
    159
  ],
  "1053": [
    247,
    131
  ],
  "1054": [
    282,
    163
  ],
  "1055": [
    400,
    168
  ],
  "1056": [
    247,
    168
  ],
  "1057": [
    687,
    135
  ],
  "1058": [
    445,
    141
  ],
  "1059": [
    751,
    188
  ],
  "1060": [
    466,
    130
  ],
  "1061": [
    286,
    275
  ],
  "1062": [
    494,
    190
  ],
  "1063": [
    557,
    176
  ],
  "1064": [
    566,
    189
  ],
  "1065": [
    336,
    181
  ],
  "1066": [
    629,
    140
  ],
  "1067": [
    336,
    134
  ],
  "1068": [
    264,
    191
  ],
  "1069": [
    306,
    174
  ],
  "1070": [
    503,
    178
  ],
  "1071": [
    789,
    154
  ],
  "1072": [
    307,
    176
  ],
  "1073": [
    352,
    288
  ],
  "1074": [
    250,
    190
  ],
  "1075": [
    562,
    135
  ],
  "1076": [
    326,
    143
  ],
  "1077": [
    497,
    177
  ],
  "1078": [
    495,
    131
  ],
  "1079": [
    329,
    159
  ],
  "1080": [
    395,
    143
  ],
  "1081": [
    281,
    190
  ],
  "1082": [
    579,
    611
  ],
  "1083": [
    312,
    135
  ],
  "1084": [
    305,
    286
  ],
  "1085": [
    526,
    185
  ],
  "1086": [
    492,
    186
  ],
  "1087": [
    462,
    166
  ],
  "1088": [
    378,
    156
  ],
  "1089": [
    273,
    148
  ],
  "1090": [
    231,
    147
  ],
  "1091": [
    264,
    177
  ],
  "1092": [
    296,
    187
  ],
  "1093": [
    974,
    139
  ],
  "1094": [
    247,
    173
  ],
  "1095": [
    270,
    186
  ],
  "1096": [
    262,
    149
  ],
  "1097": [
    364,
    948
  ],
  "1098": [
    865,
    346
  ],
  "1099": [
    242,
    149
  ],
  "1100": [
    246,
    161
  ],
  "1101": [
    321,
    179
  ],
  "1102": [
    231,
    179
  ],
  "1103": [
    242,
    180
  ],
  "1104": [
    360,
    168
  ],
  "1105": [
    284,
    880
  ],
  "1106": [
    423,
    157
  ],
  "1107": [
    294,
    144
  ],
  "1108": [
    307,
    153
  ],
  "1109": [
    371,
    320
  ],
  "1110": [
    263,
    394
  ],
  "1111": [
    280,
    167
  ],
  "1112": [
    349,
    179
  ],
  "1113": [
    530,
    138
  ],
  "1114": [
    330,
    178
  ],
  "1115": [
    329,
    138
  ],
  "1116": [
    327,
    297
  ],
  "1117": [
    258,
    387
  ],
  "1118": [
    385,
    146
  ],
  "1119": [
    262,
    175
  ],
  "1120": [
    272,
    147
  ],
  "1121": [
    404,
    407
  ],
  "1122": [
    329,
    131
  ],
  "1123": [
    291,
    143
  ],
  "1124": [
    251,
    177
  ],
  "1125": [
    361,
    159
  ],
  "1126": [
    883,
    140
  ],
  "1127": [
    310,
    134
  ],
  "1128": [
    485,
    156
  ],
  "1129": [
    341,
    187
  ],
  "1130": [
    229,
    162
  ],
  "1131": [
    377,
    177
  ],
  "1132": [
    1047,
    161
  ],
  "1133": [
    549,
    190
  ],
  "1134": [
    291,
    144
  ],
  "1135": [
    703,
    165
  ],
  "1136": [
    232,
    164
  ],
  "1137": [
    448,
    274
  ],
  "1138": [
    306,
    150
  ],
  "1139": [
    276,
    136
  ],
  "1140": [
    583,
    187
  ],
  "1141": [
    229,
    152
  ],
  "1142": [
    252,
    166
  ],
  "1143": [
    971,
    174
  ],
  "1144": [
    556,
    477
  ],
  "1145": [
    311,
    274
  ],
  "1146": [
    322,
    152
  ],
  "1147": [
    310,
    157
  ],
  "1148": [
    535,
    440
  ],
  "1149": [
    458,
    150
  ],
  "1150": [
    247,
    137
  ],
  "1151": [
    423,
    132
  ],
  "1152": [
    494,
    186
  ],
  "1153": [
    586,
    174
  ],
  "1154": [
    514,
    132
  ],
  "1155": [
    551,
    146
  ],
  "1156": [
    286,
    522
  ],
  "1157": [
    526,
    155
  ],
  "1158": [
    269,
    165
  ],
  "1159": [
    242,
    165
  ],
  "1160": [
    284,
    275
  ],
  "1161": [
    310,
    147
  ],
  "1162": [
    403,
    168
  ],
  "1163": [
    346,
    274
  ],
  "1164": [
    396,
    173
  ],
  "1165": [
    910,
    173
  ],
  "1166": [
    430,
    187
  ],
  "1167": [
    866,
    130
  ],
  "1168": [
    331,
    263
  ],
  "1169": [
    404,
    559
  ],
  "1170": [
    305,
    1002
  ],
  "1171": [
    526,
    169
  ],
  "1172": [
    262,
    168
  ],
  "1173": [
    338,
    157
  ],
  "1174": [
    471,
    177
  ],
  "1175": [
    331,
    555
  ],
  "1176": [
    266,
    180
  ],
  "1177": [
    328,
    160
  ],
  "1178": [
    263,
    388
  ],
  "1179": [
    287,
    146
  ],
  "1180": [
    248,
    157
  ],
  "1181": [
    340,
    159
  ],
  "1182": [
    306,
    155
  ],
  "1183": [
    260,
    190
  ],
  "1184": [
    400,
    175
  ],
  "1185": [
    308,
    167
  ],
  "1186": [
    373,
    274
  ],
  "1187": [
    472,
    346
  ],
  "1188": [
    474,
    185
  ],
  "1189": [
    455,
    176
  ],
  "1190": [
    389,
    167
  ],
  "1191": [
    377,
    158
  ],
  "1192": [
    588,
    162
  ],
  "1193": [
    256,
    135
  ],
  "1194": [
    836,
    129
  ],
  "1195": [
    879,
    857
  ],
  "1196": [
    360,
    146
  ],
  "1197": [
    678,
    134
  ],
  "1198": [
    268,
    167
  ],
  "1199": [
    233,
    158
  ],
  "1200": [
    328,
    179
  ],
  "1201": [
    389,
    133
  ],
  "1202": [
    404,
    909
  ],
  "1203": [
    815,
    849
  ],
  "1204": [
    264,
    142
  ],
  "1205": [
    629,
    136
  ],
  "1206": [
    357,
    132
  ],
  "1207": [
    258,
    482
  ],
  "1208": [
    803,
    885
  ],
  "1209": [
    247,
    184
  ],
  "1210": [
    389,
    135
  ],
  "1211": [
    507,
    191
  ],
  "1212": [
    583,
    129
  ],
  "1213": [
    267,
    141
  ],
  "1214": [
    497,
    184
  ],
  "1215": [
    291,
    180
  ],
  "1216": [
    230,
    146
  ],
  "1217": [
    774,
    257
  ],
  "1218": [
    464,
    156
  ],
  "1219": [
    360,
    155
  ],
  "1220": [
    381,
    419
  ],
  "1221": [
    315,
    288
  ],
  "1222": [
    328,
    171
  ],
  "1223": [
    328,
    157
  ],
  "1224": [
    925,
    257
  ],
  "1225": [
    286,
    576
  ],
  "1226": [
    1136,
    154
  ],
  "1227": [
    329,
    160
  ],
  "1228": [
    480,
    186
  ],
  "1229": [
    334,
    371
  ],
  "1230": [
    282,
    172
  ],
  "1231": [
    432,
    488
  ],
  "1232": [
    773,
    297
  ],
  "1233": [
    281,
    177
  ],
  "1234": [
    344,
    187
  ],
  "1235": [
    614,
    170
  ],
  "1236": [
    313,
    191
  ],
  "1237": [
    904,
    191
  ],
  "1238": [
    229,
    153
  ],
  "1239": [
    313,
    154
  ],
  "1240": [
    667,
    297
  ],
  "1241": [
    657,
    164
  ],
  "1242": [
    272,
    130
  ],
  "1243": [
    258,
    274
  ],
  "1244": [
    266,
    164
  ],
  "1245": [
    687,
    184
  ],
  "1246": [
    471,
    174
  ],
  "1247": [
    266,
    151
  ],
  "1248": [
    1163,
    1170
  ],
  "1249": [
    280,
    153
  ],
  "1250": [
    294,
    164
  ],
  "1251": [
    537,
    516
  ],
  "1252": [
    487,
    181
  ],
  "1253": [
    391,
    371
  ],
  "1254": [
    229,
    131
  ],
  "1255": [
    480,
    129
  ],
  "1256": [
    350,
    876
  ],
  "1257": [
    284,
    289
  ],
  "1258": [
    246,
    173
  ],
  "1259": [
    270,
    169
  ],
  "1260": [
    1003,
    331
  ],
  "1261": [
    961,
    161
  ],
  "1262": [
    381,
    289
  ],
  "1263": [
    364,
    991
  ],
  "1264": [
    511,
    190
  ],
  "1265": [
    319,
    164
  ],
  "1266": [
    275,
    320
  ],
  "1267": [
    242,
    154
  ],
  "1268": [
    360,
    148
  ],
  "1269": [
    259,
    137
  ],
  "1270": [
    276,
    173
  ],
  "1271": [
    390,
    311
  ],
  "1272": [
    665,
    171
  ],
  "1273": [
    229,
    171
  ],
  "1274": [
    333,
    128
  ],
  "1275": [
    487,
    173
  ],
  "1276": [
    283,
    180
  ],
  "1277": [
    229,
    158
  ],
  "1278": [
    603,
    278
  ],
  "1279": [
    446,
    392
  ],
  "1280": [
    258,
    278
  ],
  "1281": [
    256,
    170
  ],
  "1282": [
    129,
    438
  ],
  "1283": [
    643,
    538
  ],
  "1284": [
    304,
    168
  ],
  "1285": [
    284,
    421
  ],
  "1286": [
    270,
    157
  ],
  "1287": [
    535,
    472
  ],
  "1288": [
    474,
    150
  ],
  "1289": [
    251,
    152
  ],
  "1290": [
    624,
    1078
  ],
  "1291": [
    258,
    346
  ],
  "1292": [
    230,
    145
  ],
  "1293": [
    993,
    576
  ],
  "1294": [
    397,
    142
  ],
  "1295": [
    495,
    154
  ],
  "1296": [
    686,
    149
  ],
  "1297": [
    449,
    320
  ],
  "1298": [
    863,
    186
  ],
  "1299": [
    265,
    161
  ],
  "1300": [
    821,
    191
  ],
  "1301": [
    348,
    323
  ],
  "1302": [
    284,
    587
  ],
  "1303": [
    263,
    334
  ],
  "1304": [
    624,
    459
  ],
  "1305": [
    336,
    169
  ],
  "1306": [
    263,
    325
  ],
  "1307": [
    335,
    142
  ],
  "1308": [
    329,
    154
  ],
  "1309": [
    551,
    152
  ],
  "1310": [
    301,
    156
  ],
  "1311": [
    350,
    278
  ],
  "1312": [
    285,
    153
  ],
  "1313": [
    319,
    152
  ],
  "1314": [
    327,
    334
  ],
  "1315": [
    233,
    186
  ],
  "1316": [
    442,
    620
  ],
  "1317": [
    501,
    417
  ],
  "1318": [
    479,
    141
  ],
  "1319": [
    922,
    739
  ],
  "1320": [
    458,
    1282
  ],
  "1321": [
    310,
    136
  ],
  "1322": [
    333,
    167
  ],
  "1323": [
    680,
    311
  ],
  "1324": [
    264,
    167
  ],
  "1325": [
    274,
    440
  ],
  "1326": [
    296,
    134
  ],
  "1327": [
    264,
    146
  ],
  "1328": [
    307,
    151
  ],
  "1329": [
    248,
    190
  ],
  "1330": [
    660,
    258
  ],
  "1331": [
    262,
    177
  ],
  "1332": [
    366,
    387
  ],
  "1333": [
    279,
    176
  ],
  "1334": [
    308,
    182
  ],
  "1335": [
    233,
    134
  ],
  "1336": [
    562,
    146
  ],
  "1337": [
    230,
    189
  ],
  "1338": [
    531,
    841
  ],
  "1339": [
    551,
    153
  ],
  "1340": [
    491,
    258
  ],
  "1341": [
    262,
    186
  ],
  "1342": [
    233,
    185
  ],
  "1343": [
    247,
    183
  ],
  "1344": [
    888,
    138
  ],
  "1345": [
    963,
    342
  ],
  "1346": [
    246,
    137
  ],
  "1347": [
    252,
    137
  ],
  "1348": [
    389,
    159
  ],
  "1349": [
    775,
    172
  ],
  "1350": [
    242,
    129
  ],
  "1351": [
    297,
    325
  ],
  "1352": [
    729,
    638
  ],
  "1353": [
    485,
    129
  ],
  "1354": [
    273,
    165
  ],
  "1355": [
    229,
    180
  ],
  "1356": [
    531,
    582
  ],
  "1357": [
    985,
    288
  ],
  "1358": [
    434,
    701
  ],
  "1359": [
    288,
    1077
  ],
  "1360": [
    304,
    171
  ],
  "1361": [
    315,
    449
  ],
  "1362": [
    332,
    170
  ],
  "1363": [
    550,
    142
  ],
  "1364": [
    272,
    186
  ],
  "1365": [
    469,
    278
  ],
  "1366": [
    445,
    148
  ],
  "1367": [
    399,
    258
  ],
  "1368": [
    356,
    128
  ],
  "1369": [
    465,
    320
  ],
  "1370": [
    389,
    179
  ],
  "1371": [
    340,
    190
  ],
  "1372": [
    686,
    133
  ],
  "1373": [
    242,
    136
  ],
  "1374": [
    292,
    170
  ],
  "1375": [
    336,
    164
  ],
  "1376": [
    403,
    169
  ],
  "1377": [
    426,
    305
  ],
  "1378": [
    308,
    152
  ],
  "1379": [
    520,
    278
  ],
  "1380": [
    614,
    155
  ],
  "1381": [
    458,
    173
  ],
  "1382": [
    286,
    844
  ],
  "1383": [
    820,
    807
  ],
  "1384": [
    521,
    141
  ],
  "1385": [
    761,
    139
  ],
  "1386": [
    1102,
    156
  ],
  "1387": [
    888,
    170
  ],
  "1388": [
    490,
    1025
  ],
  "1389": [
    358,
    298
  ],
  "1390": [
    1389,
    298
  ],
  "1391": [
    1390,
    9
  ],
  "1392": [
    1391,
    9
  ],
  "1393": [
    1392,
    358
  ],
  "1394": [
    276,
    155
  ],
  "1395": [
    330,
    188
  ],
  "1396": [
    799,
    185
  ],
  "1397": [
    276,
    134
  ],
  "1398": [
    315,
    563
  ],
  "1399": [
    358,
    358
  ],
  "1400": [
    305,
    331
  ],
  "1401": [
    396,
    141
  ],
  "1402": [
    521,
    137
  ],
  "1403": [
    280,
    151
  ],
  "1404": [
    445,
    143
  ],
  "1405": [
    258,
    257
  ],
  "1406": [
    485,
    151
  ],
  "1407": [
    327,
    475
  ],
  "1408": [
    739,
    257
  ],
  "1409": [
    682,
    913
  ],
  "1410": [
    1238,
    168
  ],
  "1411": [
    334,
    288
  ],
  "1412": [
    329,
    134
  ],
  "1413": [
    371,
    352
  ],
  "1414": [
    706,
    137
  ],
  "1415": [
    613,
    1226
  ],
  "1416": [
    326,
    131
  ],
  "1417": [
    872,
    185
  ],
  "1418": [
    490,
    822
  ],
  "1419": [
    806,
    167
  ],
  "1420": [
    613,
    538
  ],
  "1421": [
    521,
    168
  ],
  "1422": [
    614,
    158
  ],
  "1423": [
    261,
    128
  ],
  "1424": [
    291,
    141
  ],
  "1425": [
    242,
    167
  ],
  "1426": [
    232,
    170
  ],
  "1427": [
    692,
    667
  ],
  "1428": [
    360,
    165
  ],
  "1429": [
    425,
    135
  ],
  "1430": [
    406,
    659
  ],
  "1431": [
    457,
    645
  ],
  "1432": [
    455,
    163
  ],
  "1433": [
    875,
    1009
  ],
  "1434": [
    512,
    187
  ],
  "1435": [
    419,
    552
  ],
  "1436": [
    442,
    420
  ],
  "1437": [
    231,
    134
  ],
  "1438": [
    349,
    139
  ],
  "1439": [
    345,
    188
  ],
  "1440": [
    266,
    157
  ],
  "1441": [
    1008,
    177
  ],
  "1442": [
    819,
    257
  ],
  "1443": [
    458,
    184
  ],
  "1444": [
    902,
    185
  ],
  "1445": [
    652,
    141
  ],
  "1446": [
    563,
    639
  ],
  "1447": [
    1019,
    131
  ],
  "1448": [
    270,
    135
  ],
  "1449": [
    322,
    176
  ],
  "1450": [
    490,
    278
  ],
  "1451": [
    1398,
    1418
  ],
  "1452": [
    382,
    440
  ],
  "1453": [
    558,
    165
  ],
  "1454": [
    437,
    394
  ],
  "1455": [
    703,
    147
  ],
  "1456": [
    230,
    164
  ],
  "1457": [
    550,
    183
  ],
  "1458": [
    295,
    137
  ],
  "1459": [
    495,
    174
  ],
  "1460": [
    422,
    159
  ],
  "1461": [
    816,
    154
  ],
  "1462": [
    292,
    159
  ],
  "1463": [
    486,
    172
  ],
  "1464": [
    1380,
    642
  ],
  "1465": [
    300,
    173
  ],
  "1466": [
    378,
    182
  ],
  "1467": [
    231,
    158
  ],
  "1468": [
    314,
    553
  ],
  "1469": [
    256,
    151
  ],
  "1470": [
    273,
    140
  ],
  "1471": [
    314,
    288
  ],
  "1472": [
    752,
    1210
  ],
  "1473": [
    258,
    553
  ],
  "1474": [
    399,
    297
  ],
  "1475": [
    319,
    181
  ],
  "1476": [
    282,
    180
  ],
  "1477": [
    256,
    147
  ],
  "1478": [
    479,
    168
  ],
  "1479": [
    230,
    186
  ],
  "1480": [
    575,
    420
  ],
  "1481": [
    265,
    146
  ],
  "1482": [
    544,
    659
  ],
  "1483": [
    999,
    257
  ],
  "1484": [
    304,
    186
  ],
  "1485": [
    361,
    178
  ],
  "1486": [
    285,
    159
  ],
  "1487": [
    294,
    175
  ],
  "1488": [
    230,
    188
  ],
  "1489": [
    245,
    148
  ],
  "1490": [
    594,
    412
  ],
  "1491": [
    873,
    129
  ],
  "1492": [
    706,
    174
  ],
  "1493": [
    247,
    141
  ],
  "1494": [
    717,
    257
  ],
  "1495": [
    312,
    141
  ],
  "1496": [
    462,
    170
  ],
  "1497": [
    232,
    158
  ],
  "1498": [
    229,
    179
  ],
  "1499": [
    339,
    348
  ],
  "1500": [
    610,
    257
  ],
  "1501": [
    251,
    164
  ],
  "1502": [
    466,
    164
  ],
  "1503": [
    753,
    725
  ],
  "1504": [
    799,
    175
  ],
  "1505": [
    312,
    151
  ],
  "1506": [
    735,
    346
  ],
  "1507": [
    1426,
    147
  ],
  "1508": [
    258,
    637
  ],
  "1509": [
    591,
    394
  ],
  "1510": [
    232,
    150
  ],
  "1511": [
    264,
    135
  ],
  "1512": [
    232,
    151
  ],
  "1513": [
    270,
    151
  ],
  "1514": [
    439,
    331
  ],
  "1515": [
    349,
    184
  ],
  "1516": [
    1133,
    278
  ],
  "1517": [
    777,
    161
  ],
  "1518": [
    428,
    128
  ],
  "1519": [
    762,
    159
  ],
  "1520": [
    326,
    173
  ],
  "1521": [
    411,
    744
  ],
  "1522": [
    296,
    160
  ],
  "1523": [
    439,
    263
  ],
  "1524": [
    410,
    522
  ],
  "1525": [
    331,
    274
  ],
  "1526": [
    306,
    138
  ],
  "1527": [
    231,
    177
  ],
  "1528": [
    295,
    176
  ],
  "1529": [
    232,
    178
  ],
  "1530": [
    319,
    171
  ],
  "1531": [
    419,
    661
  ],
  "1532": [
    345,
    152
  ],
  "1533": [
    296,
    137
  ],
  "1534": [
    463,
    258
  ],
  "1535": [
    511,
    129
  ],
  "1536": [
    232,
    157
  ],
  "1537": [
    230,
    191
  ],
  "1538": [
    231,
    162
  ],
  "1539": [
    1034,
    589
  ],
  "1540": [
    732,
    155
  ],
  "1541": [
    452,
    145
  ],
  "1542": [
    544,
    531
  ],
  "1543": [
    286,
    372
  ],
  "1544": [
    1228,
    877
  ],
  "1545": [
    451,
    460
  ],
  "1546": [
    285,
    144
  ],
  "1547": [
    802,
    160
  ],
  "1548": [
    902,
    190
  ],
  "1549": [
    273,
    147
  ],
  "1550": [
    457,
    1329
  ],
  "1551": [
    456,
    546
  ],
  "1552": [
    271,
    157
  ],
  "1553": [
    349,
    135
  ],
  "1554": [
    393,
    325
  ],
  "1555": [
    355,
    139
  ],
  "1556": [
    492,
    183
  ],
  "1557": [
    263,
    959
  ],
  "1558": [
    500,
    137
  ],
  "1559": [
    737,
    163
  ],
  "1560": [
    574,
    891
  ],
  "1561": [
    1326,
    542
  ],
  "1562": [
    462,
    179
  ],
  "1563": [
    377,
    166
  ],
  "1564": [
    391,
    325
  ],
  "1565": [
    495,
    186
  ],
  "1566": [
    633,
    314
  ],
  "1567": [
    276,
    175
  ],
  "1568": [
    260,
    161
  ],
  "1569": [
    936,
    171
  ],
  "1570": [
    259,
    157
  ],
  "1571": [
    229,
    151
  ],
  "1572": [
    480,
    137
  ],
  "1573": [
    291,
    164
  ],
  "1574": [
    455,
    170
  ],
  "1575": [
    1497,
    141
  ],
  "1576": [
    416,
    818
  ],
  "1577": [
    722,
    179
  ],
  "1578": [
    688,
    379
  ],
  "1579": [
    558,
    170
  ],
  "1580": [
    515,
    257
  ],
  "1581": [
    243,
    128
  ],
  "1582": [
    350,
    859
  ],
  "1583": [
    462,
    162
  ],
  "1584": [
    287,
    136
  ],
  "1585": [
    230,
    163
  ],
  "1586": [
    1076,
    257
  ],
  "1587": [
    619,
    1119
  ],
  "1588": [
    310,
    163
  ],
  "1589": [
    275,
    666
  ],
  "1590": [
    478,
    278
  ],
  "1591": [
    431,
    407
  ],
  "1592": [
    374,
    133
  ],
  "1593": [
    722,
    130
  ],
  "1594": [
    1090,
    146
  ],
  "1595": [
    462,
    167
  ],
  "1596": [
    408,
    488
  ],
  "1597": [
    364,
    1059
  ],
  "1598": [
    378,
    159
  ],
  "1599": [
    311,
    421
  ],
  "1600": [
    258,
    320
  ],
  "1601": [
    571,
    189
  ],
  "1602": [
    434,
    1093
  ],
  "1603": [
    604,
    770
  ],
  "1604": [
    453,
    159
  ],
  "1605": [
    387,
    257
  ],
  "1606": [
    366,
    274
  ],
  "1607": [
    371,
    315
  ],
  "1608": [
    232,
    184
  ],
  "1609": [
    605,
    166
  ],
  "1610": [
    752,
    1113
  ],
  "1611": [
    292,
    150
  ],
  "1612": [
    384,
    1061
  ],
  "1613": [
    1146,
    1006
  ],
  "1614": [
    1131,
    960
  ],
  "1615": [
    406,
    274
  ],
  "1616": [
    251,
    140
  ],
  "1617": [
    252,
    143
  ],
  "1618": [
    535,
    325
  ],
  "1619": [
    256,
    178
  ],
  "1620": [
    686,
    172
  ],
  "1621": [
    406,
    275
  ],
  "1622": [
    480,
    130
  ],
  "1623": [
    229,
    169
  ],
  "1624": [
    815,
    1033
  ],
  "1625": [
    557,
    139
  ],
  "1626": [
    312,
    191
  ],
  "1627": [
    497,
    129
  ],
  "1628": [
    248,
    161
  ],
  "1629": [
    269,
    135
  ],
  "1630": [
    297,
    372
  ],
  "1631": [
    263,
    741
  ],
  "1632": [
    295,
    135
  ],
  "1633": [
    494,
    191
  ],
  "1634": [
    401,
    184
  ],
  "1635": [
    504,
    141
  ],
  "1636": [
    256,
    176
  ],
  "1637": [
    350,
    1235
  ],
  "1638": [
    570,
    450
  ],
  "1639": [
    675,
    166
  ],
  "1640": [
    594,
    636
  ],
  "1641": [
    284,
    456
  ],
  "1642": [
    307,
    189
  ],
  "1643": [
    756,
    704
  ],
  "1644": [
    291,
    158
  ],
  "1645": [
    286,
    1362
  ],
  "1646": [
    930,
    274
  ],
  "1647": [
    442,
    275
  ],
  "1648": [
    631,
    278
  ],
  "1649": [
    592,
    1028
  ],
  "1650": [
    357,
    147
  ],
  "1651": [
    1143,
    278
  ],
  "1652": [
    1040,
    163
  ],
  "1653": [
    835,
    1556
  ],
  "1654": [
    251,
    176
  ],
  "1655": [
    780,
    315
  ],
  "1656": [
    467,
    144
  ],
  "1657": [
    539,
    450
  ],
  "1658": [
    1067,
    1115
  ],
  "1659": [
    276,
    157
  ],
  "1660": [
    938,
    129
  ],
  "1661": [
    242,
    147
  ],
  "1662": [
    602,
    161
  ],
  "1663": [
    249,
    185
  ],
  "1664": [
    322,
    187
  ],
  "1665": [
    398,
    263
  ],
  "1666": [
    1154,
    642
  ],
  "1667": [
    429,
    404
  ],
  "1668": [
    273,
    143
  ],
  "1669": [
    276,
    169
  ],
  "1670": [
    590,
    257
  ],
  "1671": [
    470,
    447
  ],
  "1672": [
    229,
    161
  ],
  "1673": [
    280,
    141
  ],
  "1674": [
    504,
    159
  ],
  "1675": [
    314,
    1212
  ],
  "1676": [
    485,
    157
  ],
  "1677": [
    312,
    165
  ],
  "1678": [
    539,
    275
  ],
  "1679": [
    248,
    158
  ],
  "1680": [
    330,
    191
  ],
  "1681": [
    1555,
    631
  ],
  "1682": [
    872,
    174
  ],
  "1683": [
    258,
    465
  ],
  "1684": [
    714,
    1296
  ],
  "1685": [
    466,
    168
  ],
  "1686": [
    583,
    143
  ],
  "1687": [
    341,
    191
  ],
  "1688": [
    297,
    685
  ],
  "1689": [
    261,
    153
  ],
  "1690": [
    263,
    597
  ],
  "1691": [
    440,
    417
  ],
  "1692": [
    458,
    142
  ],
  "1693": [
    378,
    166
  ],
  "1694": [
    453,
    165
  ],
  "1695": [
    251,
    130
  ],
  "1696": [
    512,
    155
  ],
  "1697": [
    958,
    166
  ],
  "1698": [
    510,
    172
  ],
  "1699": [
    746,
    1595
  ],
  "1700": [
    344,
    190
  ],
  "1701": [
    935,
    373
  ],
  "1702": [
    337,
    359
  ],
  "1703": [
    350,
    1099
  ],
  "1704": [
    722,
    157
  ],
  "1705": [
    284,
    481
  ],
  "1706": [
    308,
    172
  ],
  "1707": [
    274,
    343
  ],
  "1708": [
    351,
    457
  ],
  "1709": [
    943,
    477
  ],
  "1710": [
    689,
    130
  ],
  "1711": [
    374,
    177
  ],
  "1712": [
    258,
    427
  ],
  "1713": [
    361,
    180
  ],
  "1714": [
    529,
    419
  ],
  "1715": [
    258,
    700
  ],
  "1716": [
    509,
    138
  ],
  "1717": [
    345,
    136
  ],
  "1718": [
    713,
    564
  ],
  "1719": [
    247,
    187
  ],
  "1720": [
    313,
    174
  ],
  "1721": [
    528,
    522
  ],
  "1722": [
    726,
    448
  ],
  "1723": [
    370,
    186
  ],
  "1724": [
    264,
    176
  ],
  "1725": [
    392,
    589
  ],
  "1726": [
    374,
    136
  ],
  "1727": [
    403,
    140
  ],
  "1728": [
    264,
    149
  ],
  "1729": [
    264,
    171
  ],
  "1730": [
    353,
    178
  ],
  "1731": [
