{
  "240": [
    239,
    188
  ],
  "241": [
    240,
    140
  ],
  "242": [
    228,
    184
  ],
  "243": [
    228,
    186
  ],
  "244": [
    243,
    134
  ],
  "245": [
    228,
    187
  ],
  "246": [
    240,
    142
  ],
  "247": [
    229,
    143
  ],
  "248": [
    229,
    164
  ],
  "249": [
    226,
    128
  ],
  "250": [
    232,
    191
  ],
  "251": [
    232,
    175
  ],
  "252": [
    231,
    154
  ],
  "253": [
    252,
    132
  ],
  "254": [
    242,
    141
  ],
  "255": [
    228,
    185
  ],
  "256": [
    229,
    174
  ],
  "257": [
    230,
    157
  ],
  "258": [
    230,
    152
  ],
  "259": [
    228,
    189
  ],
  "260": [
    242,
    128
  ],
  "261": [
    230,
    136
  ],
  "262": [
    233,
    129
  ],
  "263": [
    240,
    154
  ],
  "264": [
    257,
    165
  ],
  "265": [
    262,
    147
  ],
  "266": [
    249,
    156
  ],
  "267": [
    243,
    186
  ],
  "268": [
    258,
    175
  ],
  "269": [
    229,
    144
  ],
  "270": [
    251,
    180
  ],
  "271": [
    227,
    128
  ],
  "272": [
    230,
    156
  ],
  "273": [
    261,
    145
  ],
  "274": [
    271,
    130
  ],
  "275": [
    229,
    176
  ],
  "276": [
    230,
    151
  ],
  "277": [
    231,
    142
  ],
  "278": [
    229,
    142
  ],
  "279": [
    249,
    157
  ],
  "280": [
    250,
    153
  ],
  "281": [
    245,
    150
  ],
  "282": [
    229,
    165
  ],
  "283": [
    229,
    135
  ],
  "284": [
    229,
    173
  ],
  "285": [
    229,
    191
  ],
  "286": [
    259,
    160
  ],
  "287": [
    229,
    167
  ],
  "288": [
    231,
    157
  ],
  "289": [
    229,
    155
  ],
  "290": [
    230,
    137
  ],
  "291": [
    233,
    135
  ],
  "292": [
    132,
    191
  ],
  "293": [
    232,
    180
  ],
  "294": [
    278,
    187
  ],
  "295": [
    232,
    167
  ],
  "296": [
    288,
    128
  ],
  "297": [
    229,
    292
  ],
  "298": [
    229,
    136
  ],
  "299": [
    255,
    159
  ],
  "300": [
    277,
    137
  ],
  "301": [
    229,
    166
  ],
  "302": [
    272,
    137
  ],
  "303": [
    256,
    157
  ],
  "304": [
    242,
    170
  ],
  "305": [
    32,
    32
  ],
  "306": [
    232,
    181
  ],
  "307": [
    284,
    144
  ],
  "308": [
    233,
    130
  ],
  "309": [
    229,
    190
  ],
  "310": [
    228,
    190
  ],
  "311": [
    247,
    136
  ],
  "312": [
    293,
    190
  ],
  "313": [
    233,
    151
  ],
  "314": [
    229,
    156
  ],
  "315": [
    291,
    140
  ],
  "316": [
    229,
    133
  ],
  "317": [
    245,
    172
  ],
  "318": [
    308,
    163
  ],
  "319": [
    295,
    129
  ],
  "320": [
    230,
    173
  ],
  "321": [
    247,
    170
  ],
  "322": [
    229,
    145
  ],
  "323": [
    231,
    172
  ],
  "324": [
    230,
    128
  ],
  "325": [
    248,
    170
  ],
  "326": [
    231,
    156
  ],
  "327": [
    310,
    191
  ],
  "328": [
    314,
    168
  ],
  "329": [
    282,
    189
  ],
  "330": [
    303,
    300
  ],
  "331": [
    232,
    128
  ],
  "332": [
    323,
    145
  ],
  "333": [
    256,
    182
  ],
  "334": [
    229,
    141
  ],
  "335": [
    242,
    138
  ],
  "336": [
    255,
    136
  ],
  "337": [
    228,
    188
  ],
  "338": [
    229,
    134
  ],
  "339": [
    232,
    135
  ],
  "340": [
    309,
    151
  ],
  "341": [
    230,
    175
  ],
  "342": [
    229,
    185
  ],
  "343": [
    287,
    144
  ],
  "344": [
    231,
    159
  ],
  "345": [
    248,
    167
  ],
  "346": [
    230,
    131
  ],
  "347": [
    248,
    180
  ],
  "348": [
    131,
    189
  ],
  "349": [
    269,
    172
  ],
  "350": [
    231,
    148
  ],
  "351": [
    275,
    177
  ],
  "352": [
    231,
    187
  ],
  "353": [
    283,
    186
  ],
  "354": [
    240,
    159
  ],
  "355": [
    289,
    158
  ],
  "356": [
    166,
    129
  ],
  "357": [
    229,
    183
  ],
  "358": [
    276,
    165
  ],
  "359": [
    344,
    165
  ],
  "360": [
    232,
    356
  ],
  "361": [
    10,
    10
  ],
  "362": [
    230,
    178
  ],
  "363": [
    230,
    139
  ],
  "364": [
    242,
    139
  ],
  "365": [
    229,
    146
  ],
  "366": [
    233,
    348
  ],
  "367": [
    243,
    139
  ],
  "368": [
    285,
    131
  ],
  "369": [
    229,
    188
  ],
  "370": [
    231,
    136
  ],
  "371": [
    231,
    173
  ],
  "372": [
    243,
    140
  ],
  "373": [
    331,
    129
  ],
  "374": [
    229,
    186
  ],
  "375": [
    305,
    32
  ],
  "376": [
    233,
    157
  ],
  "377": [
    250,
    135
  ],
  "378": [
    230,
    150
  ],
  "379": [
    251,
    157
  ],
  "380": [
    250,
    152
  ],
  "381": [
    229,
    128
  ],
  "382": [
    306,
    183
  ],
  "383": [
    339,
    170
  ],
  "384": [
    230,
    138
  ],
  "385": [
    332,
    265
  ],
  "386": [
    230,
    148
  ],
  "387": [
    326,
    139
  ],
  "388": [
    301,
    130
  ],
  "389": [
    230,
    149
  ],
  "390": [
    232,
    174
  ],
  "391": [
    229,
    184
  ],
  "392": [
    247,
    171
  ],
  "393": [
    298,
    176
  ],
  "394": [
    362,
    161
  ],
  "395": [
    242,
    164
  ],
  "396": [
    233,
    146
  ],
  "397": [
    229,
    168
  ],
  "398": [
    341,
    141
  ],
  "399": [
    243,
    155
  ],
  "400": [
    276,
    182
  ],
  "401": [
    255,
    139
  ],
  "402": [
    245,
    138
  ],
  "403": [
    230,
    176
  ],
  "404": [
    231,
    189
  ],
  "405": [
    313,
    174
  ],
  "406": [
    275,
    143
  ],
  "407": [
    233,
    128
  ],
  "408": [
    231,
    186
  ],
  "409": [
    289,
    160
  ],
  "410": [
    283,
    164
  ],
  "411": [
    231,
    144
  ],
  "412": [
    371,
    137
  ],
  "413": [
    230,
    160
  ],
  "414": [
    240,
    129
  ],
  "415": [
    325,
    325
  ],
  "416": [
    229,
    147
  ],
  "417": [
    397,
    152
  ],
  "418": [
    322,
    162
  ],
  "419": [
    247,
    175
  ],
  "420": [
    229,
    138
  ],
  "421": [
    245,
    128
  ],
  "422": [
    421,
    336
  ],
  "423": [
    230,
    158
  ],
  "424": [
    248,
    171
  ],
  "425": [
    285,
    153
  ],
  "426": [
    282,
    182
  ],
  "427": [
    370,
    183
  ],
  "428": [
    376,
    162
  ],
  "429": [
    232,
    138
  ],
  "430": [
    346,
    179
  ],
  "431": [
    232,
    176
  ],
  "432": [
    290,
    141
  ],
  "433": [
    410,
    343
  ],
  "434": [
    231,
    155
  ],
  "435": [
    232,
    162
  ],
  "436": [
    230,
    142
  ],
  "437": [
    244,
    260
  ],
  "438": [
    231,
    171
  ],
  "439": [
    230,
    132
  ],
  "440": [
    277,
    139
  ],
  "441": [
    242,
    173
  ],
  "442": [
    312,
    398
  ],
  "443": [
    233,
    187
  ],
  "444": [
    229,
    137
  ],
  "445": [
    290,
    147
  ],
  "446": [
    232,
    190
  ],
  "447": [
    250,
    155
  ],
  "448": [
    229,
    157
  ],
  "449": [
    381,
    146
  ],
  "450": [
    320,
    164
  ],
  "451": [
    229,
    189
  ],
  "452": [
    404,
    162
  ],
  "453": [
    232,
    183
  ],
  "454": [
    232,
    139
  ],
  "455": [
    413,
    183
  ],
  "456": [
    424,
    267
  ],
  "457": [
    365,
    140
  ],
  "458": [
    269,
    131
  ],
  "459": [
    232,
    161
  ],
  "460": [
    299,
    254
  ],
  "461": [
    231,
    174
  ],
  "462": [
    231,
    132
  ],
  "463": [
    233,
    155
  ],
  "464": [
    320,
    163
  ],
  "465": [
    283,
    160
  ],
  "466": [
    269,
    142
  ],
  "467": [
    276,
    160
  ],
  "468": [
    287,
    145
  ],
  "469": [
    229,
    129
  ],
  "470": [
    153,
    189
  ],
  "471": [
    230,
    129
  ],
  "472": [
    230,
    155
  ],
  "473": [
    248,
    169
  ],
  "474": [
    443,
    155
  ],
  "475": [
    232,
    186
  ],
  "476": [
    474,
    300
  ],
  "477": [
    229,
    175
  ],
  "478": [
    229,
    150
  ],
  "479": [
    444,
    141
  ],
  "480": [
    229,
    177
  ],
  "481": [
    260,
    304
  ],
  "482": [
    233,
    154
  ],
  "483": [
    462,
    182
  ],
  "484": [
    313,
    168
  ],
  "485": [
    230,
    153
  ],
  "486": [
    338,
    141
  ],
  "487": [
    298,
    171
  ],
  "488": [
    242,
    186
  ],
  "489": [
    439,
    143
  ],
  "490": [
    306,
    176
  ],
  "491": [
    242,
    171
  ],
  "492": [
    273,
    317
  ],
  "493": [
    248,
    150
  ],
  "494": [
    435,
    173
  ],
  "495": [
    324,
    142
  ],
  "496": [
    231,
    180
  ],
  "497": [
    242,
    137
  ],
  "498": [
    318,
    315
  ],
  "499": [
    301,
    185
  ],
  "500": [
    337,
    151
  ],
  "501": [
    350,
    159
  ],
  "502": [
    378,
    185
  ],
  "503": [
    494,
    267
  ],
  "504": [
    258,
    142
  ],
  "505": [
    259,
    156
  ],
  "506": [
    248,
    154
  ],
  "507": [
    357,
    178
  ],
  "508": [
    275,
    134
  ],
  "509": [
    475,
    171
  ],
  "510": [
    384,
    138
  ],
  "511": [
    231,
    167
  ],
  "512": [
    233,
    166
  ],
  "513": [
    468,
    417
  ],
  "514": [
    245,
    165
  ],
  "515": [
    403,
    148
  ],
  "516": [
    228,
    191
  ],
  "517": [
    232,
    150
  ],
  "518": [
    259,
    149
  ],
  "519": [
    233,
    184
  ],
  "520": [
    396,
    151
  ],
  "521": [
    233,
    153
  ],
  "522": [
    294,
    244
  ],
  "523": [
    440,
    456
  ],
  "524": [
    229,
    163
  ],
  "525": [
    231,
    158
  ],
  "526": [
    352,
    153
  ],
  "527": [
    243,
    178
  ],
  "528": [
    231,
    151
  ],
  "529": [
    230,
    172
  ],
  "530": [
    303,
    520
  ],
  "531": [
    448,
    144
  ],
  "532": [
    363,
    191
  ],
  "533": [
    342,
    180
  ],
  "534": [
    353,
    264
  ],
  "535": [
    231,
    130
  ],
  "536": [
    290,
    139
  ],
  "537": [
    382,
    264
  ],
  "538": [
    495,
    336
  ],
  "539": [
    349,
    244
  ],
  "540": [
    232,
    132
  ],
  "541": [
    242,
    142
  ],
  "542": [
    233,
    161
  ],
  "543": [
    261,
    191
  ],
  "544": [
    251,
    183
  ],
  "545": [
    350,
    168
  ],
  "546": [
    454,
    165
  ],
  "547": [
    334,
    129
  ],
  "548": [
    286,
    317
  ],
  "549": [
    232,
    189
  ],
  "550": [
    388,
    402
  ],
  "551": [
    247,
    145
  ],
  "552": [
    517,
    155
  ],
  "553": [
    491,
    347
  ],
  "554": [
    242,
    148
  ],
  "555": [
    359,
    265
  ],
  "556": [
    230,
    140
  ],
  "557": [
    230,
    179
  ],
  "558": [
    232,
    141
  ],
  "559": [
    270,
    265
  ],
  "560": [
    258,
    165
  ],
  "561": [
    373,
    415
  ],
  "562": [
    386,
    191
  ],
  "563": [
    322,
    189
  ],
  "564": [
    287,
    168
  ],
  "565": [
    301,
    136
  ],
  "566": [
    278,
    159
  ],
  "567": [
    280,
    315
  ],
  "568": [
    290,
    128
  ],
  "569": [
    233,
    133
  ],
  "570": [
    231,
    131
  ],
  "571": [
    231,
    165
  ],
  "572": [
    312,
    562
  ],
  "573": [
    429,
    177
  ],
  "574": [
    248,
    132
  ],
  "575": [
    232,
    136
  ],
  "576": [
    342,
    179
  ],
  "577": [
    446,
    185
  ],
  "578": [
    316,
    136
  ],
  "579": [
    411,
    143
  ],
  "580": [
    357,
    177
  ],
  "581": [
    338,
    133
  ],
  "582": [
    270,
    296
  ],
  "583": [
    281,
    317
  ],
  "584": [
    230,
    130
  ],
  "585": [
    431,
    129
  ],
  "586": [
    259,
    143
  ],
  "587": [
    525,
    167
  ],
  "588": [
    461,
    161
  ],
  "589": [
    229,
    169
  ],
  "590": [
    320,
    187
  ],
  "591": [
    282,
    179
  ],
  "592": [
    232,
    182
  ],
  "593": [
    426,
    426
  ],
  "594": [
    233,
    165
  ],
  "595": [
    264,
    244
  ],
  "596": [
    407,
    129
  ],
  "597": [
    500,
    267
  ],
  "598": [
    231,
    143
  ],
  "599": [
    233,
    147
  ],
  "600": [
    254,
    268
  ],
  "601": [
    260,
    428
  ],
  "602": [
    233,
    162
  ],
  "603": [
    339,
    179
  ],
  "604": [
    383,
    580
  ],
  "605": [
    250,
    158
  ],
  "606": [
    276,
    169
  ],
  "607": [
    322,
    138
  ],
  "608": [
    337,
    154
  ],
  "609": [
    230,
    180
  ],
  "610": [
    232,
    165
  ],
  "611": [
    231,
    149
  ],
  "612": [
    272,
    136
  ],
  "613": [
    309,
    128
  ],
  "614": [
    242,
    156
  ],
  "615": [
    321,
    319
  ],
  "616": [
    254,
    340
  ],
  "617": [
    391,
    166
  ],
  "618": [
    374,
    148
  ],
  "619": [
    229,
    140
  ],
  "620": [
    232,
    140
  ],
  "621": [
    230,
    183
  ],
  "622": [
    610,
    191
  ],
  "623": [
    423,
    151
  ],
  "624": [
    312,
    579
  ],
  "625": [
    230,
    184
  ],
  "626": [
    512,
    153
  ],
  "627": [
    232,
    470
  ],
  "628": [
    395,
    304
  ],
  "629": [
    285,
    133
  ],
  "630": [
    394,
    302
  ],
  "631": [
    245,
    142
  ],
  "632": [
    298,
    134
  ],
  "633": [
    247,
    163
  ],
  "634": [
    289,
    155
  ],
  "635": [
    324,
    149
  ],
  "636": [
    231,
    129
  ],
  "637": [
    254,
    232
  ],
  "638": [
    231,
    137
  ],
  "639": [
    524,
    176
  ],
  "640": [
    233,
    163
  ],
  "641": [
    451,
    147
  ],
  "642": [
    272,
    170
  ],
  "643": [
    231,
    169
  ],
  "644": [
    256,
    137
  ],
  "645": [
    243,
    145
  ],
  "646": [
    254,
    359
  ],
  "647": [
    535,
    185
  ],
  "648": [
    416,
    165
  ],
  "649": [
    334,
    180
  ],
  "650": [
    386,
    190
  ],
  "651": [
    230,
    177
  ],
  "652": [
    389,
    162
  ],
  "653": [
    411,
    134
  ],
  "654": [
    326,
    188
  ],
  "655": [
    333,
    253
  ],
  "656": [
    576,
    297
  ],
  "657": [
    229,
    148
  ],
  "658": [
    230,
    181
  ],
  "659": [
    369,
    128
  ],
  "660": [
    280,
    304
  ],
  "661": [
    349,
    319
  ],
  "662": [
    478,
    156
  ],
  "663": [
    257,
    142
  ],
  "664": [
    230,
    161
  ],
  "665": [
    314,
    176
  ],
  "666": [
    233,
    152
  ],
  "667": [
    229,
    178
  ],
  "668": [
    255,
    166
  ],
  "669": [
    261,
    144
  ],
  "670": [
    346,
    133
  ],
  "671": [
    291,
    145
  ],
  "672": [
    231,
    150
  ],
  "673": [
    280,
    455
  ],
  "674": [
    528,
    133
  ],
  "675": [
    287,
    165
  ],
  "676": [
    232,
    131
  ],
  "677": [
    373,
    427
  ],
  "678": [
    482,
    190
  ],
  "679": [
    408,
    162
  ],
  "680": [
    284,
    151
  ],
  "681": [
    447,
    264
  ],
  "682": [
    438,
    159
  ],
  "683": [
    326,
    159
  ],
  "684": [
    334,
    138
  ],
  "685": [
    251,
    137
  ],
  "686": [
    342,
    182
  ],
  "687": [
    453,
    159
  ],
  "688": [
    247,
    165
  ],
  "689": [
    230,
    185
  ],
  "690": [
    256,
    152
  ],
  "691": [
    569,
    146
  ],
  "692": [
    472,
    180
  ],
  "693": [
    607,
    685
  ],
  "694": [
    589,
    134
  ],
  "695": [
    365,
    177
  ],
  "696": [
    269,
    132
  ],
  "697": [
    599,
    182
  ],
  "698": [
    168,
    128
  ],
  "699": [
    351,
    268
  ],
  "700": [
    231,
    470
  ],
  "701": [
    230,
    143
  ],
  "702": [
    614,
    622
  ],
  "703": [
    416,
    173
  ],
  "704": [
    253,
    267
  ],
  "705": [
    269,
    140
  ],
  "706": [
    695,
    317
  ],
  "707": [
    269,
    145
  ],
  "708": [
    230,
    141
  ],
  "709": [
    689,
    152
  ],
  "710": [
    230,
    159
  ],
  "711": [
    259,
    191
  ],
  "712": [
    295,
    137
  ],
  "713": [
    289,
    173
  ],
  "714": [
    229,
    152
  ],
  "715": [
    396,
    177
  ],
  "716": [
    374,
    156
  ],
  "717": [
    343,
    343
  ],
  "718": [
    243,
    148
  ],
  "719": [
    256,
    154
  ],
  "720": [
    269,
    141
  ],
  "721": [
    469,
    154
  ],
  "722": [
    232,
    137
  ],
  "723": [
    243,
    142
  ],
  "724": [
    233,
    185
  ],
  "725": [
    233,
    149
  ],
  "726": [
    232,
    130
  ],
  "727": [
    598,
    141
  ],
  "728": [
    321,
    268
  ],
  "729": [
    232,
    143
  ],
  "730": [
    321,
    340
  ],
  "731": [
    275,
    145
  ],
  "732": [
    564,
    565
  ],
  "733": [
    242,
    187
  ],
  "734": [
    285,
    171
  ],
  "735": [
    371,
    148
  ],
  "736": [
    341,
    148
  ],
  "737": [
    251,
    165
  ],
  "738": [
    275,
    164
  ],
  "739": [
    261,
    150
  ],
  "740": [
    355,
    264
  ],
  "741": [
    480,
    139
  ],
  "742": [
    288,
    161
  ],
  "743": [
    436,
    162
  ],
  "744": [
    233,
    170
  ],
  "745": [
    496,
    171
  ],
  "746": [
    313,
    185
  ],
  "747": [
    345,
    333
  ],
  "748": [
    231,
    188
  ],
  "749": [
    280,
    399
  ],
  "750": [
    459,
    140
  ],
  "751": [
    372,
    427
  ],
  "752": [
    403,
    143
  ],
  "753": [
    331,
    140
  ],
  "754": [
    352,
    143
  ],
  "755": [
    254,
    329
  ],
  "756": [
    232,
    698
  ],
  "757": [
    620,
    182
  ],
  "758": [
    313,
    180
  ],
  "759": [
    230,
    133
  ],
  "760": [
    230,
    144
  ],
  "761": [
    232,
    159
  ],
  "762": [
    245,
    182
  ],
  "763": [
    391,
    184
  ],
  "764": [
    423,
    156
  ],
  "765": [
    319,
    244
  ],
  "766": [
    436,
    165
  ],
  "767": [
    389,
    133
  ],
  "768": [
    248,
    156
  ],
  "769": [
    231,
    162
  ],
  "770": [
    352,
    134
  ],
  "771": [
    254,
    377
  ],
  "772": [
    594,
    173
  ],
  "773": [
    231,
    139
  ],
  "774": [
    229,
    171
  ],
  "775": [
    251,
    173
  ],
  "776": [
    568,
    514
  ],
  "777": [
    233,
    148
  ],
  "778": [
    330,
    265
  ],
  "779": [
    353,
    294
  ],
  "780": [
    552,
    732
  ],
  "781": [
    434,
    184
  ],
  "782": [
    433,
    297
  ],
  "783": [
    342,
    178
  ],
  "784": [
    230,
    162
  ],
  "785": [
    230,
    146
  ],
  "786": [
    640,
    142
  ],
  "787": [
    540,
    184
  ],
  "788": [
    253,
    379
  ],
  "789": [
    231,
    153
  ],
  "790": [
    231,
    164
  ],
  "791": [
    230,
    187
  ],
  "792": [
    233,
    172
  ],
  "793": [
    459,
    163
  ],
  "794": [
    299,
    268
  ],
  "795": [
    231,
    179
  ],
  "796": [
    519,
    179
  ],
  "797": [
    290,
    190
  ],
  "798": [
    377,
    264
  ],
  "799": [
    231,
    166
  ],
  "800": [
    369,
    160
  ],
  "801": [
    743,
    560
  ],
  "802": [
    301,
    135
  ],
  "803": [
    519,
    175
  ],
  "804": [
    796,
    803
  ],
  "805": [
    253,
    367
  ],
  "806": [
    285,
    189
  ],
  "807": [
    260,
    400
  ],
  "808": [
    280,
    336
  ],
  "809": [
    231,
    178
  ],
  "810": [
    724,
    131
  ],
  "811": [
    230,
    145
  ],
  "812": [
    745,
    810
  ],
  "813": [
    571,
    158
  ],
  "814": [
    276,
    162
  ],
  "815": [
    270,
    244
  ],
  "816": [
    316,
    182
  ],
  "817": [
    388,
    450
  ],
  "818": [
    232,
    163
  ],
  "819": [
    316,
    165
  ],
  "820": [
    308,
    162
  ],
  "821": [
    272,
    172
  ],
  "822": [
    324,
    157
  ],
  "823": [
    232,
    142
  ],
  "824": [
    374,
    149
  ],
  "825": [
    229,
    170
  ],
  "826": [
    584,
    132
  ],
  "827": [
    331,
    133
  ],
  "828": [
    231,
    133
  ],
  "829": [
    259,
    134
  ],
  "830": [
    722,
    178
  ],
  "831": [
    461,
    151
  ],
  "832": [
    403,
    180
  ],
  "833": [
    529,
    161
  ],
  "834": [
    709,
    645
  ],
  "835": [
    324,
    165
  ],
  "836": [
    694,
    307
  ],
  "837": [
    420,
    157
  ],
  "838": [
    499,
    499
  ],
  "839": [
    420,
    168
  ],
  "840": [
    232,
    144
  ],
  "841": [
    368,
    315
  ],
  "842": [
    230,
    154
  ],
  "843": [
    256,
    140
  ],
  "844": [
    254,
    652
  ],
  "845": [
    270,
    253
  ],
  "846": [
    725,
    191
  ],
  "847": [
    312,
    727
  ],
  "848": [
    663,
    408
  ],
  "849": [
    273,
    253
  ],
  "850": [
    310,
    157
  ],
  "851": [
    252,
    134
  ],
  "852": [
    485,
    154
  ],
  "853": [
    637,
    348
  ],
  "854": [
    452,
    244
  ],
  "855": [
    366,
    268
  ],
  "856": [
    386,
    182
  ],
  "857": [
    306,
    182
  ],
  "858": [
    402,
    358
  ],
  "859": [
    232,
    147
  ],
  "860": [
    390,
    184
  ],
  "861": [
    516,
    161
  ],
  "862": [
    465,
    304
  ],
  "863": [
    697,
    307
  ],
  "864": [
    363,
    137
  ],
  "865": [
    242,
    150
  ],
  "866": [
    232,
    348
  ],
  "867": [
    848,
    168
  ],
  "868": [
    295,
    163
  ],
  "869": [
    243,
    166
  ],
  "870": [
    485,
    180
  ],
  "871": [
    232,
    133
  ],
  "872": [
    370,
    182
  ],
  "873": [
    229,
    149
  ],
  "874": [
    735,
    618
  ],
  "875": [
    231,
    145
  ],
  "876": [
    231,
    191
  ],
  "877": [
    270,
    379
  ],
  "878": [
    380,
    302
  ],
  "879": [
    372,
    267
  ],
  "880": [
    337,
    188
  ],
  "881": [
    369,
    159
  ],
  "882": [
    592,
    138
  ],
  "883": [
    557,
    170
  ],
  "884": [
    521,
    162
  ],
  "885": [
    285,
    181
  ],
  "886": [
    247,
    150
  ],
  "887": [
    667,
    130
  ],
  "888": [
    322,
    168
  ],
  "889": [
    280,
    260
  ],
  "890": [
    231,
    170
  ],
  "891": [
    825,
    179
  ],
  "892": [
    608,
    307
  ],
  "893": [
    738,
    752
  ],
  "894": [
    870,
    463
  ],
  "895": [
    894,
    175
  ],
  "896": [
    389,
    163
  ],
  "897": [
    381,
    153
  ],
  "898": [
    392,
    281
  ],
  "899": [
    496,
    160
  ],
  "900": [
    701,
    144
  ],
  "901": [
    232,
    129
  ],
  "902": [
    232,
    177
  ],
  "903": [
    230,
    182
  ],
  "904": [
    321,
    588
  ],
  "905": [
    338,
    183
  ],
  "906": [
    611,
    153
  ],
  "907": [
    256,
    158
  ],
  "908": [
    284,
    169
  ],
  "909": [
    316,
    132
  ],
  "910": [
    244,
    281
  ],
  "911": [
    625,
    133
  ],
  "912": [
    477,
    185
  ],
  "913": [
    318,
    577
  ],
  "914": [
    478,
    157
  ],
  "915": [
    651,
    130
  ],
  "916": [
    316,
    180
  ],
  "917": [
    828,
    167
  ],
  "918": [
    324,
    167
  ],
  "919": [
    675,
    675
  ],
  "920": [
    789,
    190
  ],
  "921": [
    438,
    153
  ],
  "922": [
    298,
    153
  ],
  "923": [
    891,
    802
  ],
  "924": [
    275,
    154
  ],
  "925": [
    233,
    169
  ],
  "926": [
    557,
    149
  ],
  "927": [
    338,
    153
  ],
  "928": [
    309,
    133
  ],
  "929": [
    741,
    315
  ],
  "930": [
    493,
    347
  ],
  "931": [
    284,
    166
  ],
  "932": [
    790,
    188
  ],
  "933": [
    542,
    189
  ],
  "934": [
    268,
    304
  ],
  "935": [
    231,
    190
  ],
  "936": [
    298,
    152
  ],
  "937": [
    299,
    302
  ],
  "938": [
    264,
    253
  ],
  "939": [
    638,
    169
  ],
  "940": [
    230,
    163
  ],
  "941": [
    233,
    156
  ],
  "942": [
    280,
    379
  ],
  "943": [
    251,
    151
  ],
  "944": [
    233,
    186
  ],
  "945": [
    280,
    268
  ],
  "946": [
    247,
    141
  ],
  "947": [
    276,
    167
  ],
  "948": [
    558,
    175
  ],
  "949": [
    859,
    137
  ],
  "950": [
    275,
    189
  ],
  "951": [
    328,
    567
  ],
  "952": [
    875,
    158
  ],
  "953": [
    272,
    141
  ],
  "954": [
    250,
    142
  ],
  "955": [
    445,
    551
  ],
  "956": [
    761,
    160
  ],
  "957": [
    472,
    190
  ],
  "958": [
    233,
    134
  ],
  "959": [
    369,
    132
  ],
  "960": [
    323,
    172
  ],
  "961": [
    463,
    168
  ],
  "962": [
    320,
    135
  ],
  "963": [
    319,
    281
  ],
  "964": [
    298,
    154
  ],
  "965": [
    383,
    483
  ],
  "966": [
    390,
    169
  ],
  "967": [
    341,
    149
  ],
  "968": [
    378,
    176
  ],
  "969": [
    229,
    172
  ],
  "970": [
    338,
    181
  ],
  "971": [
    313,
    178
  ],
  "972": [
    357,
    167
  ],
  "973": [
    284,
    157
  ],
  "974": [
    936,
    919
  ],
  "975": [
    245,
    164
  ],
  "976": [
    316,
    172
  ],
  "977": [
    258,
    168
  ],
  "978": [
    575,
    172
  ],
  "979": [
    791,
    161
  ],
  "980": [
    729,
    177
  ],
  "981": [
    511,
    139
  ],
  "982": [
    469,
    143
  ],
  "983": [
    346,
    156
  ],
  "984": [
    969,
    183
  ],
  "985": [
    463,
    170
  ],
  "986": [
    349,
    270
  ],
  "987": [
    402,
    297
  ],
  "988": [
    472,
    191
  ],
  "989": [
    482,
    143
  ],
  "990": [
    267,
    333
  ],
  "991": [
    405,
    265
  ],
  "992": [
    714,
    180
  ],
  "993": [
    250,
    145
  ],
  "994": [
    341,
    143
  ],
  "995": [
    231,
    140
  ],
  "996": [
    549,
    187
  ],
  "997": [
    388,
    518
  ],
  "998": [
    255,
    177
  ],
  "999": [
    318,
    399
  ],
  "1000": [
    435,
    171
  ],
  "1001": [
    552,
    956
  ],
  "1002": [
    337,
    160
  ],
  "1003": [
    820,
    456
  ],
  "1004": [
    233,
    171
  ],
  "1005": [
    471,
    144
  ],
  "1006": [
    529,
    162
  ],
  "1007": [
    259,
    141
  ],
  "1008": [
    328,
    498
  ],
  "1009": [
    247,
    138
  ],
  "1010": [
    310,
    141
  ],
  "1011": [
    245,
    141
  ],
  "1012": [
    406,
    553
  ],
  "1013": [
    233,
    189
  ],
  "1014": [
    277,
    176
  ],
  "1015": [
    247,
    151
  ],
  "1016": [
    329,
    244
  ],
  "1017": [
    558,
    163
  ],
  "1018": [
    602,
    134
  ],
  "1019": [
    231,
    138
  ],
  "1020": [
    287,
    138
  ],
  "1021": [
    316,
    171
  ],
  "1022": [
    229,
    160
  ],
  "1023": [
    643,
    191
  ],
  "1024": [
    324,
    170
  ],
  "1025": [
    420,
    158
  ],
  "1026": [
    393,
    244
  ],
  "1027": [
    186,
    297
  ],
  "1028": [
    1004,
    152
  ],
  "1029": [
    902,
    161
  ],
  "1030": [
    566,
    264
  ],
  "1031": [
    454,
    166
  ],
  "1032": [
    301,
    153
  ],
  "1033": [
    390,
    176
  ],
  "1034": [
    378,
    135
  ],
  "1035": [
    337,
    164
  ],
  "1036": [
    521,
    170
  ],
  "1037": [
    840,
    189
  ],
  "1038": [
    447,
    294
  ],
  "1039": [
    429,
    179
  ],
  "1040": [
    370,
    177
  ],
  "1041": [
    390,
    164
  ],
  "1042": [
    273,
    299
  ],
  "1043": [
    232,
    153
  ],
  "1044": [
    229,
    139
  ],
  "1045": [
    908,
    307
  ],
  "1046": [
    458,
    244
  ],
  "1047": [
    333,
    315
  ],
  "1048": [
    623,
    476
  ],
  "1049": [
    231,
    160
  ],
  "1050": [
    247,
    185
  ],
  "1051": [
    365,
    144
  ],
  "1052": [
    248,
    135
  ],
  "1053": [
    254,
    669
  ],
  "1054": [
    316,
    137
  ],
  "1055": [
    291,
    141
  ],
  "1056": [
    1020,
    499
  ],
  "1057": [
    944,
    157
  ],
  "1058": [
    257,
    145
  ],
  "1059": [
    480,
    177
  ],
  "1060": [
    1013,
    144
  ],
  "1061": [
    744,
    130
  ],
  "1062": [
    294,
    452
  ],
  "1063": [
    278,
    174
  ],
  "1064": [
    302,
    260
  ],
  "1065": [
    477,
    187
  ],
  "1066": [
    280,
    892
  ],
  "1067": [
    267,
    264
  ],
  "1068": [
    453,
    145
  ],
  "1069": [
    393,
    824
  ],
  "1070": [
    309,
    136
  ],
  "1071": [
    313,
    187
  ],
  "1072": [
    281,
    253
  ],
  "1073": [
    570,
    159
  ],
  "1074": [
    590,
    244
  ],
  "1075": [
    626,
    980
  ],
  "1076": [
    334,
    179
  ],
  "1077": [
    243,
    164
  ],
  "1078": [
    277,
    175
  ],
  "1079": [
    250,
    156
  ],
  "1080": [
    262,
    130
  ],
  "1081": [
    619,
    133
  ],
  "1082": [
    329,
    253
  ],
  "1083": [
    672,
    188
  ],
  "1084": [
    429,
    184
  ],
  "1085": [
    621,
    183
  ],
  "1086": [
    247,
    164
  ],
  "1087": [
    230,
    174
  ],
  "1088": [
    335,
    264
  ],
  "1089": [
    1057,
    612
  ],
  "1090": [
    792,
    159
  ],
  "1091": [
    330,
    385
  ],
  "1092": [
    564,
    417
  ],
  "1093": [
    229,
    162
  ],
  "1094": [
    504,
    700
  ],
  "1095": [
    254,
    328
  ],
  "1096": [
    437,
    304
  ],
  "1097": [
    306,
    143
  ],
  "1098": [
    247,
    148
  ],
  "1099": [
    611,
    165
  ],
  "1100": [
    254,
    555
  ],
  "1101": [
    605,
    425
  ],
  "1102": [
    648,
    648
  ],
  "1103": [
    504,
    297
  ],
  "1104": [
    376,
    153
  ],
  "1105": [
    316,
    187
  ],
  "1106": [
    491,
    1090
  ],
  "1107": [
    453,
    175
  ],
  "1108": [
    285,
    152
  ],
  "1109": [
    487,
    267
  ],
  "1110": [
    571,
    150
  ],
  "1111": [
    269,
    136
  ],
  "1112": [
    434,
    180
  ],
  "1113": [
    344,
    179
  ],
  "1114": [
    368,
    441
  ],
  "1115": [
    636,
    175
  ],
  "1116": [
    575,
    133
  ],
  "1117": [
    312,
    949
  ],
  "1118": [
    334,
    131
  ],
  "1119": [
    350,
    154
  ],
  "1120": [
    387,
    319
  ],
  "1121": [
    609,
    187
  ],
  "1122": [
    311,
    268
  ],
  "1123": [
    502,
    432
  ],
  "1124": [
    254,
    545
  ],
  "1125": [
    256,
    185
  ],
  "1126": [
    438,
    139
  ],
  "1127": [
    556,
    135
  ],
  "1128": [
    257,
    175
  ],
  "1129": [
    451,
    169
  ],
  "1130": [
    270,
    268
  ],
  "1131": [
    315,
    347
  ],
  "1132": [
    485,
    175
  ],
  "1133": [
    511,
    166
  ],
  "1134": [
    392,
    267
  ],
  "1135": [
    925,
    172
  ],
  "1136": [
    261,
    143
  ],
  "1137": [
    229,
    159
  ],
  "1138": [
    355,
    294
  ],
  "1139": [
    509,
    335
  ],
  "1140": [
    529,
    178
  ],
  "1141": [
    324,
    168
  ],
  "1142": [
    378,
    153
  ],
  "1143": [
    286,
    253
  ],
  "1144": [
    664,
    130
  ],
  "1145": [
    230,
    166
  ],
  "1146": [
    380,
    268
  ],
  "1147": [
    888,
    952
  ],
  "1148": [
    229,
    151
  ],
  "1149": [
    376,
    158
  ],
  "1150": [
    316,
    168
  ],
  "1151": [
    570,
    173
  ],
  "1152": [
    306,
    166
  ],
  "1153": [
    293,
    181
  ],
  "1154": [
    382,
    509
  ],
  "1155": [
    406,
    1063
  ],
  "1156": [
    313,
    183
  ],
  "1157": [
    230,
    292
  ],
  "1158": [
    723,
    268
  ],
  "1159": [
    369,
    186
  ],
  "1160": [
    437,
    355
  ],
  "1161": [
    774,
    130
  ],
  "1162": [
    233,
    173
  ],
  "1163": [
    431,
    162
  ],
  "1164": [
    658,
    129
  ],
  "1165": [
    489,
    822
  ],
  "1166": [
    372,
    593
  ],
  "1167": [
    549,
    172
  ],
  "1168": [
    526,
    281
  ],
  "1169": [
    326,
    129
  ],
  "1170": [
    764,
    483
  ],
  "1171": [
    538,
    455
  ],
  "1172": [
    316,
    141
  ],
  "1173": [
    255,
    144
  ],
  "1174": [
    273,
    270
  ],
  "1175": [
    318,
    304
  ],
  "1176": [
    507,
    754
  ],
  "1177": [
    687,
    479
  ],
  "1178": [
    390,
    186
  ],
  "1179": [
    496,
    167
  ],
  "1180": [
    254,
    388
  ],
  "1181": [
    276,
    129
  ],
  "1182": [
    324,
    187
  ],
  "1183": [
    350,
    187
  ],
  "1184": [
    321,
    302
  ],
  "1185": [
    471,
    169
  ],
  "1186": [
    733,
    489
  ],
  "1187": [
    423,
    129
  ],
  "1188": [
    282,
    180
  ],
  "1189": [
    306,
    150
  ],
  "1190": [
    245,
    153
  ],
  "1191": [
    643,
    186
  ],
  "1192": [
    298,
    187
  ],
  "1193": [
    242,
    135
  ],
  "1194": [
    585,
    359
  ],
  "1195": [
    337,
    143
  ],
  "1196": [
    882,
    551
  ],
  "1197": [
    232,
    151
  ],
  "1198": [
    657,
    172
  ],
  "1199": [
    230,
    168
  ],
  "1200": [
    306,
    181
  ],
  "1201": [
    657,
    164
  ],
  "1202": [
    255,
    176
  ],
  "1203": [
    587,
    587
  ],
  "1204": [
    302,
    267
  ],
  "1205": [
    327,
    270
  ],
  "1206": [
    983,
    560
  ],
  "1207": [
    302,
    422
  ],
  "1208": [
    524,
    171
  ],
  "1209": [
    404,
    170
  ],
  "1210": [
    543,
    441
  ],
  "1211": [
    311,
    270
  ],
  "1212": [
    549,
    166
  ],
  "1213": [
    591,
    297
  ],
  "1214": [
    688,
    379
  ],
  "1215": [
    322,
    134
  ],
  "1216": [
    777,
    153
  ],
  "1217": [
    389,
    153
  ],
  "1218": [
    231,
    168
  ],
  "1219": [
    259,
    147
  ],
  "1220": [
    248,
    177
  ],
  "1221": [
    312,
    1084
  ],
  "1222": [
    248,
    141
  ],
  "1223": [
    260,
    358
  ],
  "1224": [
    609,
    151
  ],
  "1225": [
    843,
    244
  ],
  "1226": [
    283,
    161
  ],
  "1227": [
    282,
    135
  ],
  "1228": [
    377,
    294
  ],
  "1229": [
    873,
    134
  ],
  "1230": [
    609,
    190
  ],
  "1231": [
    321,
    635
  ],
  "1232": [
    411,
    180
  ],
  "1233": [
    396,
    159
  ],
  "1234": [
    312,
    1152
  ],
  "1235": [
    175,
    244
  ],
  "1236": [
    678,
    265
  ],
  "1237": [
    329,
    399
  ],
  "1238": [
    710,
    179
  ],
  "1239": [
    511,
    141
  ],
  "1240": [
    229,
    154
  ],
  "1241": [
    773,
    172
  ],
  "1242": [
    512,
    150
  ],
  "1243": [
    792,
    188
  ],
  "1244": [
    269,
    169
  ],
  "1245": [
    636,
    181
  ],
  "1246": [
    584,
    178
  ],
  "1247": [
    244,
    465
  ],
  "1248": [
    676,
    161
  ],
  "1249": [
    795,
    138
  ],
  "1250": [
    662,
    1006
  ],
  "1251": [
    1244,
    1051
  ],
  "1252": [
    449,
    268
  ],
  "1253": [
    391,
    144
  ],
  "1254": [
    229,
    130
  ],
  "1255": [
    699,
    244
  ],
  "1256": [
    232,
    157
  ],
  "1257": [
    297,
    253
  ],
  "1258": [
    961,
    1058
  ],
  "1259": [
    256,
    129
  ],
  "1260": [
    378,
    173
  ],
  "1261": [
    273,
    351
  ],
  "1262": [
    254,
    586
  ],
  "1263": [
    442,
    265
  ],
  "1264": [
    271,
    138
  ],
  "1265": [
    314,
    186
  ],
  "1266": [
    272,
    128
  ],
  "1267": [
    390,
    174
  ],
  "1268": [
    617,
    244
  ],
  "1269": [
    970,
    554
  ],
  "1270": [
    302,
    244
  ],
  "1271": [
    637,
    130
  ],
  "1272": [
    434,
    174
  ],
  "1273": [
    890,
    151
  ],
  "1274": [
    909,
    881
  ],
  "1275": [
    1161,
    307
  ],
  "1276": [
    231,
    134
  ],
  "1277": [
    253,
    268
  ],
  "1278": [
    350,
    183
  ],
  "1279": [
    143,
    244
  ],
  "1280": [
    450,
    400
  ],
  "1281": [
    391,
    173
  ],
  "1282": [
    376,
    146
  ],
  "1283": [
    795,
    187
  ],
  "1284": [
    260,
    639
  ],
  "1285": [
    387,
    296
  ],
  "1286": [
    407,
    154
  ],
  "1287": [
    621,
    187
  ],
  "1288": [
    625,
    144
  ],
  "1289": [
    826,
    826
  ],
  "1290": [
    392,
    273
  ],
  "1291": [
    271,
    139
  ],
  "1292": [
    658,
    183
  ],
  "1293": [
    542,
    190
  ],
  "1294": [
    242,
    162
  ],
  "1295": [
    283,
    128
  ],
  "1296": [
    330,
    539
  ],
  "1297": [
    503,
    265
  ],
  "1298": [
    249,
    148
  ],
  "1299": [
    247,
    178
  ],
  "1300": [
    384,
    177
  ],
  "1301": [
    672,
    145
  ],
  "1302": [
    233,
    159
  ],
  "1303": [
    346,
    138
  ],
  "1304": [
    899,
    358
  ],
  "1305": [
    540,
    154
  ],
  "1306": [
    272,
    155
  ],
  "1307": [
    256,
    151
  ],
  "1308": [
    284,
    153
  ],
  "1309": [
    318,
    260
  ],
  "1310": [
    647,
    347
  ],
  "1311": [
    334,
    149
  ],
  "1312": [
    262,
    135
  ],
  "1313": [
    384,
    165
  ],
  "1314": [
    254,
    629
  ],
  "1315": [
    759,
    162
  ],
  "1316": [
    398,
    527
  ],
  "1317": [
    543,
    315
  ],
  "1318": [
    958,
    146
  ],
  "1319": [
    302,
    399
  ],
  "1320": [
    230,
    188
  ],
  "1321": [
    667,
    129
  ],
  "1322": [
    710,
    165
  ],
  "1323": [
    1271,
    175
  ],
  "1324": [
    244,
    395
  ],
  "1325": [
    340,
    244
  ],
  "1326": [
    1147,
    655
  ],
  "1327": [
    676,
    140
  ],
  "1328": [
    592,
    163
  ],
  "1329": [
    471,
    175
  ],
  "1330": [
    352,
    136
  ],
  "1331": [
    289,
    189
  ],
  "1332": [
    374,
    138
  ],
  "1333": [
    650,
    368
  ],
  "1334": [
    320,
    165
  ],
  "1335": [
    570,
    166
  ],
  "1336": [
    230,
    135
  ],
  "1337": [
    597,
    366
  ],
  "1338": [
    380,
    254
  ],
  "1339": [
    433,
    265
  ],
  "1340": [
    439,
    159
  ],
  "1341": [
    231,
    356
  ],
  "1342": [
    327,
    268
  ],
  "1343": [
    409,
    450
  ],
  "1344": [
    405,
    281
  ],
  "1345": [
    769,
    151
  ],
  "1346": [
    708,
    162
  ],
  "1347": [
    321,
    270
  ],
  "1348": [
    299,
    394
  ],
  "1349": [
    784,
    166
  ],
  "1350": [
    516,
    151
  ],
  "1351": [
    260,
    574
  ],
  "1352": [
    490,
    244
  ],
  "1353": [
    380,
    360
  ],
  "1354": [
    448,
    151
  ],
  "1355": [
    233,
    131
  ],
  "1356": [
    334,
    151
  ],
  "1357": [
    243,
    143
  ],
  "1358": [
    566,
    268
  ],
  "1359": [
    389,
    176
  ],
  "1360": [
    357,
    165
  ],
  "1361": [
    430,
    296
  ],
  "1362": [
    350,
    177
  ],
  "1363": [
    311,
    254
  ],
  "1364": [
    321,
    349
  ],
  "1365": [
    636,
    171
  ],
  "1366": [
    684,
    358
  ],
  "1367": [
    159,
    244
  ],
  "1368": [
    620,
    151
  ],
  "1369": [
    463,
    129
  ],
  "1370": [
    254,
    712
  ],
  "1371": [
    471,
    168
  ],
  "1372": [
    311,
    302
  ],
  "1373": [
    602,
    152
  ],
  "1374": [
    247,
    184
  ],
  "1375": [
    363,
    190
  ],
  "1376": [
    253,
    244
  ],
  "1377": [
    231,
    147
  ],
  "1378": [
    316,
    173
  ],
  "1379": [
    255,
    131
  ],
  "1380": [
    233,
    188
  ],
  "1381": [
    316,
    176
  ],
  "1382": [
    432,
    329
  ],
  "1383": [
    504,
    358
  ],
  "1384": [
    345,
    427
  ],
  "1385": [
    546,
    268
  ],
  "1386": [
    1039,
    690
  ],
  "1387": [
    516,
    157
  ],
  "1388": [
    301,
    131
  ],
  "1389": [
    369,
    149
  ],
  "1390": [
    903,
    130
  ],
  "1391": [
    535,
    149
  ],
  "1392": [
    254,
    360
  ],
  "1393": [
    407,
    146
  ],
  "1394": [
    589,
    182
  ],
  "1395": [
    372,
    343
  ],
  "1396": [
    799,
    187
  ],
  "1397": [
    309,
    174
  ],
  "1398": [
    333,
    267
  ],
  "1399": [
    381,
    152
  ],
  "1400": [
    532,
    244
  ],
  "1401": [
    259,
    155
  ],
  "1402": [
    469,
    183
  ],
  "1403": [
    490,
    264
  ],
  "1404": [
    299,
    351
  ],
  "1405": [
    811,
    134
  ],
  "1406": [
    671,
    1144
  ],
  "1407": [
    362,
    187
  ],
  "1408": [
    260,
    455
  ],
  "1409": [
    488,
    422
  ],
  "1410": [
    1032,
    300
  ],
  "1411": [
    230,
    165
  ],
  "1412": [
    233,
    178
  ],
  "1413": [
    254,
    319
  ],
  "1414": [
    387,
    244
  ],
  "1415": [
    231,
    163
  ],
  "1416": [
    554,
    270
  ],
  "1417": [
    569,
    141
  ],
  "1418": [
    312,
    1078
  ],
  "1419": [
    446,
    158
  ],
  "1420": [
    438,
    175
  ],
  "1421": [
    572,
    265
  ],
  "1422": [
    260,
    762
  ],
  "1423": [
    316,
    179
  ],
  "1424": [
    387,
    400
  ],
  "1425": [
    256,
    136
  ],
  "1426": [
    481,
    267
  ],
  "1427": [
    471,
    188
  ],
  "1428": [
    598,
    160
  ],
  "1429": [
    506,
    731
  ],
  "1430": [
    342,
    184
  ],
  "1431": [
    408,
    184
  ],
  "1432": [
    243,
    172
  ],
  "1433": [
    464,
    268
  ],
  "1434": [
    601,
    270
  ],
  "1435": [
    664,
    140
  ],
  "1436": [
    985,
    1369
  ],
  "1437": [
    430,
    382
  ],
  "1438": [
    431,
    131
  ],
  "1439": [
    232,
    184
  ],
  "1440": [
    400,
    897
  ],
  "1441": [
    621,
    177
  ],
  "1442": [
    602,
    132
  ],
  "1443": [
    434,
    152
  ],
  "1444": [
    242,
    131
  ],
  "1445": [
    984,
    984
  ],
  "1446": [
    1022,
    130
  ],
  "1447": [
    483,
    466
  ],
  "1448": [
    262,
    141
  ],
  "1449": [
    436,
    168
  ],
  "1450": [
    256,
    171
  ],
  "1451": [
    256,
    162
  ],
  "1452": [
    860,
    506
  ],
  "1453": [
    290,
    182
  ],
  "1454": [
    876,
    160
  ],
  "1455": [
    623,
    401
  ],
  "1456": [
    516,
    177
  ],
  "1457": [
    469,
    135
  ],
  "1458": [
    302,
    253
  ],
  "1459": [
    842,
    151
  ],
  "1460": [
    260,
    978
  ],
  "1461": [
    954,
    560
  ],
  "1462": [
    364,
    264
  ],
  "1463": [
    1455,
    973
  ],
  "1464": [
    339,
    180
  ],
  "1465": [
    384,
    172
  ],
  "1466": [
    397,
    182
  ],
  "1467": [
    523,
    265
  ],
  "1468": [
    687,
    296
  ],
  "1469": [
    505,
    422
  ],
  "1470": [
    320,
    162
  ],
  "1471": [
    298,
    169
  ],
  "1472": [
    451,
    146
  ],
  "1473": [
    230,
    147
  ],
  "1474": [
    1249,
    1390
  ],
  "1475": [
    476,
    265
  ],
  "1476": [
    377,
    244
  ],
  "1477": [
    563,
    267
  ],
  "1478": [
    272,
    157
  ],
  "1479": [
    258,
    147
  ],
  "1480": [
    1195,
    1010
  ],
  "1481": [
    514,
    466
  ],
  "1482": [
    556,
    137
  ],
  "1483": [
    290,
    152
  ],
  "1484": [
    302,
    304
  ],
  "1485": [
    408,
    170
  ],
  "1486": [
    420,
    160
  ],
  "1487": [
    256,
    179
  ],
  "1488": [
    1108,
    244
  ],
  "1489": [
    640,
    158
  ],
  "1490": [
    247,
    166
  ],
  "1491": [
    245,
    187
  ],
  "1492": [
    259,
    153
  ],
  "1493": [
    372,
    547
  ],
  "1494": [
    230,
    186
  ],
  "1495": [
    390,
    161
  ],
  "1496": [
    542,
    186
  ],
  "1497": [
    291,
    143
  ],
  "1498": [
    482,
    144
  ],
  "1499": [
    542,
    187
  ],
  "1500": [
    887,
    254
  ],
  "1501": [
    231,
    175
  ],
  "1502": [
    390,
    190
  ],
  "1503": [
    355,
    333
  ],
  "1504": [
    389,
    172
  ],
  "1505": [
    407,
    128
  ],
  "1506": [
    473,
    473
  ],
  "1507": [
    251,
    184
  ],
  "1508": [
    1188,
    432
  ],
  "1509": [
    229,
    131
  ],
  "1510": [
    466,
    264
  ],
  "1511": [
    229,
    187
  ],
  "1512": [
    558,
    137
  ],
  "1513": [
    445,
    349
  ],
  "1514": [
    532,
    296
  ],
  "1515": [
    286,
    351
  ],
  "1516": [
    260,
    355
  ],
  "1517": [
    413,
    185
  ],
  "1518": [
    823,
    178
  ],
  "1519": [
    531,
    296
  ],
  "1520": [
    357,
    174
  ],
  "1521": [
    297,
    307
  ],
  "1522": [
    267,
    253
  ],
  "1523": [
    592,
    129
  ],
  "1524": [
    809,
    190
  ],
  "1525": [
    363,
    156
  ],
  "1526": [
    547,
    632
  ],
  "1527": [
    255,
    157
  ],
  "1528": [
    301,
    165
  ],
  "1529": [
    1240,
    183
  ],
  "1530": [
    310,
    132
  ],
  "1531": [
    623,
    513
  ],
  "1532": [
    544,
    644
  ],
  "1533": [
    793,
    953
  ],
  "1534": [
    1200,
    1092
  ],
  "1535": [
    409,
    405
  ],
  "1536": [
    324,
    156
  ],
  "1537": [
    872,
    527
  ],
  "1538": [
    457,
    281
  ],
  "1539": [
    358,
    307
  ],
  "1540": [
    379,
    270
  ],
  "1541": [
    1289,
    253
  ],
  "1542": [
    453,
    170
  ],
  "1543": [
    611,
    170
  ],
  "1544": [
    232,
    146
  ],
  "1545": [
    294,
    253
  ],
  "1546": [
    511,
    176
  ],
  "1547": [
    1442,
    1052
  ],
  "1548": [
    501,
    515
  ],
  "1549": [
    823,
    1027
  ],
  "1550": [
    420,
    155
  ],
  "1551": [
    268,
    585
  ],
  "1552": [
    229,
    161
  ],
  "1553": [
    261,
    154
  ],
  "1554": [
    716,
    315
  ],
  "1555": [
    487,
    253
  ],
  "1556": [
    479,
    297
  ],
  "1557": [
    941,
    178
  ],
  "1558": [
    245,
    163
  ],
  "1559": [
    533,
    1485
  ],
  "1560": [
    443,
    132
  ],
  "1561": [
    570,
    167
  ],
  "1562": [
    299,
    366
  ],
  "1563": [
    531,
    364
  ],
  "1564": [
    555,
    244
  ],
  "1565": [
    392,
    286
  ],
  "1566": [
    530,
    265
  ],
  "1567": [
    230,
    189
  ],
  "1568": [
    592,
    179
  ],
  "1569": [
    316,
    177
  ],
  "1570": [
    231,
    177
  ],
  "1571": [
    419,
    268
  ],
  "1572": [
    296,
    244
  ],
  "1573": [
    460,
    652
  ],
  "1574": [
    254,
    345
  ],
  "1575": [
    254,
    419
  ],
  "1576": [
    1049,
    180
  ],
  "1577": [
    1137,
    142
  ],
  "1578": [
    407,
    160
  ],
  "1579": [
    345,
    424
  ],
  "1580": [
    229,
    158
  ],
  "1581": [
    648,
    297
  ],
  "1582": [
    386,
    185
  ],
  "1583": [
    232,
    145
  ],
  "1584": [
    556,
    130
  ],
  "1585": [
    619,
    150
  ],
  "1586": [
    856,
    1375
  ],
  "1587": [
    280,
    465
  ],
  "1588": [
    407,
    155
  ],
  "1589": [
    232,
    185
  ],
  "1590": [
    419,
    514
  ],
  "1591": [
    352,
    147
  ],
  "1592": [
    296,
    281
  ],
  "1593": [
    391,
    152
  ],
  "1594": [
    369,
    130
  ],
  "1595": [
    232,
    148
  ],
  "1596": [
    876,
    187
  ],
  "1597": [
    298,
    157
  ],
  "1598": [
    497,
    304
  ],
  "1599": [
    286,
    299
  ],
  "1600": [
    696,
    383
  ],
  "1601": [
    629,
    268
  ],
  "1602": [
    432,
    268
  ],
  "1603": [
    390,
    178
  ],
  "1604": [
    806,
    319
  ],
  "1605": [
    599,
    186
  ],
  "1606": [
    328,
    493
  ],
  "1607": [
    307,
    264
  ],
  "1608": [
    323,
    148
  ],
  "1609": [
    575,
    141
  ],
  "1610": [
    355,
    347
  ],
  "1611": [
    761,
    190
  ],
  "1612": [
    833,
    358
  ],
  "1613": [
    446,
    136
  ],
  "1614": [
    713,
    441
  ],
  "1615": [
    350,
    132
  ],
  "1616": [
    305,
    305
  ],
  "1617": [
    1616,
    9
  ],
  "1618": [
    1617,
    9
  ],
  "1619": [
    1618,
    361
  ],
  "1620": [
    544,
    244
  ],
  "1621": [
    541,
    281
  ],
  "1622": [
    254,
    296
  ],
  "1623": [
    799,
    143
  ],
  "1624": [
    271,
    128
  ],
  "1625": [
    457,
    924
  ],
  "1626": [
    416,
    132
  ],
  "1627": [
    361,
    960
  ],
  "1628": [
    244,
    273
  ],
  "1629": [
    307,
    315
  ],
  "1630": [
    726,
    175
  ],
  "1631": [
    513,
    317
  ],
  "1632": [
    273,
    268
  ],
  "1633": [
    880,
    253
  ],
  "1634": [
    874,
    244
  ],
  "1635": [
    594,
    174
  ],
  "1636": [
    282,
    136
  ],
  "1637": [
    1399,
    739
  ],
  "1638": [
    434,
    145
  ],
  "1639": [
    977,
    297
  ],
  "1640": [
    332,
    296
  ],
  "1641": [
    464,
    582
  ],
  "1642": [
    713,
    315
  ],
  "1643": [
    247,
    139
  ],
  "1644": [
    619,
    187
  ],
  "1645": [
    395,
    863
  ],
  "1646": [
    526,
    273
  ],
  "1647": [
    303,
    1232
  ],
  "1648": [
    303,
    1611
  ],
  "1649": [
    429,
    130
  ],
  "1650": [
    420,
    191
  ],
  "1651": [
    627,
    483
  ],
  "1652": [
    285,
    141
  ],
  "1653": [
    1199,
    170
  ],
  "1654": [
    565,
    565
  ],
  "1655": [
    287,
    148
  ],
  "1656": [
    1043,
    154
  ],
  "1657": [
    1110,
    1307
  ],
  "1658": [
    290,
    191
  ],
  "1659": [
    696,
    574
  ],
  "1660": [
    549,
    191
  ],
  "1661": [
    286,
    270
  ],
  "1662": [
    771,
    268
  ],
  "1663": [
    259,
    142
  ],
  "1664": [
    401,
    367
  ],
  "1665": [
    247,
    152
  ],
  "1666": [
    293,
    185
  ],
  "1667": [
    374,
    166
  ],
  "1668": [
    1019,
    185
  ],
  "1669": [
    453,
    179
  ],
  "1670": [
    521,
    164
  ],
  "1671": [
    295,
    146
  ],
  "1672": [
    659,
    244
  ],
  "1673": [
    408,
    185
  ],
  "1674": [
    324,
    128
  ],
  "1675": [
    251,
    187
  ],
  "1676": [
    651,
    164
  ],
  "1677": [
    759,
    140
  ],
  "1678": [
    666,
    180
  ],
  "1679": [
    394,
    244
  ],
  "1680": [
    360,
    1179
  ],
  "1681": [
    355,
    265
  ],
  "1682": [
    818,
    133
  ],
  "1683": [
    306,
    140
  ],
  "1684": [
    301,
    187
  ],
  "1685": [
    901,
    148
  ],
  "1686": [
    708,
    167
  ],
  "1687": [
    774,
    140
  ],
  "1688": [
    477,
    146
  ],
  "1689": [
    253,
    702
  ],
  "1690": [
    444,
    169
  ],
  "1691": [
    260,
    647
  ],
  "1692": [
    352,
    157
  ],
  "1693": [
    316,
    131
  ],
  "1694": [
    315,
    428
  ],
  "1695": [
    493,
    428
  ],
  "1696": [
    665,
    364
  ],
  "1697": [
    254,
    860
  ],
  "1698": [
    531,
    328
  ],
  "1699": [
    484,
    335
  ],
  "1700": [
    244,
    264
  ],
  "1701": [
    528,
    180
  ],
  "1702": [
    528,
    155
  ],
  "1703": [
    566,
    767
  ],
  "1704": [
    542,
    191
  ],
  "1705": [
    527,
    1553
  ],
  "1706": [
    553,
    317
  ],
  "1707": [
    332,
    270
  ],
  "1708": [
    260,
    387
  ],
  "1709": [
    310,
    155
  ],
  "1710": [
    272,
    168
  ],
  "1711": [
    619,
    151
  ],
  "1712": [
    508,
    264
  ],
  "1713": [
    1162,
    130
  ],
  "1714": [
    381,
    159
  ],
  "1715": [
    431,
    136
  ],
  "1716": [
    344,
    173
  ],
  "1717": [
    665,
    502
  ],
  "1718": [
    295,
    130
  ],
  "1719": [
    634,
    304
  ],
  "1720": [
    1229,
    1267
  ],
  "1721": [
    714,
    187
  ],
  "1722": [
    286,
    254
  ],
  "1723": [
    353,
    244
  ],
  "1724": [
    464,
    754
  ],
  "1725": [
    273,
    254
  ],
  "1726": [
    458,
    772
  ],
  "1727": [
    273,
    460
  ],
  "1728": [
    307,
    253
  ],
  "1729": [
    343,
    297
  ],
  "1730": [
    283,
    173
  ],
  "1731": [
