{
  "240": [
    239,
    188
  ],
  "241": [
    240,
    140
  ],
  "242": [
    228,
    184
  ],
  "243": [
    228,
    186
  ],
  "244": [
    227,
    128
  ],
  "245": [
    244,
    130
  ],
  "246": [
    226,
    128
  ],
  "247": [
    230,
    157
  ],
  "248": [
    229,
    164
  ],
  "249": [
    229,
    143
  ],
  "250": [
    229,
    174
  ],
  "251": [
    13,
    10
  ],
  "252": [
    32,
    32
  ],
  "253": [
    229,
    133
  ],
  "254": [
    233,
    129
  ],
  "255": [
    243,
    134
  ],
  "256": [
    229,
    176
  ],
  "257": [
    232,
    191
  ],
  "258": [
    228,
    189
  ],
  "259": [
    240,
    154
  ],
  "260": [
    254,
    147
  ],
  "261": [
    230,
    151
  ],
  "262": [
    242,
    128
  ],
  "263": [
    228,
    187
  ],
  "264": [
    247,
    165
  ],
  "265": [
    246,
    156
  ],
  "266": [
    229,
    144
  ],
  "267": [
    246,
    157
  ],
  "268": [
    243,
    186
  ],
  "269": [
    230,
    156
  ],
  "270": [
    228,
    185
  ],
  "271": [
    229,
    141
  ],
  "272": [
    230,
    152
  ],
  "273": [
    229,
    190
  ],
  "274": [
    242,
    141
  ],
  "275": [
    229,
    134
  ],
  "276": [
    229,
    142
  ],
  "277": [
    229,
    136
  ],
  "278": [
    230,
    173
  ],
  "279": [
    230,
    136
  ],
  "280": [
    232,
    175
  ],
  "281": [
    233,
    135
  ],
  "282": [
    229,
    156
  ],
  "283": [
    251,
    251
  ],
  "284": [
    252,
    32
  ],
  "285": [
    242,
    170
  ],
  "286": [
    230,
    177
  ],
  "287": [
    232,
    167
  ],
  "288": [
    272,
    175
  ],
  "289": [
    230,
    138
  ],
  "290": [
    232,
    181
  ],
  "291": [
    229,
    188
  ],
  "292": [
    242,
    138
  ],
  "293": [
    230,
    137
  ],
  "294": [
    229,
    155
  ],
  "295": [
    276,
    187
  ],
  "296": [
    233,
    130
  ],
  "297": [
    281,
    140
  ],
  "298": [
    228,
    190
  ],
  "299": [
    273,
    151
  ],
  "300": [
    228,
    188
  ],
  "301": [
    229,
    173
  ],
  "302": [
    230,
    149
  ],
  "303": [
    229,
    186
  ],
  "304": [
    231,
    154
  ],
  "305": [
    233,
    151
  ],
  "306": [
    296,
    163
  ],
  "307": [
    242,
    139
  ],
  "308": [
    229,
    183
  ],
  "309": [
    248,
    167
  ],
  "310": [
    250,
    139
  ],
  "311": [
    240,
    129
  ],
  "312": [
    233,
    169
  ],
  "313": [
    282,
    168
  ],
  "314": [
    229,
    135
  ],
  "315": [
    279,
    145
  ],
  "316": [
    275,
    155
  ],
  "317": [
    231,
    155
  ],
  "318": [
    249,
    170
  ],
  "319": [
    229,
    191
  ],
  "320": [
    287,
    129
  ],
  "321": [
    298,
    191
  ],
  "322": [
    231,
    148
  ],
  "323": [
    286,
    159
  ],
  "324": [
    256,
    134
  ],
  "325": [
    230,
    139
  ],
  "326": [
    233,
    131
  ],
  "327": [
    312,
    172
  ],
  "328": [
    304,
    132
  ],
  "329": [
    257,
    153
  ],
  "330": [
    229,
    165
  ],
  "331": [
    258,
    160
  ],
  "332": [
    269,
    137
  ],
  "333": [
    229,
    175
  ],
  "334": [
    229,
    177
  ],
  "335": [
    230,
    150
  ],
  "336": [
    233,
    157
  ],
  "337": [
    310,
    323
  ],
  "338": [
    280,
    180
  ],
  "339": [
    240,
    155
  ],
  "340": [
    242,
    164
  ],
  "341": [
    231,
    156
  ],
  "342": [
    229,
    184
  ],
  "343": [
    233,
    128
  ],
  "344": [
    229,
    137
  ],
  "345": [
    277,
    176
  ],
  "346": [
    263,
    150
  ],
  "347": [
    232,
    135
  ],
  "348": [
    229,
    166
  ],
  "349": [
    230,
    128
  ],
  "350": [
    232,
    161
  ],
  "351": [
    231,
    159
  ],
  "352": [
    256,
    143
  ],
  "353": [
    261,
    182
  ],
  "354": [
    314,
    186
  ],
  "355": [
    301,
    144
  ],
  "356": [
    334,
    177
  ],
  "357": [
    326,
    189
  ],
  "358": [
    261,
    165
  ],
  "359": [
    248,
    180
  ],
  "360": [
    240,
    159
  ],
  "361": [
    232,
    180
  ],
  "362": [
    230,
    158
  ],
  "363": [
    228,
    191
  ],
  "364": [
    229,
    145
  ],
  "365": [
    229,
    189
  ],
  "366": [
    229,
    147
  ],
  "367": [
    231,
    173
  ],
  "368": [
    242,
    137
  ],
  "369": [
    242,
    173
  ],
  "370": [
    344,
    141
  ],
  "371": [
    232,
    190
  ],
  "372": [
    233,
    152
  ],
  "373": [
    232,
    174
  ],
  "374": [
    231,
    157
  ],
  "375": [
    229,
    138
  ],
  "376": [
    289,
    138
  ],
  "377": [
    247,
    142
  ],
  "378": [
    232,
    183
  ],
  "379": [
    229,
    185
  ],
  "380": [
    278,
    164
  ],
  "381": [
    233,
    133
  ],
  "382": [
    341,
    139
  ],
  "383": [
    232,
    128
  ],
  "384": [
    347,
    170
  ],
  "385": [
    229,
    129
  ],
  "386": [
    232,
    131
  ],
  "387": [
    271,
    180
  ],
  "388": [
    231,
    187
  ],
  "389": [
    230,
    153
  ],
  "390": [
    233,
    162
  ],
  "391": [
    348,
    130
  ],
  "392": [
    230,
    176
  ],
  "393": [
    336,
    162
  ],
  "394": [
    231,
    142
  ],
  "395": [
    374,
    128
  ],
  "396": [
    242,
    142
  ],
  "397": [
    166,
    129
  ],
  "398": [
    229,
    159
  ],
  "399": [
    253,
    181
  ],
  "400": [
    249,
    136
  ],
  "401": [
    381,
    146
  ],
  "402": [
    230,
    148
  ],
  "403": [
    290,
    183
  ],
  "404": [
    294,
    158
  ],
  "405": [
    232,
    136
  ],
  "406": [
    230,
    142
  ],
  "407": [
    250,
    182
  ],
  "408": [
    243,
    140
  ],
  "409": [
    229,
    163
  ],
  "410": [
    232,
    397
  ],
  "411": [
    305,
    168
  ],
  "412": [
    270,
    159
  ],
  "413": [
    398,
    142
  ],
  "414": [
    248,
    169
  ],
  "415": [
    300,
    151
  ],
  "416": [
    229,
    150
  ],
  "417": [
    271,
    129
  ],
  "418": [
    230,
    129
  ],
  "419": [
    231,
    129
  ],
  "420": [
    330,
    189
  ],
  "421": [
    233,
    153
  ],
  "422": [
    233,
    161
  ],
  "423": [
    293,
    147
  ],
  "424": [
    367,
    137
  ],
  "425": [
    244,
    129
  ],
  "426": [
    258,
    149
  ],
  "427": [
    282,
    176
  ],
  "428": [
    366,
    165
  ],
  "429": [
    351,
    165
  ],
  "430": [
    232,
    139
  ],
  "431": [
    278,
    163
  ],
  "432": [
    266,
    172
  ],
  "433": [
    270,
    139
  ],
  "434": [
    385,
    154
  ],
  "435": [
    231,
    137
  ],
  "436": [
    253,
    172
  ],
  "437": [
    308,
    158
  ],
  "438": [
    365,
    147
  ],
  "439": [
    278,
    166
  ],
  "440": [
    229,
    157
  ],
  "441": [
    232,
    186
  ],
  "442": [
    231,
    171
  ],
  "443": [
    350,
    140
  ],
  "444": [
    229,
    146
  ],
  "445": [
    230,
    140
  ],
  "446": [
    340,
    285
  ],
  "447": [
    233,
    163
  ],
  "448": [
    253,
    136
  ],
  "449": [
    231,
    189
  ],
  "450": [
    390,
    134
  ],
  "451": [
    249,
    171
  ],
  "452": [
    231,
    153
  ],
  "453": [
    230,
    155
  ],
  "454": [
    263,
    138
  ],
  "455": [
    293,
    139
  ],
  "456": [
    250,
    152
  ],
  "457": [
    230,
    131
  ],
  "458": [
    247,
    128
  ],
  "459": [
    378,
    175
  ],
  "460": [
    317,
    184
  ],
  "461": [
    257,
    135
  ],
  "462": [
    302,
    153
  ],
  "463": [
    394,
    139
  ],
  "464": [
    230,
    184
  ],
  "465": [
    243,
    148
  ],
  "466": [
    243,
    139
  ],
  "467": [
    441,
    171
  ],
  "468": [
    230,
    179
  ],
  "469": [
    294,
    155
  ],
  "470": [
    277,
    134
  ],
  "471": [
    232,
    176
  ],
  "472": [
    444,
    140
  ],
  "473": [
    291,
    160
  ],
  "474": [
    231,
    174
  ],
  "475": [
    231,
    167
  ],
  "476": [
    232,
    162
  ],
  "477": [
    231,
    186
  ],
  "478": [
    233,
    155
  ],
  "479": [
    290,
    176
  ],
  "480": [
    262,
    285
  ],
  "481": [
    253,
    165
  ],
  "482": [
    248,
    170
  ],
  "483": [
    229,
    128
  ],
  "484": [
    248,
    132
  ],
  "485": [
    231,
    172
  ],
  "486": [
    242,
    148
  ],
  "487": [
    257,
    155
  ],
  "488": [
    229,
    140
  ],
  "489": [
    291,
    159
  ],
  "490": [
    253,
    132
  ],
  "491": [
    319,
    131
  ],
  "492": [
    232,
    153
  ],
  "493": [
    272,
    142
  ],
  "494": [
    233,
    154
  ],
  "495": [
    232,
    138
  ],
  "496": [
    233,
    147
  ],
  "497": [
    132,
    191
  ],
  "498": [
    230,
    178
  ],
  "499": [
    232,
    189
  ],
  "500": [
    232,
    141
  ],
  "501": [
    258,
    143
  ],
  "502": [
    230,
    162
  ],
  "503": [
    362,
    151
  ],
  "504": [
    322,
    168
  ],
  "505": [
    230,
    172
  ],
  "506": [
    261,
    160
  ],
  "507": [
    333,
    168
  ],
  "508": [
    371,
    185
  ],
  "509": [
    230,
    183
  ],
  "510": [
    230,
    141
  ],
  "511": [
    233,
    148
  ],
  "512": [
    242,
    186
  ],
  "513": [
    232,
    130
  ],
  "514": [
    233,
    171
  ],
  "515": [
    308,
    178
  ],
  "516": [
    286,
    137
  ],
  "517": [
    233,
    149
  ],
  "518": [
    247,
    190
  ],
  "519": [
    281,
    145
  ],
  "520": [
    342,
    136
  ],
  "521": [
    232,
    145
  ],
  "522": [
    249,
    175
  ],
  "523": [
    250,
    137
  ],
  "524": [
    249,
    150
  ],
  "525": [
    230,
    175
  ],
  "526": [
    231,
    165
  ],
  "527": [
    343,
    181
  ],
  "528": [
    377,
    527
  ],
  "529": [
    229,
    148
  ],
  "530": [
    322,
    159
  ],
  "531": [
    270,
    137
  ],
  "532": [
    258,
    191
  ],
  "533": [
    233,
    146
  ],
  "534": [
    233,
    187
  ],
  "535": [
    514,
    152
  ],
  "536": [
    383,
    129
  ],
  "537": [
    305,
    174
  ],
  "538": [
    277,
    128
  ],
  "539": [
    229,
    168
  ],
  "540": [
    336,
    146
  ],
  "541": [
    266,
    142
  ],
  "542": [
    229,
    497
  ],
  "543": [
    392,
    180
  ],
  "544": [
    266,
    131
  ],
  "545": [
    231,
    130
  ],
  "546": [
    439,
    518
  ],
  "547": [
    335,
    185
  ],
  "548": [
    405,
    185
  ],
  "549": [
    229,
    187
  ],
  "550": [
    291,
    128
  ],
  "551": [
    248,
    154
  ],
  "552": [
    280,
    183
  ],
  "553": [
    230,
    159
  ],
  "554": [
    261,
    169
  ],
  "555": [
    275,
    141
  ],
  "556": [
    269,
    155
  ],
  "557": [
    476,
    171
  ],
  "558": [
    289,
    165
  ],
  "559": [
    275,
    178
  ],
  "560": [
    351,
    179
  ],
  "561": [
    232,
    132
  ],
  "562": [
    303,
    156
  ],
  "563": [
    372,
    181
  ],
  "564": [
    230,
    181
  ],
  "565": [
    419,
    171
  ],
  "566": [
    440,
    144
  ],
  "567": [
    280,
    157
  ],
  "568": [
    386,
    156
  ],
  "569": [
    275,
    133
  ],
  "570": [
    242,
    156
  ],
  "571": [
    266,
    180
  ],
  "572": [
    317,
    180
  ],
  "573": [
    430,
    165
  ],
  "574": [
    303,
    132
  ],
  "575": [
    231,
    169
  ],
  "576": [
    270,
    166
  ],
  "577": [
    464,
    133
  ],
  "578": [
    243,
    155
  ],
  "579": [
    231,
    166
  ],
  "580": [
    318,
    320
  ],
  "581": [
    249,
    163
  ],
  "582": [
    402,
    190
  ],
  "583": [
    247,
    168
  ],
  "584": [
    391,
    426
  ],
  "585": [
    291,
    149
  ],
  "586": [
    266,
    132
  ],
  "587": [
    233,
    170
  ],
  "588": [
    233,
    166
  ],
  "589": [
    278,
    187
  ],
  "590": [
    409,
    176
  ],
  "591": [
    230,
    143
  ],
  "592": [
    263,
    172
  ],
  "593": [
    287,
    163
  ],
  "594": [
    231,
    132
  ],
  "595": [
    263,
    142
  ],
  "596": [
    231,
    149
  ],
  "597": [
    232,
    144
  ],
  "598": [
    231,
    180
  ],
  "599": [
    452,
    190
  ],
  "600": [
    306,
    297
  ],
  "601": [
    363,
    138
  ],
  "602": [
    301,
    153
  ],
  "603": [
    509,
    177
  ],
  "604": [
    361,
    188
  ],
  "605": [
    335,
    135
  ],
  "606": [
    302,
    162
  ],
  "607": [
    495,
    177
  ],
  "608": [
    256,
    177
  ],
  "609": [
    233,
    165
  ],
  "610": [
    230,
    160
  ],
  "611": [
    250,
    154
  ],
  "612": [
    253,
    179
  ],
  "613": [
    266,
    140
  ],
  "614": [
    517,
    191
  ],
  "615": [
    521,
    151
  ],
  "616": [
    263,
    164
  ],
  "617": [
    322,
    154
  ],
  "618": [
    248,
    150
  ],
  "619": [
    231,
    136
  ],
  "620": [
    230,
    174
  ],
  "621": [
    231,
    131
  ],
  "622": [
    229,
    178
  ],
  "623": [
    231,
    188
  ],
  "624": [
    502,
    129
  ],
  "625": [
    409,
    171
  ],
  "626": [
    428,
    428
  ],
  "627": [
    342,
    166
  ],
  "628": [
    295,
    255
  ],
  "629": [
    273,
    133
  ],
  "630": [
    294,
    160
  ],
  "631": [
    256,
    137
  ],
  "632": [
    316,
    327
  ],
  "633": [
    364,
    152
  ],
  "634": [
    276,
    191
  ],
  "635": [
    248,
    156
  ],
  "636": [
    232,
    165
  ],
  "637": [
    379,
    182
  ],
  "638": [
    503,
    559
  ],
  "639": [
    279,
    180
  ],
  "640": [
    242,
    187
  ],
  "641": [
    279,
    152
  ],
  "642": [
    229,
    169
  ],
  "643": [
    271,
    162
  ],
  "644": [
    266,
    141
  ],
  "645": [
    389,
    186
  ],
  "646": [
    232,
    133
  ],
  "647": [
    290,
    182
  ],
  "648": [
    305,
    180
  ],
  "649": [
    250,
    162
  ],
  "650": [
    453,
    190
  ],
  "651": [
    539,
    152
  ],
  "652": [
    474,
    161
  ],
  "653": [
    273,
    140
  ],
  "654": [
    571,
    504
  ],
  "655": [
    303,
    148
  ],
  "656": [
    325,
    156
  ],
  "657": [
    359,
    450
  ],
  "658": [
    230,
    180
  ],
  "659": [
    338,
    260
  ],
  "660": [
    269,
    177
  ],
  "661": [
    249,
    145
  ],
  "662": [
    302,
    176
  ],
  "663": [
    250,
    151
  ],
  "664": [
    636,
    191
  ],
  "665": [
    447,
    142
  ],
  "666": [
    230,
    133
  ],
  "667": [
    494,
    143
  ],
  "668": [
    229,
    167
  ],
  "669": [
    303,
    134
  ],
  "670": [
    231,
    140
  ],
  "671": [
    243,
    172
  ],
  "672": [
    447,
    158
  ],
  "673": [
    333,
    185
  ],
  "674": [
    230,
    132
  ],
  "675": [
    255,
    262
  ],
  "676": [
    505,
    161
  ],
  "677": [
    269,
    172
  ],
  "678": [
    642,
    134
  ],
  "679": [
    452,
    189
  ],
  "680": [
    594,
    182
  ],
  "681": [
    415,
    268
  ],
  "682": [
    442,
    139
  ],
  "683": [
    308,
    174
  ],
  "684": [
    231,
    135
  ],
  "685": [
    230,
    146
  ],
  "686": [
    230,
    168
  ],
  "687": [
    300,
    145
  ],
  "688": [
    242,
    135
  ],
  "689": [
    534,
    132
  ],
  "690": [
    232,
    182
  ],
  "691": [
    684,
    149
  ],
  "692": [
    343,
    129
  ],
  "693": [
    232,
    137
  ],
  "694": [
    432,
    299
  ],
  "695": [
    257,
    158
  ],
  "696": [
    498,
    161
  ],
  "697": [
    230,
    144
  ],
  "698": [
    496,
    182
  ],
  "699": [
    233,
    189
  ],
  "700": [
    261,
    151
  ],
  "701": [
    233,
    190
  ],
  "702": [
    250,
    136
  ],
  "703": [
    468,
    138
  ],
  "704": [
    230,
    161
  ],
  "705": [
    233,
    178
  ],
  "706": [
    490,
    489
  ],
  "707": [
    230,
    163
  ],
  "708": [
    325,
    191
  ],
  "709": [
    256,
    189
  ],
  "710": [
    402,
    182
  ],
  "711": [
    645,
    603
  ],
  "712": [
    364,
    189
  ],
  "713": [
    333,
    187
  ],
  "714": [
    482,
    631
  ],
  "715": [
    319,
    133
  ],
  "716": [
    276,
    174
  ],
  "717": [
    247,
    161
  ],
  "718": [
    231,
    160
  ],
  "719": [
    449,
    162
  ],
  "720": [
    329,
    297
  ],
  "721": [
    363,
    157
  ],
  "722": [
    231,
    144
  ],
  "723": [
    639,
    663
  ],
  "724": [
    349,
    165
  ],
  "725": [
    263,
    165
  ],
  "726": [
    416,
    157
  ],
  "727": [
    242,
    131
  ],
  "728": [
    276,
    159
  ],
  "729": [
    354,
    264
  ],
  "730": [
    699,
    144
  ],
  "731": [
    230,
    145
  ],
  "732": [
    230,
    187
  ],
  "733": [
    553,
    180
  ],
  "734": [
    492,
    142
  ],
  "735": [
    271,
    138
  ],
  "736": [
    302,
    145
  ],
  "737": [
    406,
    165
  ],
  "738": [
    392,
    148
  ],
  "739": [
    485,
    145
  ],
  "740": [
    483,
    146
  ],
  "741": [
    349,
    142
  ],
  "742": [
    317,
    150
  ],
  "743": [
    624,
    356
  ],
  "744": [
    526,
    158
  ],
  "745": [
    231,
    164
  ],
  "746": [
    314,
    160
  ],
  "747": [
    352,
    268
  ],
  "748": [
    231,
    191
  ],
  "749": [
    303,
    151
  ],
  "750": [
    330,
    148
  ],
  "751": [
    258,
    156
  ],
  "752": [
    168,
    128
  ],
  "753": [
    289,
    149
  ],
  "754": [
    533,
    177
  ],
  "755": [
    229,
    139
  ],
  "756": [
    529,
    164
  ],
  "757": [
    416,
    156
  ],
  "758": [
    373,
    161
  ],
  "759": [
    348,
    135
  ],
  "760": [
    601,
    531
  ],
  "761": [
    229,
    160
  ],
  "762": [
    232,
    752
  ],
  "763": [
    271,
    131
  ],
  "764": [
    643,
    760
  ],
  "765": [
    545,
    185
  ],
  "766": [
    257,
    152
  ],
  "767": [
    743,
    703
  ],
  "768": [
    253,
    171
  ],
  "769": [
    591,
    144
  ],
  "770": [
    511,
    139
  ],
  "771": [
    243,
    178
  ],
  "772": [
    320,
    255
  ],
  "773": [
    350,
    163
  ],
  "774": [
    231,
    139
  ],
  "775": [
    279,
    191
  ],
  "776": [
    379,
    179
  ],
  "777": [
    485,
    172
  ],
  "778": [
    454,
    358
  ],
  "779": [
    269,
    157
  ],
  "780": [
    230,
    182
  ],
  "781": [
    701,
    153
  ],
  "782": [
    269,
    170
  ],
  "783": [
    362,
    170
  ],
  "784": [
    422,
    186
  ],
  "785": [
    271,
    151
  ],
  "786": [
    389,
    129
  ],
  "787": [
    278,
    165
  ],
  "788": [
    329,
    285
  ],
  "789": [
    232,
    163
  ],
  "790": [
    375,
    168
  ],
  "791": [
    274,
    299
  ],
  "792": [
    474,
    173
  ],
  "793": [
    691,
    540
  ],
  "794": [
    233,
    186
  ],
  "795": [
    231,
    143
  ],
  "796": [
    347,
    179
  ],
  "797": [
    488,
    151
  ],
  "798": [
    233,
    184
  ],
  "799": [
    308,
    166
  ],
  "800": [
    257,
    142
  ],
  "801": [
    250,
    157
  ],
  "802": [
    510,
    137
  ],
  "803": [
    294,
    189
  ],
  "804": [
    588,
    150
  ],
  "805": [
    300,
    154
  ],
  "806": [
    258,
    153
  ],
  "807": [
    405,
    172
  ],
  "808": [
    475,
    128
  ],
  "809": [
    266,
    136
  ],
  "810": [
    448,
    770
  ],
  "811": [
    231,
    162
  ],
  "812": [
    418,
    169
  ],
  "813": [
    668,
    147
  ],
  "814": [
    249,
    179
  ],
  "815": [
    231,
    178
  ],
  "816": [
    258,
    141
  ],
  "817": [
    319,
    153
  ],
  "818": [
    705,
    129
  ],
  "819": [
    266,
    145
  ],
  "820": [
    686,
    170
  ],
  "821": [
    364,
    188
  ],
  "822": [
    272,
    159
  ],
  "823": [
    231,
    138
  ],
  "824": [
    253,
    173
  ],
  "825": [
    449,
    151
  ],
  "826": [
    453,
    180
  ],
  "827": [
    229,
    149
  ],
  "828": [
    248,
    135
  ],
  "829": [
    389,
    154
  ],
  "830": [
    337,
    260
  ],
  "831": [
    253,
    182
  ],
  "832": [
    243,
    145
  ],
  "833": [
    457,
    138
  ],
  "834": [
    279,
    144
  ],
  "835": [
    231,
    150
  ],
  "836": [
    500,
    163
  ],
  "837": [
    478,
    132
  ],
  "838": [
    268,
    327
  ],
  "839": [
    422,
    190
  ],
  "840": [
    403,
    264
  ],
  "841": [
    420,
    516
  ],
  "842": [
    305,
    187
  ],
  "843": [
    257,
    145
  ],
  "844": [
    386,
    140
  ],
  "845": [
    363,
    161
  ],
  "846": [
    277,
    171
  ],
  "847": [
    249,
    178
  ],
  "848": [
    325,
    155
  ],
  "849": [
    271,
    179
  ],
  "850": [
    341,
    188
  ],
  "851": [
    230,
    165
  ],
  "852": [
    561,
    154
  ],
  "853": [
    321,
    288
  ],
  "854": [
    674,
    143
  ],
  "855": [
    442,
    165
  ],
  "856": [
    247,
    145
  ],
  "857": [
    233,
    156
  ],
  "858": [
    759,
    268
  ],
  "859": [
    383,
    133
  ],
  "860": [
    499,
    172
  ],
  "861": [
    468,
    149
  ],
  "862": [
    243,
    164
  ],
  "863": [
    319,
    171
  ],
  "864": [
    513,
    175
  ],
  "865": [
    274,
    429
  ],
  "866": [
    373,
    174
  ],
  "867": [
    330,
    179
  ],
  "868": [
    607,
    836
  ],
  "869": [
    341,
    159
  ],
  "870": [
    269,
    136
  ],
  "871": [
    363,
    186
  ],
  "872": [
    457,
    179
  ],
  "873": [
    383,
    140
  ],
  "874": [
    549,
    182
  ],
  "875": [
    537,
    260
  ],
  "876": [
    325,
    168
  ],
  "877": [
    233,
    188
  ],
  "878": [
    249,
    140
  ],
  "879": [
    745,
    188
  ],
  "880": [
    148,
    260
  ],
  "881": [
    276,
    133
  ],
  "882": [
    430,
    177
  ],
  "883": [
    249,
    184
  ],
  "884": [
    422,
    187
  ],
  "885": [
    786,
    742
  ],
  "886": [
    32,
    306
  ],
  "887": [
    330,
    143
  ],
  "888": [
    500,
    137
  ],
  "889": [
    281,
    141
  ],
  "890": [
    534,
    145
  ],
  "891": [
    733,
    487
  ],
  "892": [
    229,
    171
  ],
  "893": [
    391,
    380
  ],
  "894": [
    230,
    147
  ],
  "895": [
    761,
    130
  ],
  "896": [
    319,
    151
  ],
  "897": [
    827,
    134
  ],
  "898": [
    230,
    154
  ],
  "899": [
    278,
    135
  ],
  "900": [
    386,
    189
  ],
  "901": [
    456,
    268
  ],
  "902": [
    273,
    128
  ],
  "903": [
    666,
    140
  ],
  "904": [
    560,
    808
  ],
  "905": [
    257,
    156
  ],
  "906": [
    324,
    316
  ],
  "907": [
    349,
    167
  ],
  "908": [
    231,
    190
  ],
  "909": [
    244,
    140
  ],
  "910": [
    244,
    141
  ],
  "911": [
    253,
    168
  ],
  "912": [
    382,
    353
  ],
  "913": [
    379,
    180
  ],
  "914": [
    300,
    188
  ],
  "915": [
    277,
    152
  ],
  "916": [
    368,
    285
  ],
  "917": [
    249,
    148
  ],
  "918": [
    471,
    129
  ],
  "919": [
    372,
    174
  ],
  "920": [
    232,
    129
  ],
  "921": [
    270,
    136
  ],
  "922": [
    319,
    160
  ],
  "923": [
    579,
    187
  ],
  "924": [
    630,
    380
  ],
  "925": [
    274,
    288
  ],
  "926": [
    597,
    189
  ],
  "927": [
    270,
    157
  ],
  "928": [
    232,
    148
  ],
  "929": [
    302,
    140
  ],
  "930": [
    349,
    157
  ],
  "931": [
    301,
    151
  ],
  "932": [
    596,
    153
  ],
  "933": [
    483,
    153
  ],
  "934": [
    315,
    592
  ],
  "935": [
    372,
    159
  ],
  "936": [
    529,
    144
  ],
  "937": [
    375,
    155
  ],
  "938": [
    406,
    146
  ],
  "939": [
    274,
    650
  ],
  "940": [
    463,
    669
  ],
  "941": [
    256,
    154
  ],
  "942": [
    496,
    129
  ],
  "943": [
    583,
    896
  ],
  "944": [
    379,
    178
  ],
  "945": [
    513,
    137
  ],
  "946": [
    494,
    190
  ],
  "947": [
    293,
    141
  ],
  "948": [
    322,
    178
  ],
  "949": [
    587,
    145
  ],
  "950": [
    851,
    188
  ],
  "951": [
    676,
    358
  ],
  "952": [
    231,
    151
  ],
  "953": [
    477,
    162
  ],
  "954": [
    445,
    135
  ],
  "955": [
    256,
    145
  ],
  "956": [
    619,
    182
  ],
  "957": [
    318,
    288
  ],
  "958": [
    261,
    162
  ],
  "959": [
    230,
    130
  ],
  "960": [
    373,
    184
  ],
  "961": [
    232,
    140
  ],
  "962": [
    249,
    183
  ],
  "963": [
    349,
    149
  ],
  "964": [
    258,
    134
  ],
  "965": [
    471,
    162
  ],
  "966": [
    229,
    131
  ],
  "967": [
    475,
    166
  ],
  "968": [
    232,
    142
  ],
  "969": [
    262,
    393
  ],
  "970": [
    451,
    260
  ],
  "971": [
    364,
    138
  ],
  "972": [
    821,
    874
  ],
  "973": [
    388,
    134
  ],
  "974": [
    361,
    175
  ],
  "975": [
    419,
    188
  ],
  "976": [
    333,
    134
  ],
  "977": [
    357,
    288
  ],
  "978": [
    707,
    146
  ],
  "979": [
    264,
    345
  ],
  "980": [
    317,
    145
  ],
  "981": [
    718,
    180
  ],
  "982": [
    408,
    417
  ],
  "983": [
    972,
    975
  ],
  "984": [
    271,
    150
  ],
  "985": [
    435,
    162
  ],
  "986": [
    300,
    143
  ],
  "987": [
    388,
    159
  ],
  "988": [
    249,
    151
  ],
  "989": [
    486,
    338
  ],
  "990": [
    300,
    160
  ],
  "991": [
    432,
    255
  ],
  "992": [
    818,
    711
  ],
  "993": [
    274,
    606
  ],
  "994": [
    488,
    133
  ],
  "995": [
    232,
    184
  ],
  "996": [
    275,
    153
  ],
  "997": [
    482,
    436
  ],
  "998": [
    302,
    163
  ],
  "999": [
    326,
    142
  ],
  "1000": [
    598,
    162
  ],
  "1001": [
    270,
    176
  ],
  "1002": [
    449,
    170
  ],
  "1003": [
    270,
    177
  ],
  "1004": [
    728,
    264
  ],
  "1005": [
    495,
    130
  ],
  "1006": [
    343,
    128
  ],
  "1007": [
    693,
    178
  ],
  "1008": [
    967,
    493
  ],
  "1009": [
    387,
    288
  ],
  "1010": [
    317,
    174
  ],
  "1011": [
    248,
    171
  ],
  "1012": [
    375,
    159
  ],
  "1013": [
    356,
    507
  ],
  "1014": [
    290,
    143
  ],
  "1015": [
    436,
    602
  ],
  "1016": [
    243,
    142
  ],
  "1017": [
    382,
    255
  ],
  "1018": [
    391,
    454
  ],
  "1019": [
    394,
    137
  ],
  "1020": [
    233,
    158
  ],
  "1021": [
    597,
    165
  ],
  "1022": [
    232,
    146
  ],
  "1023": [
    243,
    166
  ],
  "1024": [
    478,
    183
  ],
  "1025": [
    365,
    146
  ],
  "1026": [
    609,
    173
  ],
  "1027": [
    435,
    169
  ],
  "1028": [
    457,
    133
  ],
  "1029": [
    289,
    188
  ],
  "1030": [
    421,
    136
  ],
  "1031": [
    335,
    176
  ],
  "1032": [
    748,
    187
  ],
  "1033": [
    549,
    183
  ],
  "1034": [
    575,
    191
  ],
  "1035": [
    335,
    189
  ],
  "1036": [
    421,
    141
  ],
  "1037": [
    492,
    189
  ],
  "1038": [
    928,
    161
  ],
  "1039": [
    877,
    147
  ],
  "1040": [
    431,
    288
  ],
  "1041": [
    246,
    148
  ],
  "1042": [
    328,
    268
  ],
  "1043": [
    499,
    166
  ],
  "1044": [
    892,
    130
  ],
  "1045": [
    366,
    141
  ],
  "1046": [
    375,
    191
  ],
  "1047": [
    250,
    179
  ],
  "1048": [
    318,
    299
  ],
  "1049": [
    726,
    260
  ],
  "1050": [
    336,
    158
  ],
  "1051": [
    293,
    128
  ],
  "1052": [
    250,
    191
  ],
  "1053": [
    430,
    166
  ],
  "1054": [
    249,
    138
  ],
  "1055": [
    349,
    146
  ],
  "1056": [
    685,
    158
  ],
  "1057": [
    298,
    157
  ],
  "1058": [
    262,
    730
  ],
  "1059": [
    1015,
    568
  ],
  "1060": [
    289,
    162
  ],
  "1061": [
    257,
    129
  ],
  "1062": [
    473,
    784
  ],
  "1063": [
    301,
    166
  ],
  "1064": [
    263,
    152
  ],
  "1065": [
    304,
    134
  ],
  "1066": [
    847,
    487
  ],
  "1067": [
    620,
    181
  ],
  "1068": [
    739,
    260
  ],
  "1069": [
    321,
    260
  ],
  "1070": [
    273,
    161
  ],
  "1071": [
    490,
    614
  ],
  "1072": [
    263,
    157
  ],
  "1073": [
    414,
    355
  ],
  "1074": [
    253,
    137
  ],
  "1075": [
    722,
    134
  ],
  "1076": [
    373,
    168
  ],
  "1077": [
    660,
    1072
  ],
  "1078": [
    309,
    757
  ],
  "1079": [
    658,
    187
  ],
  "1080": [
    257,
    179
  ],
  "1081": [
    232,
    177
  ],
  "1082": [
    919,
    352
  ],
  "1083": [
    329,
    716
  ],
  "1084": [
    270,
    131
  ],
  "1085": [
    438,
    307
  ],
  "1086": [
    362,
    156
  ],
  "1087": [
    242,
    136
  ],
  "1088": [
    373,
    164
  ],
  "1089": [
    435,
    140
  ],
  "1090": [
    347,
    163
  ],
  "1091": [
    371,
    190
  ],
  "1092": [
    429,
    562
  ],
  "1093": [
    421,
    162
  ],
  "1094": [
    612,
    568
  ],
  "1095": [
    620,
    191
  ],
  "1096": [
    473,
    577
  ],
  "1097": [
    361,
    181
  ],
  "1098": [
    378,
    159
  ],
  "1099": [
    229,
    153
  ],
  "1100": [
    392,
    145
  ],
  "1101": [
    343,
    154
  ],
  "1102": [
    525,
    149
  ],
  "1103": [
    897,
    866
  ],
  "1104": [
    418,
    175
  ],
  "1105": [
    230,
    497
  ],
  "1106": [
    574,
    649
  ],
  "1107": [
    297,
    393
  ],
  "1108": [
    233,
    134
  ],
  "1109": [
    435,
    185
  ],
  "1110": [
    231,
    170
  ],
  "1111": [
    316,
    625
  ],
  "1112": [
    309,
    901
  ],
  "1113": [
    583,
    837
  ],
  "1114": [
    304,
    135
  ],
  "1115": [
    588,
    153
  ],
  "1116": [
    445,
    130
  ],
  "1117": [
    418,
    144
  ],
  "1118": [
    406,
    168
  ],
  "1119": [
    471,
    131
  ],
  "1120": [
    292,
    356
  ],
  "1121": [
    233,
    173
  ],
  "1122": [
    442,
    175
  ],
  "1123": [
    447,
    159
  ],
  "1124": [
    609,
    174
  ],
  "1125": [
    291,
    147
  ],
  "1126": [
    488,
    185
  ],
  "1127": [
    342,
    184
  ],
  "1128": [
    469,
    285
  ],
  "1129": [
    413,
    369
  ],
  "1130": [
    377,
    601
  ],
  "1131": [
    419,
    175
  ],
  "1132": [
    298,
    141
  ],
  "1133": [
    289,
    152
  ],
  "1134": [
    352,
    489
  ],
  "1135": [
    250,
    129
  ],
  "1136": [
    282,
    163
  ],
  "1137": [
    262,
    590
  ],
  "1138": [
    324,
    264
  ],
  "1139": [
    907,
    712
  ],
  "1140": [
    250,
    163
  ],
  "1141": [
    489,
    490
  ],
  "1142": [
    670,
    155
  ],
  "1143": [
    525,
    143
  ],
  "1144": [
    306,
    858
  ],
  "1145": [
    436,
    268
  ],
  "1146": [
    325,
    190
  ],
  "1147": [
    521,
    163
  ],
  "1148": [
    370,
    393
  ],
  "1149": [
    1099,
    168
  ],
  "1150": [
    300,
    153
  ],
  "1151": [
    248,
    186
  ],
  "1152": [
    32,
    337
  ],
  "1153": [
    570,
    671
  ],
  "1154": [
    610,
    145
  ],
  "1155": [
    388,
    147
  ],
  "1156": [
    273,
    144
  ],
  "1157": [
    545,
    174
  ],
  "1158": [
    317,
    152
  ],
  "1159": [
    596,
    170
  ],
  "1160": [
    274,
    410
  ],
  "1161": [
    250,
    185
  ],
  "1162": [
    288,
    285
  ],
  "1163": [
    248,
    177
  ],
  "1164": [
    622,
    184
  ],
  "1165": [
    307,
    356
  ],
  "1166": [
    406,
    162
  ],
  "1167": [
    307,
    264
  ],
  "1168": [
    416,
    138
  ],
  "1169": [
    270,
    144
  ],
  "1170": [
    280,
    134
  ],
  "1171": [
    263,
    182
  ],
  "1172": [
    32,
    638
  ],
  "1173": [
    646,
    176
  ],
  "1174": [
    232,
    150
  ],
  "1175": [
    306,
    285
  ],
  "1176": [
    247,
    175
  ],
  "1177": [
    231,
    168
  ],
  "1178": [
    731,
    134
  ],
  "1179": [
    361,
    165
  ],
  "1180": [
    370,
    264
  ],
  "1181": [
    416,
    189
  ],
  "1182": [
    1181,
    825
  ],
  "1183": [
    256,
    129
  ],
  "1184": [
    313,
    380
  ],
  "1185": [
    539,
    129
  ],
  "1186": [
    664,
    411
  ],
  "1187": [
    233,
    185
  ],
  "1188": [
    303,
    167
  ],
  "1189": [
    741,
    427
  ],
  "1190": [
    233,
    159
  ],
  "1191": [
    517,
    135
  ],
  "1192": [
    960,
    551
  ],
  "1193": [
    318,
    839
  ],
  "1194": [
    343,
    131
  ],
  "1195": [
    371,
    189
  ],
  "1196": [
    667,
    849
  ],
  "1197": [
    621,
    167
  ],
  "1198": [
    587,
    130
  ],
  "1199": [
    598,
    167
  ],
  "1200": [
    436,
    493
  ],
  "1201": [
    261,
    168
  ],
  "1202": [
    920,
    154
  ],
  "1203": [
    622,
    173
  ],
  "1204": [
    246,
    152
  ],
  "1205": [
    335,
    167
  ],
  "1206": [
    272,
    165
  ],
  "1207": [
    373,
    169
  ],
  "1208": [
    472,
    941
  ],
  "1209": [
    246,
    153
  ],
  "1210": [
    291,
    186
  ],
  "1211": [
    722,
    188
  ],
  "1212": [
    378,
    179
  ],
  "1213": [
    289,
    164
  ],
  "1214": [
    333,
    186
  ],
  "1215": [
    710,
    1146
  ],
  "1216": [
    795,
    141
  ],
  "1217": [
    617,
    921
  ],
  "1218": [
    364,
    168
  ],
  "1219": [
    305,
    178
  ],
  "1220": [
    352,
    1182
  ],
  "1221": [
    301,
    148
  ],
  "1222": [
    280,
    173
  ],
  "1223": [
    269,
    141
  ],
  "1224": [
    304,
    174
  ],
  "1225": [
    335,
    188
  ],
  "1226": [
    396,
    346
  ],
  "1227": [
    250,
    158
  ],
  "1228": [
    435,
    155
  ],
  "1229": [
    306,
    268
  ],
  "1230": [
    254,
    173
  ],
  "1231": [
    293,
    142
  ],
  "1232": [
    574,
    292
  ],
  "1233": [
    966,
    167
  ],
  "1234": [
    230,
    185
  ],
  "1235": [
    326,
    168
  ],
  "1236": [
    415,
    324
  ],
  "1237": [
    290,
    144
  ],
  "1238": [
    564,
    142
  ],
  "1239": [
    367,
    880
  ],
  "1240": [
    232,
    151
  ],
  "1241": [
    412,
    274
  ],
  "1242": [
    257,
    189
  ],
  "1243": [
    403,
    467
  ],
  "1244": [
    271,
    149
  ],
  "1245": [
    755,
    135
  ],
  "1246": [
    399,
    327
  ],
  "1247": [
    262,
    717
  ],
  "1248": [
    372,
    179
  ],
  "1249": [
    343,
    160
  ],
  "1250": [
    300,
    164
  ],
  "1251": [
    349,
    170
  ],
  "1252": [
    535,
    714
  ],
  "1253": [
    303,
    153
  ],
  "1254": [
    269,
    180
  ],
  "1255": [
    362,
    162
  ],
  "1256": [
    375,
    169
  ],
  "1257": [
    249,
    130
  ],
  "1258": [
    253,
    128
  ],
  "1259": [
    505,
    178
  ],
  "1260": [
    396,
    315
  ],
  "1261": [
    698,
    355
  ],
  "1262": [
    322,
    176
  ],
  "1263": [
    310,
    1200
  ],
  "1264": [
    402,
    187
  ],
  "1265": [
    286,
    164
  ],
  "1266": [
    231,
    133
  ],
  "1267": [
    903,
    817
  ],
  "1268": [
    690,
    179
  ],
  "1269": [
    690,
    133
  ],
  "1270": [
    415,
    657
  ],
  "1271": [
    898,
    151
  ],
  "1272": [
    561,
    177
  ],
  "1273": [
    404,
    264
  ],
  "1274": [
    823,
    175
  ],
  "1275": [
    732,
    161
  ],
  "1276": [
    229,
    152
  ],
  "1277": [
    335,
    151
  ],
  "1278": [
    579,
    128
  ],
  "1279": [
    1254,
    538
  ],
  "1280": [
    798,
    159
  ],
  "1281": [
    331,
    592
  ],
  "1282": [
    344,
    175
  ],
  "1283": [
    353,
    1061
  ],
  "1284": [
    418,
    129
  ],
  "1285": [
    302,
    180
  ],
  "1286": [
    544,
    255
  ],
  "1287": [
    477,
    166
  ],
  "1288": [
    229,
    130
  ],
  "1289": [
    794,
    189
  ],
  "1290": [
    316,
    520
  ],
  "1291": [
    313,
    720
  ],
  "1292": [
    287,
    130
  ],
  "1293": [
    779,
    1033
  ],
  "1294": [
    438,
    358
  ],
  "1295": [
    274,
    522
  ],
  "1296": [
    952,
    133
  ],
  "1297": [
    256,
    132
  ],
  "1298": [
    1088,
    299
  ],
  "1299": [
    342,
    173
  ],
  "1300": [
    386,
    161
  ],
  "1301": [
    230,
    186
  ],
  "1302": [
    575,
    186
  ],
  "1303": [
    968,
    171
  ],
  "1304": [
    337,
    424
  ],
  "1305": [
    307,
    327
  ],
  "1306": [
    419,
    181
  ],
  "1307": [
    780,
    136
  ],
  "1308": [
    458,
    255
  ],
  "1309": [
    401,
    407
  ],
  "1310": [
    244,
    128
  ],
  "1311": [
    500,
    175
  ],
  "1312": [
    280,
    184
  ],
  "1313": [
    274,
    320
  ],
  "1314": [
    387,
    338
  ],
  "1315": [
    313,
    600
  ],
  "1316": [
    261,
    167
  ],
  "1317": [
    526,
    157
  ],
  "1318": [
    361,
    164
  ],
  "1319": [
    261,
    139
  ],
  "1320": [
    350,
    153
  ],
  "1321": [
    232,
    147
  ],
  "1322": [
    318,
    262
  ],
  "1323": [
    342,
    144
  ],
  "1324": [
    1024,
    820
  ],
  "1325": [
    371,
    158
  ],
  "1326": [
    961,
    182
  ],
  "1327": [
    302,
    133
  ],
  "1328": [
    704,
    165
  ],
  "1329": [
    1255,
    976
  ],
  "1330": [
    375,
    157
  ],
  "1331": [
    374,
    161
  ],
  "1332": [
    731,
    135
  ],
  "1333": [
    281,
    143
  ],
  "1334": [
    1156,
    1135
  ],
  "1335": [
    341,
    129
  ],
  "1336": [
    318,
    694
  ],
  "1337": [
    282,
    159
  ],
  "1338": [
    815,
    174
  ],
  "1339": [
    422,
    185
  ],
  "1340": [
    229,
    162
  ],
  "1341": [
    445,
    186
  ],
  "1342": [
    273,
    183
  ],
  "1343": [
    654,
    260
  ],
  "1344": [
    274,
    313
  ],
  "1345": [
    408,
    268
  ],
  "1346": [
    811,
    151
  ],
  "1347": [
    233,
    177
  ],
  "1348": [
    1347,
    188
  ],
  "1349": [
    294,
    162
  ],
  "1350": [
    546,
    260
  ],
  "1351": [
    321,
    479
  ],
  "1352": [
    528,
    260
  ],
  "1353": [
    525,
    141
  ],
  "1354": [
    240,
    142
  ],
  "1355": [
    523,
    938
  ],
  "1356": [
    439,
    309
  ],
  "1357": [
    1186,
    669
  ],
  "1358": [
    477,
    179
  ],
  "1359": [
    396,
    331
  ],
  "1360": [
    382,
    320
  ],
  "1361": [
    282,
    186
  ],
  "1362": [
    242,
    150
  ],
  "1363": [
    756,
    434
  ],
  "1364": [
    1234,
    150
  ],
  "1365": [
    481,
    413
  ],
  "1366": [
    511,
    166
  ],
  "1367": [
    373,
    190
  ],
  "1368": [
    279,
    183
  ],
  "1369": [
    491,
    369
  ],
  "1370": [
    249,
    182
  ],
  "1371": [
    32,
    711
  ],
  "1372": [
    232,
    155
  ],
  "1373": [
    368,
    417
  ],
  "1374": [
    438,
    353
  ],
  "1375": [
    345,
    264
  ],
  "1376": [
    327,
    292
  ],
  "1377": [
    445,
    145
  ],
  "1378": [
    253,
    131
  ],
  "1379": [
    332,
    262
  ],
  "1380": [
    330,
    137
  ],
  "1381": [
    493,
    358
  ],
  "1382": [
    233,
    172
  ],
  "1383": [
    633,
    618
  ],
  "1384": [
    775,
    297
  ],
  "1385": [
    463,
    678
  ],
  "1386": [
    593,
    1216
  ],
  "1387": [
    32,
    989
  ],
  "1388": [
    230,
    189
  ],
  "1389": [
    623,
    154
  ],
  "1390": [
    651,
    355
  ],
  "1391": [
    915,
    936
  ],
  "1392": [
    287,
    137
  ],
  "1393": [
    325,
    133
  ],
  "1394": [
    718,
    141
  ],
  "1395": [
    316,
    399
  ],
  "1396": [
    289,
    171
  ],
  "1397": [
    293,
    167
  ],
  "1398": [
    481,
    264
  ],
  "1399": [
    459,
    292
  ],
  "1400": [
    1211,
    882
  ],
  "1401": [
    470,
    1064
  ],
  "1402": [
    388,
    143
  ],
  "1403": [
    573,
    288
  ],
  "1404": [
    325,
    148
  ],
  "1405": [
    593,
    801
  ],
  "1406": [
    621,
    166
  ],
  "1407": [
    499,
    187
  ],
  "1408": [
    290,
    181
  ],
  "1409": [
    329,
    807
  ],
  "1410": [
    310,
    810
  ],
  "1411": [
    350,
    151
  ],
  "1412": [
    274,
    864
  ],
  "1413": [
    749,
    297
  ],
  "1414": [
    402,
    175
  ],
  "1415": [
    274,
    900
  ],
  "1416": [
    249,
    176
  ],
  "1417": [
    819,
    370
  ],
  "1418": [
    476,
    141
  ],
  "1419": [
    354,
    262
  ],
  "1420": [
    270,
    161
  ],
  "1421": [
    421,
    183
  ],
  "1422": [
    369,
    576
  ],
  "1423": [
    344,
    145
  ],
  "1424": [
    1240,
    143
  ],
  "1425": [
    561,
    184
  ],
  "1426": [
    268,
    264
  ],
  "1427": [
    384,
    295
  ],
  "1428": [
    230,
    188
  ],
  "1429": [
    510,
    149
  ],
  "1430": [
    306,
    516
  ],
  "1431": [
    361,
    186
  ],
  "1432": [
    293,
    182
  ],
  "1433": [
    422,
    182
  ],
  "1434": [
    666,
    162
  ],
  "1435": [
    242,
    190
  ],
  "1436": [
    240,
    141
  ],
  "1437": [
    326,
    147
  ],
  "1438": [
    280,
    143
  ],
  "1439": [
    269,
    168
  ],
  "1440": [
    249,
    141
  ],
  "1441": [
    247,
    156
  ],
  "1442": [
    646,
    138
  ],
  "1443": [
    334,
    133
  ],
  "1444": [
    277,
    153
  ],
  "1445": [
    266,
    149
  ],
  "1446": [
    713,
    930
  ],
  "1447": [
    475,
    176
  ],
  "1448": [
    479,
    255
  ],
  "1449": [
    332,
    578
  ],
  "1450": [
    385,
    143
  ],
  "1451": [
    365,
    170
  ],
  "1452": [
    923,
    255
  ],
  "1453": [
    345,
    380
  ],
  "1454": [
    693,
    175
  ],
  "1455": [
    746,
    285
  ],
  "1456": [
    270,
    133
  ],
  "1457": [
    361,
    162
  ],
  "1458": [
    286,
    160
  ],
  "1459": [
    597,
    167
  ],
  "1460": [
    314,
    134
  ],
  "1461": [
    231,
    158
  ],
  "1462": [
    461,
    264
  ],
  "1463": [
    392,
    143
  ],
  "1464": [
    309,
    1055
  ],
  "1465": [
    1108,
    137
  ],
  "1466": [
    319,
    189
  ],
  "1467": [
    342,
    133
  ],
  "1468": [
    319,
    181
  ],
  "1469": [
    575,
    134
  ],
  "1470": [
    248,
    141
  ],
  "1471": [
    367,
    181
  ],
  "1472": [
    294,
    180
  ],
  "1473": [
    579,
    133
  ],
  "1474": [
    226,
    150
  ],
  "1475": [
    1474,
    161
  ],
  "1476": [
    231,
    176
  ],
  "1477": [
    263,
    151
  ],
  "1478": [
    231,
    147
  ],
  "1479": [
    292,
    327
  ],
  "1480": [
    332,
    285
  ],
  "1481": [
    1022,
    153
  ],
  "1482": [
    894,
    146
  ],
  "1483": [
    293,
    174
  ],
  "1484": [
    547,
    1442
  ],
  "1485": [
    564,
    129
  ],
  "1486": [
    492,
    171
  ],
  "1487": [
    334,
    139
  ],
  "1488": [
    367,
    150
  ],
  "1489": [
    602,
    682
  ],
  "1490": [
    1147,
    776
  ],
  "1491": [
    350,
    128
  ],
  "1492": [
    697,
    173
  ],
  "1493": [
    453,
    191
  ],
  "1494": [
    465,
    417
  ],
  "1495": [
    389,
    147
  ],
  "1496": [
    254,
    135
  ],
  "1497": [
    799,
    814
  ],
  "1498": [
    340,
    508
  ],
  "1499": [
    670,
    174
  ],
  "1500": [
    293,
    145
  ],
  "1501": [
    405,
    141
  ],
  "1502": [
    363,
    133
  ],
  "1503": [
    855,
    974
  ],
  "1504": [
    232,
    134
  ],
  "1505": [
    306,
    716
  ],
  "1506": [
    704,
    140
  ],
  "1507": [
    257,
    159
  ],
  "1508": [
    357,
    359
  ],
  "1509": [
    1319,
    665
  ],
  "1510": [
    273,
    129
  ],
  "1511": [
    575,
    182
  ],
  "1512": [
    330,
    136
  ],
  "1513": [
    342,
    131
  ],
  "1514": [
    535,
    1502
  ],
  "1515": [
    460,
    436
  ],
  "1516": [
    289,
    154
  ],
  "1517": [
    317,
    155
  ],
  "1518": [
    564,
    183
  ],
  "1519": [
    305,
    185
  ],
  "1520": [
    277,
    157
  ],
  "1521": [
    262,
    807
  ],
  "1522": [
    309,
    644
  ],
  "1523": [
    477,
    167
  ],
  "1524": [
    226,
    136
  ],
  "1525": [
    1524,
    182
  ],
  "1526": [
    308,
    177
  ],
  "1527": [
    247,
    131
  ],
  "1528": [
    325,
    166
  ],
  "1529": [
    375,
    179
  ],
  "1530": [
    431,
    313
  ],
  "1531": [
    315,
    384
  ],
  "1532": [
    450,
    399
  ],
  "1533": [
    462,
    359
  ],
  "1534": [
    321,
    451
  ],
  "1535": [
    350,
    168
  ],
  "1536": [
    498,
    179
  ],
  "1537": [
    567,
    338
  ],
  "1538": [
    315,
    424
  ],
  "1539": [
    421,
    164
  ],
  "1540": [
    624,
    1422
  ],
  "1541": [
    1063,
    1511
  ],
  "1542": [
    332,
    268
  ],
  "1543": [
    407,
    297
  ],
  "1544": [
    563,
    370
  ],
  "1545": [
    270,
    880
  ],
  "1546": [
    317,
    143
  ],
  "1547": [
    390,
    156
  ],
  "1548": [
    567,
    307
  ],
  "1549": [
    481,
    295
  ],
  "1550": [
    640,
    268
  ],
  "1551": [
    446,
    1145
  ],
  "1552": [
    1000,
    1269
  ],
  "1553": [
    369,
    316
  ],
  "1554": [
    335,
    173
  ],
  "1555": [
    623,
    152
  ],
  "1556": [
    269,
    128
  ],
  "1557": [
    1344,
    1548
  ],
  "1558": [
    448,
    530
  ],
  "1559": [
    1177,
    139
  ],
  "1560": [
    295,
    484
  ],
  "1561": [
    472,
    331
  ],
  "1562": [
    649,
    268
  ],
  "1563": [
    309,
    516
  ],
  "1564": [
    401,
    721
  ],
  "1565": [
    287,
    146
  ],
  "1566": [
    243,
    137
  ],
  "1567": [
    321,
    295
  ],
  "1568": [
    362,
    157
  ],
  "1569": [
    1174,
    155
  ],
  "1570": [
    1545,
    577
  ],
  "1571": [
    1382,
    188
  ],
  "1572": [
    303,
    166
  ],
  "1573": [
    342,
    130
  ],
  "1574": [
    591,
    146
  ],
  "1575": [
    1084,
    288
  ],
  "1576": [
    405,
    158
  ],
  "1577": [
    331,
    329
  ],
  "1578": [
    715,
    680
  ],
  "1579": [
    571,
    1541
  ],
  "1580": [
    310,
    399
  ],
  "1581": [
    263,
    129
  ],
  "1582": [
    708,
    255
  ],
  "1583": [
    333,
    135
  ],
  "1584": [
    325,
    179
  ],
  "1585": [
    553,
    144
  ],
  "1586": [
    465,
    599
  ],
  "1587": [
    689,
    845
  ],
  "1588": [
    581,
    297
  ],
  "1589": [
    478,
    170
  ],
  "1590": [
    275,
    136
  ],
  "1591": [
    442,
    159
  ],
  "1592": [
    366,
    168
  ],
  "1593": [
    543,
    316
  ],
  "1594": [
    326,
    173
  ],
  "1595": [
    363,
    177
  ],
  "1596": [
    309,
    1486
  ],
  "1597": [
    270,
    152
  ],
  "1598": [
    619,
    183
  ],
  "1599": [
    520,
    956
  ],
  "1600": [
    614,
    536
  ],
  "1601": [
    482,
    520
  ],
  "1602": [
    417,
    662
  ],
  "1603": [
    375,
    171
  ],
  "1604": [
    296,
    187
  ],
  "1605": [
    440,
    154
  ],
  "1606": [
    159,
    437
  ],
  "1607": [
    409,
    129
  ],
  "1608": [
    262,
    1230
  ],
  "1609": [
    389,
    175
  ],
  "1610": [
    440,
    138
  ],
  "1611": [
    242,
    147
  ],
  "1612": [
    231,
    179
  ],
  "1613": [
    258,
    144
  ],
  "1614": [
    869,
    268
  ],
  "1615": [
    774,
    172
  ],
  "1616": [
    404,
    345
  ],
  "1617": [
    247,
    150
  ],
  "1618": [
    366,
    173
  ],
  "1619": [
    262,
    484
  ],
  "1620": [
    262,
    599
  ],
  "1621": [
    1029,
    883
  ],
  "1622": [
    242,
    180
  ],
  "1623": [
    558,
    429
  ],
  "1624": [
    990,
    616
  ],
  "1625": [
    660,
    439
  ],
  "1626": [
    1190,
    169
  ],
  "1627": [
    795,
    173
  ],
  "1628": [
    253,
    180
  ],
  "1629": [
    253,
    177
  ],
  "1630": [
    249,
    165
  ],
  "1631": [
    274,
    872
  ],
  "1632": [
    231,
    134
  ],
  "1633": [
    1133,
    255
  ],
  "1634": [
    277,
    182
  ],
  "1635": [
    369,
    648
  ],
  "1636": [
    1035,
    812
  ],
  "1637": [
    305,
    170
  ],
  "1638": [
    256,
    190
  ],
  "1639": [
    610,
    183
  ],
  "1640": [
    286,
    157
  ],
  "1641": [
    255,
    346
  ],
  "1642": [
    286,
    130
  ],
  "1643": [
    354,
    413
  ],
  "1644": [
    549,
    137
  ],
  "1645": [
    660,
    1097
  ],
  "1646": [
    800,
    737
  ],
  "1647": [
    266,
    155
  ],
  "1648": [
    253,
    187
  ],
  "1649": [
    254,
    163
  ],
  "1650": [
    789,
    133
  ],
  "1651": [
    408,
    324
  ],
  "1652": [
    413,
    1458
  ],
  "1653": [
    324,
    1613
  ],
  "1654": [
    293,
    152
  ],
  "1655": [
    229,
    161
  ],
  "1656": [
    478,
    168
  ],
  "1657": [
    501,
    255
  ],
  "1658": [
    300,
    180
  ],
  "1659": [
    348,
    187
  ],
  "1660": [
    532,
    268
  ],
  "1661": [
    492,
    158
  ],
  "1662": [
    422,
    191
  ],
  "1663": [
    250,
    180
  ],
  "1664": [
    254,
    141
  ],
  "1665": [
    277,
    169
  ],
  "1666": [
    231,
    177
  ],
  "1667": [
    495,
    166
  ],
  "1668": [
    322,
    179
  ],
  "1669": [
    379,
    184
  ],
  "1670": [
    890,
    1509
  ],
  "1671": [
    312,
    190
  ],
  "1672": [
    231,
    145
  ],
  "1673": [
    250,
    171
  ],
  "1674": [
    525,
    148
  ],
  "1675": [
    815,
    190
  ],
  "1676": [
    266,
    190
  ],
  "1677": [
    273,
    146
  ],
  "1678": [
    418,
    173
  ],
  "1679": [
    271,
    183
  ],
  "1680": [
    421,
    134
  ],
  "1681": [
    1284,
    427
  ],
  "1682": [
    477,
    181
  ],
  "1683": [
    325,
    180
  ],
  "1684": [
    264,
    328
  ],
  "1685": [
    1052,
    714
  ],
  "1686": [
    309,
    324
  ],
  "1687": [
    243,
    173
  ],
  "1688": [
    274,
    461
  ],
  "1689": [
    599,
    813
  ],
  "1690": [
    309,
    463
  ],
  "1691": [
    297,
    264
  ],
  "1692": [
    529,
    177
  ],
  "1693": [
    417,
    470
  ],
  "1694": [
    349,
    187
  ],
  "1695": [
    519,
    698
  ],
  "1696": [
    566,
    255
  ],
  "1697": [
    32,
    885
  ],
  "1698": [
    787,
    316
  ],
  "1699": [
    381,
    141
  ],
  "1700": [
    322,
    177
  ],
  "1701": [
    308,
    190
  ],
  "1702": [
    325,
    189
  ],
  "1703": [
    572,
    345
  ],
  "1704": [
    279,
    150
  ],
  "1705": [
    502,
    166
  ],
  "1706": [
    357,
    980
  ],
  "1707": [
    678,
    355
  ],
  "1708": [
    794,
    159
  ],
  "1709": [
    1262,
    734
  ],
  "1710": [
    795,
    160
  ],
  "1711": [
    627,
    255
  ],
  "1712": [
    309,
    352
  ],
  "1713": [
    322,
    187
  ],
  "1714": [
    290,
    180
  ],
  "1715": [
    303,
    138
  ],
  "1716": [
    277,
    135
  ],
  "1717": [
    1238,
    437
  ],
  "1718": [
    755,
    146
  ],
  "1719": [
    253,
    133
  ],
  "1720": [
    409,
    174
  ],
  "1721": [
    249,
    137
  ],
  "1722": [
    254,
    174
  ],
  "1723": [
    380,
    353
  ],
  "1724": [
    1020,
    173
  ],
  "1725": [
    258,
    147
  ],
  "1726": [
    835,
    145
  ],
  "1727": [
    526,
    150
  ],
  "1728": [
    435,
    135
  ],
  "1729": [
    579,
    143
  ],
  "1730": [
    318,
    313
  ],
  "1731": [
