{
  "240": [
    228,
    184
  ],
  "241": [
    227,
    128
  ],
  "242": [
    239,
    188
  ],
  "243": [
    226,
    128
  ],
  "244": [
    241,
    130
  ],
  "245": [
    228,
    186
  ],
  "246": [
    229,
    164
  ],
  "247": [
    229,
    143
  ],
  "248": [
    233,
    129
  ],
  "249": [
    242,
    154
  ],
  "250": [
    228,
    189
  ],
  "251": [
    228,
    187
  ],
  "252": [
    243,
    156
  ],
  "253": [
    243,
    157
  ],
  "254": [
    248,
    147
  ],
  "255": [
    230,
    136
  ],
  "256": [
    232,
    128
  ],
  "257": [
    228,
    185
  ],
  "258": [
    240,
    141
  ],
  "259": [
    232,
    191
  ],
  "260": [
    230,
    152
  ],
  "261": [
    229,
    133
  ],
  "262": [
    229,
    176
  ],
  "263": [
    230,
    157
  ],
  "264": [
    230,
    156
  ],
  "265": [
    240,
    128
  ],
  "266": [
    233,
    130
  ],
  "267": [
    245,
    134
  ],
  "268": [
    266,
    163
  ],
  "269": [
    255,
    145
  ],
  "270": [
    229,
    144
  ],
  "271": [
    229,
    156
  ],
  "272": [
    229,
    141
  ],
  "273": [
    229,
    190
  ],
  "274": [
    229,
    174
  ],
  "275": [
    230,
    151
  ],
  "276": [
    232,
    161
  ],
  "277": [
    260,
    175
  ],
  "278": [
    32,
    32
  ],
  "279": [
    231,
    154
  ],
  "280": [
    242,
    129
  ],
  "281": [
    263,
    165
  ],
  "282": [
    230,
    137
  ],
  "283": [
    251,
    150
  ],
  "284": [
    240,
    170
  ],
  "285": [
    232,
    175
  ],
  "286": [
    276,
    140
  ],
  "287": [
    250,
    160
  ],
  "288": [
    279,
    132
  ],
  "289": [
    229,
    173
  ],
  "290": [
    230,
    128
  ],
  "291": [
    229,
    142
  ],
  "292": [
    256,
    133
  ],
  "293": [
    232,
    167
  ],
  "294": [
    233,
    151
  ],
  "295": [
    229,
    166
  ],
  "296": [
    233,
    135
  ],
  "297": [
    230,
    173
  ],
  "298": [
    264,
    137
  ],
  "299": [
    229,
    155
  ],
  "300": [
    229,
    184
  ],
  "301": [
    286,
    292
  ],
  "302": [
    229,
    135
  ],
  "303": [
    246,
    167
  ],
  "304": [
    229,
    136
  ],
  "305": [
    228,
    188
  ],
  "306": [
    229,
    191
  ],
  "307": [
    231,
    142
  ],
  "308": [
    229,
    165
  ],
  "309": [
    242,
    159
  ],
  "310": [
    273,
    151
  ],
  "311": [
    231,
    156
  ],
  "312": [
    230,
    149
  ],
  "313": [
    259,
    153
  ],
  "314": [
    240,
    138
  ],
  "315": [
    291,
    187
  ],
  "316": [
    230,
    138
  ],
  "317": [
    232,
    181
  ],
  "318": [
    229,
    188
  ],
  "319": [
    231,
    148
  ],
  "320": [
    293,
    129
  ],
  "321": [
    256,
    129
  ],
  "322": [
    245,
    186
  ],
  "323": [
    240,
    137
  ],
  "324": [
    271,
    168
  ],
  "325": [
    10,
    10
  ],
  "326": [
    230,
    150
  ],
  "327": [
    230,
    139
  ],
  "328": [
    278,
    32
  ],
  "329": [
    131,
    167
  ],
  "330": [
    231,
    157
  ],
  "331": [
    240,
    139
  ],
  "332": [
    289,
    144
  ],
  "333": [
    257,
    159
  ],
  "334": [
    229,
    329
  ],
  "335": [
    231,
    136
  ],
  "336": [
    296,
    140
  ],
  "337": [
    229,
    177
  ],
  "338": [
    307,
    139
  ],
  "339": [
    246,
    169
  ],
  "340": [
    300,
    136
  ],
  "341": [
    231,
    187
  ],
  "342": [
    257,
    139
  ],
  "343": [
    247,
    136
  ],
  "344": [
    330,
    128
  ],
  "345": [
    247,
    170
  ],
  "346": [
    229,
    147
  ],
  "347": [
    230,
    178
  ],
  "348": [
    229,
    137
  ],
  "349": [
    285,
    180
  ],
  "350": [
    295,
    150
  ],
  "351": [
    231,
    155
  ],
  "352": [
    229,
    145
  ],
  "353": [
    229,
    185
  ],
  "354": [
    302,
    186
  ],
  "355": [
    229,
    175
  ],
  "356": [
    261,
    171
  ],
  "357": [
    232,
    183
  ],
  "358": [
    240,
    142
  ],
  "359": [
    231,
    173
  ],
  "360": [
    232,
    135
  ],
  "361": [
    229,
    148
  ],
  "362": [
    132,
    191
  ],
  "363": [
    246,
    180
  ],
  "364": [
    233,
    128
  ],
  "365": [
    229,
    138
  ],
  "366": [
    262,
    177
  ],
  "367": [
    297,
    164
  ],
  "368": [
    231,
    159
  ],
  "369": [
    337,
    177
  ],
  "370": [
    272,
    180
  ],
  "371": [
    311,
    139
  ],
  "372": [
    229,
    362
  ],
  "373": [
    230,
    176
  ],
  "374": [
    229,
    134
  ],
  "375": [
    231,
    165
  ],
  "376": [
    232,
    186
  ],
  "377": [
    262,
    134
  ],
  "378": [
    230,
    158
  ],
  "379": [
    335,
    182
  ],
  "380": [
    308,
    189
  ],
  "381": [
    232,
    174
  ],
  "382": [
    231,
    129
  ],
  "383": [
    255,
    146
  ],
  "384": [
    233,
    163
  ],
  "385": [
    229,
    150
  ],
  "386": [
    348,
    141
  ],
  "387": [
    233,
    169
  ],
  "388": [
    229,
    129
  ],
  "389": [
    131,
    189
  ],
  "390": [
    356,
    383
  ],
  "391": [
    294,
    168
  ],
  "392": [
    295,
    130
  ],
  "393": [
    229,
    163
  ],
  "394": [
    275,
    160
  ],
  "395": [
    232,
    180
  ],
  "396": [
    229,
    189
  ],
  "397": [
    271,
    163
  ],
  "398": [
    240,
    173
  ],
  "399": [
    229,
    183
  ],
  "400": [
    232,
    151
  ],
  "401": [
    316,
    138
  ],
  "402": [
    241,
    129
  ],
  "403": [
    230,
    131
  ],
  "404": [
    282,
    147
  ],
  "405": [
    230,
    179
  ],
  "406": [
    229,
    186
  ],
  "407": [
    376,
    171
  ],
  "408": [
    340,
    379
  ],
  "409": [
    229,
    146
  ],
  "410": [
    275,
    182
  ],
  "411": [
    301,
    254
  ],
  "412": [
    230,
    155
  ],
  "413": [
    230,
    148
  ],
  "414": [
    400,
    143
  ],
  "415": [
    231,
    137
  ],
  "416": [
    359,
    137
  ],
  "417": [
    262,
    143
  ],
  "418": [
    233,
    157
  ],
  "419": [
    230,
    175
  ],
  "420": [
    232,
    190
  ],
  "421": [
    232,
    139
  ],
  "422": [
    228,
    190
  ],
  "423": [
    231,
    189
  ],
  "424": [
    290,
    170
  ],
  "425": [
    257,
    136
  ],
  "426": [
    233,
    149
  ],
  "427": [
    231,
    172
  ],
  "428": [
    231,
    140
  ],
  "429": [
    306,
    131
  ],
  "430": [
    166,
    129
  ],
  "431": [
    230,
    180
  ],
  "432": [
    304,
    176
  ],
  "433": [
    231,
    169
  ],
  "434": [
    250,
    149
  ],
  "435": [
    361,
    144
  ],
  "436": [
    233,
    153
  ],
  "437": [
    230,
    140
  ],
  "438": [
    290,
    142
  ],
  "439": [
    247,
    171
  ],
  "440": [
    251,
    172
  ],
  "441": [
    233,
    146
  ],
  "442": [
    426,
    191
  ],
  "443": [
    232,
    430
  ],
  "444": [
    323,
    414
  ],
  "445": [
    168,
    128
  ],
  "446": [
    296,
    145
  ],
  "447": [
    230,
    129
  ],
  "448": [
    275,
    165
  ],
  "449": [
    282,
    139
  ],
  "450": [
    230,
    142
  ],
  "451": [
    368,
    165
  ],
  "452": [
    289,
    153
  ],
  "453": [
    230,
    181
  ],
  "454": [
    233,
    152
  ],
  "455": [
    231,
    178
  ],
  "456": [
    232,
    445
  ],
  "457": [
    233,
    154
  ],
  "458": [
    299,
    158
  ],
  "459": [
    240,
    164
  ],
  "460": [
    265,
    284
  ],
  "461": [
    228,
    191
  ],
  "462": [
    232,
    144
  ],
  "463": [
    297,
    163
  ],
  "464": [
    317,
    176
  ],
  "465": [
    272,
    129
  ],
  "466": [
    274,
    182
  ],
  "467": [
    319,
    159
  ],
  "468": [
    233,
    155
  ],
  "469": [
    303,
    397
  ],
  "470": [
    232,
    189
  ],
  "471": [
    232,
    176
  ],
  "472": [
    230,
    160
  ],
  "473": [
    245,
    140
  ],
  "474": [
    229,
    128
  ],
  "475": [
    259,
    152
  ],
  "476": [
    231,
    171
  ],
  "477": [
    246,
    132
  ],
  "478": [
    231,
    153
  ],
  "479": [
    233,
    173
  ],
  "480": [
    229,
    157
  ],
  "481": [
    250,
    143
  ],
  "482": [
    229,
    140
  ],
  "483": [
    375,
    158
  ],
  "484": [
    305,
    151
  ],
  "485": [
    233,
    389
  ],
  "486": [
    242,
    155
  ],
  "487": [
    318,
    159
  ],
  "488": [
    232,
    138
  ],
  "489": [
    232,
    136
  ],
  "490": [
    393,
    176
  ],
  "491": [
    319,
    154
  ],
  "492": [
    230,
    177
  ],
  "493": [
    230,
    130
  ],
  "494": [
    233,
    161
  ],
  "495": [
    245,
    145
  ],
  "496": [
    387,
    172
  ],
  "497": [
    373,
    180
  ],
  "498": [
    347,
    153
  ],
  "499": [
    231,
    132
  ],
  "500": [
    230,
    163
  ],
  "501": [
    232,
    162
  ],
  "502": [
    232,
    132
  ],
  "503": [
    326,
    185
  ],
  "504": [
    311,
    159
  ],
  "505": [
    251,
    138
  ],
  "506": [
    317,
    183
  ],
  "507": [
    230,
    141
  ],
  "508": [
    433,
    186
  ],
  "509": [
    357,
    175
  ],
  "510": [
    231,
    186
  ],
  "511": [
    232,
    153
  ],
  "512": [
    384,
    142
  ],
  "513": [
    245,
    155
  ],
  "514": [
    233,
    147
  ],
  "515": [
    455,
    190
  ],
  "516": [
    271,
    176
  ],
  "517": [
    299,
    155
  ],
  "518": [
    409,
    140
  ],
  "519": [
    312,
    153
  ],
  "520": [
    427,
    145
  ],
  "521": [
    270,
    131
  ],
  "522": [
    435,
    334
  ],
  "523": [
    388,
    154
  ],
  "524": [
    272,
    179
  ],
  "525": [
    270,
    172
  ],
  "526": [
    247,
    175
  ],
  "527": [
    360,
    170
  ],
  "528": [
    246,
    154
  ],
  "529": [
    240,
    186
  ],
  "530": [
    232,
    131
  ],
  "531": [
    327,
    191
  ],
  "532": [
    165,
    191
  ],
  "533": [
    299,
    189
  ],
  "534": [
    418,
    162
  ],
  "535": [
    232,
    142
  ],
  "536": [
    230,
    184
  ],
  "537": [
    421,
    165
  ],
  "538": [
    341,
    143
  ],
  "539": [
    230,
    172
  ],
  "540": [
    245,
    139
  ],
  "541": [
    294,
    174
  ],
  "542": [
    247,
    152
  ],
  "543": [
    232,
    143
  ],
  "544": [
    233,
    190
  ],
  "545": [
    270,
    142
  ],
  "546": [
    247,
    163
  ],
  "547": [
    251,
    153
  ],
  "548": [
    259,
    135
  ],
  "549": [
    318,
    128
  ],
  "550": [
    232,
    532
  ],
  "551": [
    378,
    156
  ],
  "552": [
    351,
    184
  ],
  "553": [
    499,
    182
  ],
  "554": [
    479,
    148
  ],
  "555": [
    285,
    183
  ],
  "556": [
    231,
    149
  ],
  "557": [
    544,
    153
  ],
  "558": [
    294,
    187
  ],
  "559": [
    230,
    153
  ],
  "560": [
    282,
    141
  ],
  "561": [
    274,
    157
  ],
  "562": [
    230,
    187
  ],
  "563": [
    232,
    130
  ],
  "564": [
    240,
    148
  ],
  "565": [
    233,
    148
  ],
  "566": [
    233,
    171
  ],
  "567": [
    232,
    141
  ],
  "568": [
    247,
    150
  ],
  "569": [
    262,
    154
  ],
  "570": [
    230,
    132
  ],
  "571": [
    231,
    180
  ],
  "572": [
    231,
    167
  ],
  "573": [
    231,
    174
  ],
  "574": [
    382,
    171
  ],
  "575": [
    431,
    158
  ],
  "576": [
    498,
    334
  ],
  "577": [
    230,
    145
  ],
  "578": [
    230,
    174
  ],
  "579": [
    396,
    147
  ],
  "580": [
    353,
    180
  ],
  "581": [
    543,
    169
  ],
  "582": [
    259,
    155
  ],
  "583": [
    327,
    156
  ],
  "584": [
    518,
    569
  ],
  "585": [
    462,
    168
  ],
  "586": [
    581,
    585
  ],
  "587": [
    566,
    152
  ],
  "588": [
    268,
    336
  ],
  "589": [
    413,
    190
  ],
  "590": [
    438,
    425
  ],
  "591": [
    273,
    146
  ],
  "592": [
    520,
    254
  ],
  "593": [
    233,
    162
  ],
  "594": [
    360,
    179
  ],
  "595": [
    231,
    139
  ],
  "596": [
    304,
    134
  ],
  "597": [
    250,
    155
  ],
  "598": [
    422,
    191
  ],
  "599": [
    245,
    148
  ],
  "600": [
    233,
    165
  ],
  "601": [
    261,
    137
  ],
  "602": [
    258,
    451
  ],
  "603": [
    423,
    162
  ],
  "604": [
    535,
    171
  ],
  "605": [
    274,
    152
  ],
  "606": [
    420,
    185
  ],
  "607": [
    294,
    180
  ],
  "608": [
    346,
    169
  ],
  "609": [
    229,
    178
  ],
  "610": [
    405,
    149
  ],
  "611": [
    488,
    177
  ],
  "612": [
    269,
    440
  ],
  "613": [
    312,
    162
  ],
  "614": [
    229,
    168
  ],
  "615": [
    246,
    170
  ],
  "616": [
    352,
    189
  ],
  "617": [
    493,
    159
  ],
  "618": [
    412,
    190
  ],
  "619": [
    457,
    190
  ],
  "620": [
    260,
    142
  ],
  "621": [
    302,
    160
  ],
  "622": [
    240,
    135
  ],
  "623": [
    231,
    166
  ],
  "624": [
    308,
    179
  ],
  "625": [
    385,
    156
  ],
  "626": [
    273,
    128
  ],
  "627": [
    246,
    150
  ],
  "628": [
    272,
    131
  ],
  "629": [
    305,
    154
  ],
  "630": [
    233,
    187
  ],
  "631": [
    230,
    133
  ],
  "632": [
    233,
    166
  ],
  "633": [
    442,
    321
  ],
  "634": [
    428,
    180
  ],
  "635": [
    500,
    146
  ],
  "636": [
    240,
    156
  ],
  "637": [
    261,
    172
  ],
  "638": [
    229,
    149
  ],
  "639": [
    231,
    130
  ],
  "640": [
    231,
    131
  ],
  "641": [
    350,
    515
  ],
  "642": [
    233,
    170
  ],
  "643": [
    501,
    171
  ],
  "644": [
    270,
    141
  ],
  "645": [
    480,
    144
  ],
  "646": [
    232,
    389
  ],
  "647": [
    291,
    159
  ],
  "648": [
    274,
    171
  ],
  "649": [
    321,
    452
  ],
  "650": [
    474,
    146
  ],
  "651": [
    229,
    159
  ],
  "652": [
    231,
    188
  ],
  "653": [
    373,
    148
  ],
  "654": [
    232,
    133
  ],
  "655": [
    275,
    169
  ],
  "656": [
    261,
    165
  ],
  "657": [
    233,
    189
  ],
  "658": [
    250,
    156
  ],
  "659": [
    250,
    191
  ],
  "660": [
    459,
    284
  ],
  "661": [
    230,
    159
  ],
  "662": [
    346,
    165
  ],
  "663": [
    257,
    131
  ],
  "664": [
    230,
    183
  ],
  "665": [
    390,
    254
  ],
  "666": [
    307,
    137
  ],
  "667": [
    231,
    164
  ],
  "668": [
    32,
    252
  ],
  "669": [
    261,
    132
  ],
  "670": [
    312,
    145
  ],
  "671": [
    264,
    172
  ],
  "672": [
    270,
    140
  ],
  "673": [
    256,
    140
  ],
  "674": [
    290,
    165
  ],
  "675": [
    297,
    187
  ],
  "676": [
    482,
    150
  ],
  "677": [
    230,
    182
  ],
  "678": [
    264,
    157
  ],
  "679": [
    489,
    172
  ],
  "680": [
    232,
    137
  ],
  "681": [
    335,
    183
  ],
  "682": [
    230,
    161
  ],
  "683": [
    347,
    161
  ],
  "684": [
    293,
    130
  ],
  "685": [
    231,
    190
  ],
  "686": [
    491,
    425
  ],
  "687": [
    355,
    187
  ],
  "688": [
    413,
    182
  ],
  "689": [
    374,
    141
  ],
  "690": [
    319,
    168
  ],
  "691": [
    230,
    146
  ],
  "692": [
    306,
    181
  ],
  "693": [
    478,
    190
  ],
  "694": [
    271,
    159
  ],
  "695": [
    233,
    133
  ],
  "696": [
    232,
    163
  ],
  "697": [
    273,
    132
  ],
  "698": [
    274,
    154
  ],
  "699": [
    258,
    277
  ],
  "700": [
    657,
    144
  ],
  "701": [
    270,
    132
  ],
  "702": [
    667,
    188
  ],
  "703": [
    233,
    156
  ],
  "704": [
    570,
    143
  ],
  "705": [
    261,
    136
  ],
  "706": [
    240,
    187
  ],
  "707": [
    285,
    157
  ],
  "708": [
    231,
    191
  ],
  "709": [
    617,
    508
  ],
  "710": [
    478,
    189
  ],
  "711": [
    230,
    143
  ],
  "712": [
    305,
    188
  ],
  "713": [
    320,
    268
  ],
  "714": [
    230,
    144
  ],
  "715": [
    415,
    169
  ],
  "716": [
    250,
    134
  ],
  "717": [
    453,
    183
  ],
  "718": [
    255,
    152
  ],
  "719": [
    260,
    159
  ],
  "720": [
    311,
    188
  ],
  "721": [
    255,
    144
  ],
  "722": [
    272,
    138
  ],
  "723": [
    578,
    191
  ],
  "724": [
    293,
    163
  ],
  "725": [
    355,
    185
  ],
  "726": [
    274,
    137
  ],
  "727": [
    403,
    179
  ],
  "728": [
    365,
    168
  ],
  "729": [
    299,
    160
  ],
  "730": [
    651,
    142
  ],
  "731": [
    230,
    154
  ],
  "732": [
    251,
    165
  ],
  "733": [
    276,
    163
  ],
  "734": [
    364,
    129
  ],
  "735": [
    403,
    138
  ],
  "736": [
    470,
    172
  ],
  "737": [
    261,
    181
  ],
  "738": [
    533,
    338
  ],
  "739": [
    352,
    134
  ],
  "740": [
    262,
    189
  ],
  "741": [
    290,
    167
  ],
  "742": [
    231,
    160
  ],
  "743": [
    471,
    162
  ],
  "744": [
    326,
    151
  ],
  "745": [
    232,
    177
  ],
  "746": [
    229,
    152
  ],
  "747": [
    384,
    158
  ],
  "748": [
    270,
    155
  ],
  "749": [
    444,
    254
  ],
  "750": [
    632,
    153
  ],
  "751": [
    399,
    178
  ],
  "752": [
    374,
    133
  ],
  "753": [
    306,
    171
  ],
  "754": [
    268,
    424
  ],
  "755": [
    562,
    161
  ],
  "756": [
    316,
    165
  ],
  "757": [
    514,
    129
  ],
  "758": [
    591,
    487
  ],
  "759": [
    229,
    167
  ],
  "760": [
    364,
    154
  ],
  "761": [
    264,
    155
  ],
  "762": [
    267,
    265
  ],
  "763": [
    261,
    173
  ],
  "764": [
    436,
    141
  ],
  "765": [
    365,
    155
  ],
  "766": [
    739,
    332
  ],
  "767": [
    230,
    162
  ],
  "768": [
    272,
    151
  ],
  "769": [
    412,
    180
  ],
  "770": [
    558,
    456
  ],
  "771": [
    326,
    139
  ],
  "772": [
    638,
    138
  ],
  "773": [
    368,
    179
  ],
  "774": [
    382,
    181
  ],
  "775": [
    231,
    144
  ],
  "776": [
    326,
    135
  ],
  "777": [
    290,
    149
  ],
  "778": [
    358,
    283
  ],
  "779": [
    264,
    136
  ],
  "780": [
    233,
    131
  ],
  "781": [
    246,
    156
  ],
  "782": [
    259,
    145
  ],
  "783": [
    457,
    143
  ],
  "784": [
    303,
    338
  ],
  "785": [
    647,
    281
  ],
  "786": [
    381,
    164
  ],
  "787": [
    258,
    310
  ],
  "788": [
    306,
    189
  ],
  "789": [
    229,
    160
  ],
  "790": [
    258,
    613
  ],
  "791": [
    392,
    434
  ],
  "792": [
    240,
    131
  ],
  "793": [
    264,
    170
  ],
  "794": [
    263,
    128
  ],
  "795": [
    357,
    179
  ],
  "796": [
    251,
    142
  ],
  "797": [
    233,
    184
  ],
  "798": [
    275,
    162
  ],
  "799": [
    232,
    182
  ],
  "800": [
    317,
    182
  ],
  "801": [
    258,
    618
  ],
  "802": [
    262,
    145
  ],
  "803": [
    300,
    157
  ],
  "804": [
    233,
    185
  ],
  "805": [
    630,
    132
  ],
  "806": [
    313,
    284
  ],
  "807": [
    494,
    187
  ],
  "808": [
    312,
    133
  ],
  "809": [
    318,
    132
  ],
  "810": [
    257,
    177
  ],
  "811": [
    233,
    188
  ],
  "812": [
    259,
    142
  ],
  "813": [
    233,
    172
  ],
  "814": [
    231,
    162
  ],
  "815": [
    277,
    284
  ],
  "816": [
    305,
    160
  ],
  "817": [
    472,
    183
  ],
  "818": [
    614,
    152
  ],
  "819": [
    462,
    189
  ],
  "820": [
    403,
    133
  ],
  "821": [
    233,
    159
  ],
  "822": [
    320,
    267
  ],
  "823": [
    385,
    132
  ],
  "824": [
    245,
    178
  ],
  "825": [
    273,
    133
  ],
  "826": [
    387,
    190
  ],
  "827": [
    231,
    150
  ],
  "828": [
    257,
    157
  ],
  "829": [
    270,
    136
  ],
  "830": [
    439,
    254
  ],
  "831": [
    270,
    145
  ],
  "832": [
    417,
    350
  ],
  "833": [
    536,
    133
  ],
  "834": [
    463,
    277
  ],
  "835": [
    511,
    142
  ],
  "836": [
    259,
    156
  ],
  "837": [
    306,
    133
  ],
  "838": [
    231,
    143
  ],
  "839": [
    365,
    159
  ],
  "840": [
    639,
    185
  ],
  "841": [
    285,
    173
  ],
  "842": [
    229,
    169
  ],
  "843": [
    345,
    277
  ],
  "844": [
    421,
    166
  ],
  "845": [
    351,
    180
  ],
  "846": [
    230,
    168
  ],
  "847": [
    573,
    161
  ],
  "848": [
    510,
    162
  ],
  "849": [
    631,
    140
  ],
  "850": [
    354,
    281
  ],
  "851": [
    274,
    158
  ],
  "852": [
    428,
    170
  ],
  "853": [
    229,
    153
  ],
  "854": [
    731,
    151
  ],
  "855": [
    247,
    151
  ],
  "856": [
    353,
    178
  ],
  "857": [
    680,
    178
  ],
  "858": [
    263,
    161
  ],
  "859": [
    422,
    157
  ],
  "860": [
    472,
    145
  ],
  "861": [
    355,
    186
  ],
  "862": [
    419,
    141
  ],
  "863": [
    231,
    133
  ],
  "864": [
    232,
    146
  ],
  "865": [
    416,
    269
  ],
  "866": [
    450,
    165
  ],
  "867": [
    492,
    130
  ],
  "868": [
    461,
    177
  ],
  "869": [
    821,
    179
  ],
  "870": [
    745,
    161
  ],
  "871": [
    245,
    142
  ],
  "872": [
    259,
    158
  ],
  "873": [
    341,
    134
  ],
  "874": [
    502,
    177
  ],
  "875": [
    275,
    168
  ],
  "876": [
    232,
    140
  ],
  "877": [
    250,
    141
  ],
  "878": [
    423,
    151
  ],
  "879": [
    231,
    151
  ],
  "880": [
    385,
    157
  ],
  "881": [
    472,
    185
  ],
  "882": [
    441,
    175
  ],
  "883": [
    231,
    170
  ],
  "884": [
    230,
    147
  ],
  "885": [
    502,
    154
  ],
  "886": [
    593,
    134
  ],
  "887": [
    263,
    142
  ],
  "888": [
    306,
    153
  ],
  "889": [
    399,
    174
  ],
  "890": [
    330,
    161
  ],
  "891": [
    388,
    135
  ],
  "892": [
    361,
    164
  ],
  "893": [
    746,
    180
  ],
  "894": [
    447,
    144
  ],
  "895": [
    305,
    164
  ],
  "896": [
    289,
    151
  ],
  "897": [
    300,
    166
  ],
  "898": [
    468,
    168
  ],
  "899": [
    539,
    162
  ],
  "900": [
    308,
    143
  ],
  "901": [
    695,
    146
  ],
  "902": [
    476,
    139
  ],
  "903": [
    256,
    179
  ],
  "904": [
    282,
    128
  ],
  "905": [
    504,
    284
  ],
  "906": [
    358,
    287
  ],
  "907": [
    298,
    265
  ],
  "908": [
    347,
    179
  ],
  "909": [
    308,
    137
  ],
  "910": [
    419,
    155
  ],
  "911": [
    265,
    490
  ],
  "912": [
    304,
    128
  ],
  "913": [
    323,
    284
  ],
  "914": [
    813,
    188
  ],
  "915": [
    264,
    168
  ],
  "916": [
    229,
    139
  ],
  "917": [
    282,
    175
  ],
  "918": [
    230,
    165
  ],
  "919": [
    297,
    165
  ],
  "920": [
    395,
    157
  ],
  "921": [
    231,
    138
  ],
  "922": [
    261,
    179
  ],
  "923": [
    312,
    176
  ],
  "924": [
    571,
    167
  ],
  "925": [
    313,
    336
  ],
  "926": [
    419,
    149
  ],
  "927": [
    406,
    167
  ],
  "928": [
    393,
    171
  ],
  "929": [
    669,
    487
  ],
  "930": [
    313,
    416
  ],
  "931": [
    561,
    920
  ],
  "932": [
    505,
    448
  ],
  "933": [
    461,
    157
  ],
  "934": [
    269,
    416
  ],
  "935": [
    577,
    135
  ],
  "936": [
    318,
    160
  ],
  "937": [
    406,
    156
  ],
  "938": [
    454,
    180
  ],
  "939": [
    418,
    146
  ],
  "940": [
    525,
    310
  ],
  "941": [
    274,
    179
  ],
  "942": [
    301,
    592
  ],
  "943": [
    453,
    129
  ],
  "944": [
    415,
    155
  ],
  "945": [
    556,
    153
  ],
  "946": [
    316,
    172
  ],
  "947": [
    277,
    269
  ],
  "948": [
    268,
    284
  ],
  "949": [
    433,
    191
  ],
  "950": [
    600,
    173
  ],
  "951": [
    530,
    156
  ],
  "952": [
    333,
    258
  ],
  "953": [
    423,
    170
  ],
  "954": [
    567,
    137
  ],
  "955": [
    447,
    169
  ],
  "956": [
    468,
    183
  ],
  "957": [
    314,
    386
  ],
  "958": [
    248,
    130
  ],
  "959": [
    399,
    166
  ],
  "960": [
    572,
    176
  ],
  "961": [
    282,
    135
  ],
  "962": [
    300,
    184
  ],
  "963": [
    240,
    190
  ],
  "964": [
    324,
    367
  ],
  "965": [
    281,
    267
  ],
  "966": [
    375,
    150
  ],
  "967": [
    307,
    176
  ],
  "968": [
    305,
    145
  ],
  "969": [
    568,
    538
  ],
  "970": [
    556,
    140
  ],
  "971": [
    230,
    188
  ],
  "972": [
    370,
    349
  ],
  "973": [
    229,
    180
  ],
  "974": [
    287,
    371
  ],
  "975": [
    352,
    188
  ],
  "976": [
    305,
    143
  ],
  "977": [
    476,
    165
  ],
  "978": [
    302,
    128
  ],
  "979": [
    296,
    141
  ],
  "980": [
    240,
    150
  ],
  "981": [
    392,
    505
  ],
  "982": [
    396,
    146
  ],
  "983": [
    231,
    147
  ],
  "984": [
    502,
    184
  ],
  "985": [
    251,
    164
  ],
  "986": [
    664,
    177
  ],
  "987": [
    315,
    267
  ],
  "988": [
    313,
    265
  ],
  "989": [
    232,
    184
  ],
  "990": [
    427,
    172
  ],
  "991": [
    378,
    151
  ],
  "992": [
    263,
    190
  ],
  "993": [
    345,
    320
  ],
  "994": [
    316,
    164
  ],
  "995": [
    313,
    679
  ],
  "996": [
    510,
    181
  ],
  "997": [
    470,
    187
  ],
  "998": [
    251,
    182
  ],
  "999": [
    312,
    163
  ],
  "1000": [
    279,
    134
  ],
  "1001": [
    240,
    185
  ],
  "1002": [
    247,
    140
  ],
  "1003": [
    775,
    134
  ],
  "1004": [
    521,
    267
  ],
  "1005": [
    405,
    188
  ],
  "1006": [
    438,
    288
  ],
  "1007": [
    240,
    136
  ],
  "1008": [
    437,
    135
  ],
  "1009": [
    382,
    175
  ],
  "1010": [
    742,
    180
  ],
  "1011": [
    450,
    146
  ],
  "1012": [
    271,
    186
  ],
  "1013": [
    494,
    182
  ],
  "1014": [
    691,
    158
  ],
  "1015": [
    326,
    189
  ],
  "1016": [
    642,
    130
  ],
  "1017": [
    573,
    141
  ],
  "1018": [
    229,
    161
  ],
  "1019": [
    406,
    148
  ],
  "1020": [
    918,
    188
  ],
  "1021": [
    351,
    152
  ],
  "1022": [
    229,
    179
  ],
  "1023": [
    231,
    163
  ],
  "1024": [
    507,
    137
  ],
  "1025": [
    345,
    713
  ],
  "1026": [
    304,
    171
  ],
  "1027": [
    262,
    138
  ],
  "1028": [
    506,
    281
  ],
  "1029": [
    352,
    138
  ],
  "1030": [
    381,
    184
  ],
  "1031": [
    452,
    301
  ],
  "1032": [
    454,
    181
  ],
  "1033": [
    279,
    135
  ],
  "1034": [
    261,
    168
  ],
  "1035": [
    353,
    179
  ],
  "1036": [
    461,
    174
  ],
  "1037": [
    247,
    179
  ],
  "1038": [
    468,
    190
  ],
  "1039": [
    757,
    635
  ],
  "1040": [
    550,
    339
  ],
  "1041": [
    32,
    268
  ],
  "1042": [
    247,
    164
  ],
  "1043": [
    358,
    269
  ],
  "1044": [
    274,
    185
  ],
  "1045": [
    248,
    135
  ],
  "1046": [
    246,
    171
  ],
  "1047": [
    258,
    481
  ],
  "1048": [
    853,
    168
  ],
  "1049": [
    412,
    176
  ],
  "1050": [
    511,
    189
  ],
  "1051": [
    346,
    141
  ],
  "1052": [
    318,
    149
  ],
  "1053": [
    395,
    188
  ],
  "1054": [
    539,
    178
  ],
  "1055": [
    273,
    161
  ],
  "1056": [
    346,
    173
  ],
  "1057": [
    563,
    175
  ],
  "1058": [
    559,
    154
  ],
  "1059": [
    786,
    310
  ],
  "1060": [
    842,
    134
  ],
  "1061": [
    630,
    145
  ],
  "1062": [
    231,
    168
  ],
  "1063": [
    287,
    313
  ],
  "1064": [
    339,
    338
  ],
  "1065": [
    454,
    179
  ],
  "1066": [
    232,
    147
  ],
  "1067": [
    381,
    161
  ],
  "1068": [
    231,
    329
  ],
  "1069": [
    419,
    148
  ],
  "1070": [
    275,
    129
  ],
  "1071": [
    261,
    182
  ],
  "1072": [
    231,
    134
  ],
  "1073": [
    489,
    141
  ],
  "1074": [
    623,
    187
  ],
  "1075": [
    255,
    191
  ],
  "1076": [
    293,
    137
  ],
  "1077": [
    281,
    288
  ],
  "1078": [
    258,
    443
  ],
  "1079": [
    261,
    131
  ],
  "1080": [
    789,
    130
  ],
  "1081": [
    32,
    972
  ],
  "1082": [
    557,
    338
  ],
  "1083": [
    268,
    321
  ],
  "1084": [
    470,
    174
  ],
  "1085": [
    279,
    174
  ],
  "1086": [
    350,
    424
  ],
  "1087": [
    355,
    191
  ],
  "1088": [
    500,
    141
  ],
  "1089": [
    396,
    169
  ],
  "1090": [
    876,
    182
  ],
  "1091": [
    366,
    277
  ],
  "1092": [
    340,
    591
  ],
  "1093": [
    341,
    179
  ],
  "1094": [
    551,
    553
  ],
  "1095": [
    320,
    283
  ],
  "1096": [
    615,
    332
  ],
  "1097": [
    636,
    694
  ],
  "1098": [
    441,
    187
  ],
  "1099": [
    290,
    146
  ],
  "1100": [
    392,
    281
  ],
  "1101": [
    269,
    408
  ],
  "1102": [
    514,
    182
  ],
  "1103": [
    247,
    176
  ],
  "1104": [
    388,
    183
  ],
  "1105": [
    318,
    186
  ],
  "1106": [
    437,
    129
  ],
  "1107": [
    246,
    141
  ],
  "1108": [
    258,
    646
  ],
  "1109": [
    431,
    187
  ],
  "1110": [
    360,
    163
  ],
  "1111": [
    582,
    315
  ],
  "1112": [
    302,
    161
  ],
  "1113": [
    261,
    162
  ],
  "1114": [
    231,
    145
  ],
  "1115": [
    302,
    182
  ],
  "1116": [
    266,
    170
  ],
  "1117": [
    677,
    136
  ],
  "1118": [
    298,
    513
  ],
  "1119": [
    559,
    147
  ],
  "1120": [
    741,
    616
  ],
  "1121": [
    272,
    183
  ],
  "1122": [
    269,
    288
  ],
  "1123": [
    283,
    288
  ],
  "1124": [
    452,
    469
  ],
  "1125": [
    229,
    154
  ],
  "1126": [
    263,
    150
  ],
  "1127": [
    562,
    154
  ],
  "1128": [
    378,
    170
  ],
  "1129": [
    321,
    681
  ],
  "1130": [
    274,
    151
  ],
  "1131": [
    447,
    182
  ],
  "1132": [
    283,
    265
  ],
  "1133": [
    264,
    141
  ],
  "1134": [
    240,
    162
  ],
  "1135": [
    241,
    138
  ],
  "1136": [
    241,
    139
  ],
  "1137": [
    437,
    137
  ],
  "1138": [
    381,
    178
  ],
  "1139": [
    395,
    171
  ],
  "1140": [
    684,
    371
  ],
  "1141": [
    461,
    161
  ],
  "1142": [
    708,
    187
  ],
  "1143": [
    577,
    134
  ],
  "1144": [
    291,
    174
  ],
  "1145": [
    409,
    146
  ],
  "1146": [
    483,
    760
  ],
  "1147": [
    637,
    706
  ],
  "1148": [
    640,
    159
  ],
  "1149": [
    353,
    140
  ],
  "1150": [
    285,
    151
  ],
  "1151": [
    565,
    166
  ],
  "1152": [
    312,
    180
  ],
  "1153": [
    308,
    136
  ],
  "1154": [
    576,
    254
  ],
  "1155": [
    322,
    466
  ],
  "1156": [
    567,
    175
  ],
  "1157": [
    654,
    176
  ],
  "1158": [
    492,
    137
  ],
  "1159": [
    306,
    141
  ],
  "1160": [
    361,
    172
  ],
  "1161": [
    350,
    554
  ],
  "1162": [
    258,
    320
  ],
  "1163": [
    246,
    177
  ],
  "1164": [
    666,
    803
  ],
  "1165": [
    326,
    173
  ],
  "1166": [
    863,
    167
  ],
  "1167": [
    542,
    658
  ],
  "1168": [
    609,
    129
  ],
  "1169": [
    257,
    166
  ],
  "1170": [
    287,
    440
  ],
  "1171": [
    285,
    134
  ],
  "1172": [
    405,
    170
  ],
  "1173": [
    395,
    164
  ],
  "1174": [
    229,
    187
  ],
  "1175": [
    487,
    332
  ],
  "1176": [
    257,
    133
  ],
  "1177": [
    634,
    338
  ],
  "1178": [
    231,
    177
  ],
  "1179": [
    298,
    284
  ],
  "1180": [
    310,
    268
  ],
  "1181": [
    290,
    157
  ],
  "1182": [
    359,
    148
  ],
  "1183": [
    357,
    159
  ],
  "1184": [
    682,
    131
  ],
  "1185": [
    600,
    182
  ],
  "1186": [
    232,
    129
  ],
  "1187": [
    519,
    283
  ],
  "1188": [
    229,
    162
  ],
  "1189": [
    662,
    662
  ],
  "1190": [
    357,
    145
  ],
  "1191": [
    233,
    158
  ],
  "1192": [
    364,
    160
  ],
  "1193": [
    341,
    147
  ],
  "1194": [
    973,
    150
  ],
  "1195": [
    272,
    142
  ],
  "1196": [
    759,
    147
  ],
  "1197": [
    694,
    516
  ],
  "1198": [
    307,
    132
  ],
  "1199": [
    450,
    168
  ],
  "1200": [
    327,
    133
  ],
  "1201": [
    248,
    141
  ],
  "1202": [
    297,
    166
  ],
  "1203": [
    324,
    268
  ],
  "1204": [
    623,
    133
  ],
  "1205": [
    593,
    152
  ],
  "1206": [
    155,
    331
  ],
  "1207": [
    285,
    165
  ],
  "1208": [
    541,
    254
  ],
  "1209": [
    415,
    185
  ],
  "1210": [
    232,
    159
  ],
  "1211": [
    254,
    928
  ],
  "1212": [
    419,
    171
  ],
  "1213": [
    391,
    627
  ],
  "1214": [
    340,
    669
  ],
  "1215": [
    247,
    137
  ],
  "1216": [
    265,
    700
  ],
  "1217": [
    282,
    167
  ],
  "1218": [
    578,
    181
  ],
  "1219": [
    899,
    625
  ],
  "1220": [
    364,
    128
  ],
  "1221": [
    359,
    139
  ],
  "1222": [
    441,
    137
  ],
  "1223": [
    274,
    191
  ],
  "1224": [
    663,
    277
  ],
  "1225": [
    232,
    155
  ],
  "1226": [
    485,
    277
  ],
  "1227": [
    350,
    338
  ],
  "1228": [
    268,
    766
  ],
  "1229": [
    393,
    129
  ],
  "1230": [
    511,
    154
  ],
  "1231": [
    357,
    170
  ],
  "1232": [
    571,
    160
  ],
  "1233": [
    471,
    129
  ],
  "1234": [
    395,
    165
  ],
  "1235": [
    685,
    164
  ],
  "1236": [
    614,
    129
  ],
  "1237": [
    324,
    588
  ],
  "1238": [
    232,
    145
  ],
  "1239": [
    437,
    130
  ],
  "1240": [
    261,
    187
  ],
  "1241": [
    229,
    171
  ],
  "1242": [
    479,
    130
  ],
  "1243": [
    1139,
    334
  ],
  "1244": [
    378,
    182
  ],
  "1245": [
    495,
    363
  ],
  "1246": [
    286,
    887
  ],
  "1247": [
    864,
    153
  ],
  "1248": [
    229,
    158
  ],
  "1249": [
    460,
    284
  ],
  "1250": [
    300,
    131
  ],
  "1251": [
    476,
    175
  ],
  "1252": [
    285,
    184
  ],
  "1253": [
    353,
    191
  ],
  "1254": [
    337,
    130
  ],
  "1255": [
    381,
    169
  ],
  "1256": [
    436,
    1206
  ],
  "1257": [
    615,
    1130
  ],
  "1258": [
    245,
    137
  ],
  "1259": [
    571,
    162
  ],
  "1260": [
    846,
    161
  ],
  "1261": [
    474,
    159
  ],
  "1262": [
    450,
    140
  ],
  "1263": [
    438,
    467
  ],
  "1264": [
    436,
    162
  ],
  "1265": [
    507,
    162
  ],
  "1266": [
    351,
    150
  ],
  "1267": [
    302,
    164
  ],
  "1268": [
    256,
    141
  ],
  "1269": [
    262,
    152
  ],
  "1270": [
    304,
    153
  ],
  "1271": [
    405,
    162
  ],
  "1272": [
    247,
    138
  ],
  "1273": [
    685,
    142
  ],
  "1274": [
    257,
    144
  ],
  "1275": [
    563,
    137
  ],
  "1276": [
    230,
    362
  ],
  "1277": [
    357,
    140
  ],
  "1278": [
    247,
    183
  ],
  "1279": [
    799,
    179
  ],
  "1280": [
    530,
    140
  ],
  "1281": [
    232,
    149
  ],
  "1282": [
    558,
    310
  ],
  "1283": [
    406,
    132
  ],
  "1284": [
    528,
    802
  ],
  "1285": [
    233,
    134
  ],
  "1286": [
    446,
    1017
  ],
  "1287": [
    397,
    334
  ],
  "1288": [
    464,
    267
  ],
  "1289": [
    508,
    398
  ],
  "1290": [
    439,
    523
  ],
  "1291": [
    542,
    523
  ],
  "1292": [
    1125,
    183
  ],
  "1293": [
    681,
    681
  ],
  "1294": [
    415,
    153
  ],
  "1295": [
    321,
    292
  ],
  "1296": [
    268,
    641
  ],
  "1297": [
    384,
    159
  ],
  "1298": [
    780,
    168
  ],
  "1299": [
    492,
    159
  ],
  "1300": [
    304,
    151
  ],
  "1301": [
    353,
    184
  ],
  "1302": [
    482,
    133
  ],
  "1303": [
    737,
    1048
  ],
  "1304": [
    484,
    334
  ],
  "1305": [
    232,
    185
  ],
  "1306": [
    473,
    465
  ],
  "1307": [
    281,
    333
  ],
  "1308": [
    1260,
    817
  ],
  "1309": [
    250,
    147
  ],
  "1310": [
    492,
    157
  ],
  "1311": [
    609,
    184
  ],
  "1312": [
    621,
    284
  ],
  "1313": [
    258,
    380
  ],
  "1314": [
    258,
    1205
  ],
  "1315": [
    136,
    696
  ],
  "1316": [
    447,
    188
  ],
  "1317": [
    353,
    182
  ],
  "1318": [
    437,
    145
  ],
  "1319": [
    727,
    277
  ],
  "1320": [
    288,
    277
  ],
  "1321": [
    429,
    398
  ],
  "1322": [
    291,
    162
  ],
  "1323": [
    501,
    1315
  ],
  "1324": [
    1323,
    159
  ],
  "1325": [
    245,
    164
  ],
  "1326": [
    422,
    141
  ],
  "1327": [
    392,
    367
  ],
  "1328": [
    711,
    173
  ],
  "1329": [
    375,
    165
  ],
  "1330": [
    418,
    158
  ],
  "1331": [
    352,
    128
  ],
  "1332": [
    245,
    166
  ],
  "1333": [
    364,
    146
  ],
  "1334": [
    436,
    136
  ],
  "1335": [
    260,
    190
  ],
  "1336": [
    539,
    161
  ],
  "1337": [
    465,
    596
  ],
  "1338": [
    388,
    156
  ],
  "1339": [
    654,
    190
  ],
  "1340": [
    233,
    186
  ],
  "1341": [
    275,
    167
  ],
  "1342": [
    299,
    173
  ],
  "1343": [
    542,
    676
  ],
  "1344": [
    696,
    133
  ],
  "1345": [
    368,
    163
  ],
  "1346": [
    528,
    410
  ],
  "1347": [
    530,
    134
  ],
  "1348": [
    384,
    152
  ],
  "1349": [
    270,
    190
  ],
  "1350": [
    287,
    590
  ],
  "1351": [
    260,
    143
  ],
  "1352": [
    260,
    165
  ],
  "1353": [
    304,
    169
  ],
  "1354": [
    348,
    145
  ],
  "1355": [
    230,
    186
  ],
  "1356": [
    677,
    167
  ],
  "1357": [
    370,
    343
  ],
  "1358": [
    335,
    177
  ],
  "1359": [
    478,
    187
  ],
  "1360": [
    422,
    155
  ],
  "1361": [
    355,
    146
  ],
  "1362": [
    270,
    185
  ],
  "1363": [
    345,
    310
  ],
  "1364": [
    631,
    162
  ],
  "1365": [
    371,
    320
  ],
  "1366": [
    294,
    185
  ],
  "1367": [
    432,
    367
  ],
  "1368": [
    511,
    171
  ],
  "1369": [
    407,
    265
  ],
  "1370": [
    623,
    143
  ],
  "1371": [
    294,
    170
  ],
  "1372": [
    230,
    189
  ],
  "1373": [
    352,
    181
  ],
  "1374": [
    287,
    277
  ],
  "1375": [
    346,
    132
  ],
  "1376": [
    299,
    180
  ],
  "1377": [
    354,
    315
  ],
  "1378": [
    406,
    149
  ],
  "1379": [
    415,
    181
  ],
  "1380": [
    554,
    338
  ],
  "1381": [
    232,
    156
  ],
  "1382": [
    231,
    158
  ],
  "1383": [
    811,
    147
  ],
  "1384": [
    530,
    161
  ],
  "1385": [
    269,
    333
  ],
  "1386": [
    642,
    168
  ],
  "1387": [
    248,
    173
  ],
  "1388": [
    782,
    386
  ],
  "1389": [
    371,
    371
  ],
  "1390": [
    449,
    1218
  ],
  "1391": [
    283,
    366
  ],
  "1392": [
    327,
    155
  ],
  "1393": [
    827,
    188
  ],
  "1394": [
    1018,
    148
  ],
  "1395": [
    304,
    135
  ],
  "1396": [
    381,
    190
  ],
  "1397": [
    595,
    174
  ],
  "1398": [
    285,
    154
  ],
  "1399": [
    556,
    170
  ],
  "1400": [
    303,
    547
  ],
  "1401": [
    336,
    534
  ],
  "1402": [
    293,
    146
  ],
  "1403": [
    308,
    148
  ],
  "1404": [
    243,
    153
  ],
  "1405": [
    268,
    513
  ],
  "1406": [
    567,
    161
  ],
  "1407": [
    267,
    283
  ],
  "1408": [
    231,
    179
  ],
  "1409": [
    295,
    153
  ],
  "1410": [
    247,
    169
  ],
  "1411": [
    818,
    818
  ],
  "1412": [
    265,
    858
  ],
  "1413": [
    258,
    526
  ],
  "1414": [
    571,
    171
  ],
  "1415": [
    264,
    149
  ],
  "1416": [
    417,
    288
  ],
  "1417": [
    365,
    179
  ],
  "1418": [
    255,
    150
  ],
  "1419": [
    688,
    267
  ],
  "1420": [
    708,
    160
  ],
  "1421": [
    230,
    166
  ],
  "1422": [
    441,
    177
  ],
  "1423": [
    432,
    267
  ],
  "1424": [
    447,
    168
  ],
  "1425": [
    359,
    145
  ],
  "1426": [
    233,
    177
  ],
  "1427": [
    233,
    178
  ],
  "1428": [
    323,
    465
  ],
  "1429": [
    733,
    1133
  ],
  "1430": [
    250,
    142
  ],
  "1431": [
    1016,
    254
  ],
  "1432": [
    296,
    142
  ],
  "1433": [
    365,
    169
  ],
  "1434": [
    247,
    130
  ],
  "1435": [
    640,
    166
  ],
  "1436": [
    494,
    191
  ],
  "1437": [
    273,
    183
  ],
  "1438": [
    232,
    178
  ],
  "1439": [
    513,
    372
  ],
  "1440": [
    884,
    146
  ],
  "1441": [
    257,
    176
  ],
  "1442": [
    488,
    130
  ],
  "1443": [
    447,
    175
  ],
  "1444": [
    609,
    173
  ],
  "1445": [
    289,
    169
  ],
  "1446": [
    409,
    144
  ],
  "1447": [
    624,
    332
  ],
  "1448": [
    631,
    136
  ],
  "1449": [
    265,
    679
  ],
  "1450": [
    231,
    176
  ],
  "1451": [
    450,
    163
  ],
  "1452": [
    1426,
    188
  ],
  "1453": [
    243,
    152
  ],
  "1454": [
    274,
    180
  ],
  "1455": [
    550,
    503
  ],
  "1456": [
    316,
    150
  ],
  "1457": [
    270,
    169
  ],
  "1458": [
    493,
    178
  ],
  "1459": [
    700,
    339
  ],
  "1460": [
    404,
    675
  ],
  "1461": [
    1457,
    1446
  ],
  "1462": [
    303,
    435
  ],
  "1463": [
    347,
    185
  ],
  "1464": [
    351,
    174
  ],
  "1465": [
    652,
    152
  ],
  "1466": [
    148,
    873
  ],
  "1467": [
    385,
    183
  ],
  "1468": [
    474,
    153
  ],
  "1469": [
    661,
    179
  ],
  "1470": [
    287,
    315
  ],
  "1471": [
    1092,
    440
  ],
  "1472": [
    852,
    390
  ],
  "1473": [
    536,
    184
  ],
  "1474": [
    282,
    145
  ],
  "1475": [
    374,
    183
  ],
  "1476": [
    251,
    1466
  ],
  "1477": [
    297,
    162
  ],
  "1478": [
    565,
    129
  ],
  "1479": [
    452,
    709
  ],
  "1480": [
    489,
    158
  ],
  "1481": [
    586,
    254
  ],
  "1482": [
    294,
    178
  ],
  "1483": [
    315,
    333
  ],
  "1484": [
    274,
    162
  ],
  "1485": [
    283,
    660
  ],
  "1486": [
    287,
    288
  ],
  "1487": [
    959,
    1037
  ],
  "1488": [
    703,
    132
  ],
  "1489": [
    418,
    153
  ],
  "1490": [
    439,
    490
  ],
  "1491": [
    1286,
    635
  ],
  "1492": [
    341,
    163
  ],
  "1493": [
    563,
    154
  ],
  "1494": [
    250,
    153
  ],
  "1495": [
    32,
    301
  ],
  "1496": [
    482,
    151
  ],
  "1497": [
    476,
    185
  ],
  "1498": [
    600,
    174
  ],
  "1499": [
    319,
    178
  ],
  "1500": [
    1072,
    159
  ],
  "1501": [
    539,
    186
  ],
  "1502": [
    1438,
    140
  ],
  "1503": [
    625,
    254
  ],
  "1504": [
    274,
    136
  ],
  "1505": [
    295,
    135
  ],
  "1506": [
    880,
    254
  ],
  "1507": [
    267,
    269
  ],
  "1508": [
    609,
    130
  ],
  "1509": [
    522,
    254
  ],
  "1510": [
    240,
    145
  ],
  "1511": [
    396,
    162
  ],
  "1512": [
    330,
    155
  ],
  "1513": [
    785,
    277
  ],
  "1514": [
    296,
    143
  ],
  "1515": [
    364,
    162
  ],
  "1516": [
    780,
    142
  ],
  "1517": [
    427,
    188
  ],
  "1518": [
    229,
    130
  ],
  "1519": [
    247,
    182
  ],
  "1520": [
    231,
    175
  ],
  "1521": [
    904,
    732
  ],
  "1522": [
    454,
    129
  ],
  "1523": [
    303,
    417
  ],
  "1524": [
    245,
    173
  ],
  "1525": [
    570,
    159
  ],
  "1526": [
    335,
    172
  ],
  "1527": [
    814,
    142
  ],
  "1528": [
    468,
    132
  ],
  "1529": [
    401,
    268
  ],
  "1530": [
    300,
    133
  ],
  "1531": [
    321,
    554
  ],
  "1532": [
    406,
    166
  ],
  "1533": [
    420,
    158
  ],
  "1534": [
    879,
    155
  ],
  "1535": [
    374,
    155
  ],
  "1536": [
    382,
    173
  ],
  "1537": [
    436,
    164
  ],
  "1538": [
    259,
    159
  ],
  "1539": [
    456,
    841
  ],
  "1540": [
    1153,
    434
  ],
  "1541": [
    345,
    940
  ],
  "1542": [
    1119,
    310
  ],
  "1543": [
    368,
    173
  ],
  "1544": [
    525,
    320
  ],
  "1545": [
    381,
    186
  ],
  "1546": [
    376,
    178
  ],
  "1547": [
    838,
    173
  ],
  "1548": [
    507,
    187
  ],
  "1549": [
    711,
    144
  ],
  "1550": [
    270,
    175
  ],
  "1551": [
    269,
    313
  ],
  "1552": [
    341,
    157
  ],
  "1553": [
    315,
    603
  ],
  "1554": [
    339,
    648
  ],
  "1555": [
    304,
    154
  ],
  "1556": [
    290,
    156
  ],
  "1557": [
    295,
    187
  ],
  "1558": [
    517,
    484
  ],
  "1559": [
    838,
    160
  ],
  "1560": [
    272,
    150
  ],
  "1561": [
    989,
    143
  ],
  "1562": [
    382,
    190
  ],
  "1563": [
    347,
    137
  ],
  "1564": [
    265,
    401
  ],
  "1565": [
    684,
    869
  ],
  "1566": [
    326,
    176
  ],
  "1567": [
    374,
    178
  ],
  "1568": [
    499,
    176
  ],
  "1569": [
    682,
    165
  ],
  "1570": [
    726,
    1011
  ],
  "1571": [
    643,
    283
  ],
  "1572": [
    767,
    166
  ],
  "1573": [
    387,
    174
  ],
  "1574": [
    246,
    135
  ],
  "1575": [
    905,
    277
  ],
  "1576": [
    808,
    367
  ],
  "1577": [
    263,
    159
  ],
  "1578": [
    503,
    560
  ],
  "1579": [
    1410,
    363
  ],
  "1580": [
    639,
    188
  ],
  "1581": [
    396,
    177
  ],
  "1582": [
    577,
    184
  ],
  "1583": [
    375,
    184
  ],
  "1584": [
    575,
    336
  ],
  "1585": [
    371,
    410
  ],
  "1586": [
    261,
    177
  ],
  "1587": [
    274,
    163
  ],
  "1588": [
    482,
    185
  ],
  "1589": [
    380,
    469
  ],
  "1590": [
    922,
    776
  ],
  "1591": [
    261,
    189
  ],
  "1592": [
    415,
    140
  ],
  "1593": [
    315,
    281
  ],
  "1594": [
    298,
    434
  ],
  "1595": [
    282,
    152
  ],
  "1596": [
    297,
    135
  ],
  "1597": [
    583,
    597
  ],
  "1598": [
    1222,
    882
  ],
  "1599": [
    536,
    144
  ],
  "1600": [
    431,
    151
  ],
  "1601": [
    587,
    830
  ],
  "1602": [
    599,
    693
  ],
  "1603": [
    531,
    481
  ],
  "1604": [
    240,
    157
  ],
  "1605": [
    535,
    178
  ],
  "1606": [
    559,
    175
  ],
  "1607": [
    247,
    141
  ],
  "1608": [
    269,
    277
  ],
  "1609": [
    352,
    152
  ],
  "1610": [
    983,
    182
  ],
  "1611": [
    323,
    322
  ],
  "1612": [
    314,
    298
  ],
  "1613": [
    864,
    184
  ],
  "1614": [
    428,
    174
  ],
  "1615": [
    476,
    159
  ],
  "1616": [
    298,
    491
  ],
  "1617": [
    1212,
    910
  ],
  "1618": [
    492,
    160
  ],
  "1619": [
    455,
    151
  ],
  "1620": [
    1022,
    176
  ],
  "1621": [
    595,
    188
  ],
  "1622": [
    265,
    927
  ],
  "1623": [
    264,
    159
  ],
  "1624": [
    673,
    315
  ],
  "1625": [
    316,
    171
  ],
  "1626": [
    568,
    354
  ],
  "1627": [
    245,
    143
  ],
  "1628": [
    488,
    166
  ],
  "1629": [
    333,
    603
  ],
  "1630": [
    441,
    166
  ],
  "1631": [
    370,
    560
  ],
  "1632": [
    265,
    410
  ],
  "1633": [
    365,
    191
  ],
  "1634": [
    317,
    144
  ],
  "1635": [
    652,
    160
  ],
  "1636": [
    525,
    349
  ],
  "1637": [
    537,
    277
  ],
  "1638": [
    370,
    258
  ],
  "1639": [
    579,
    410
  ],
  "1640": [
    464,
    509
  ],
  "1641": [
    276,
    168
  ],
  "1642": [
    248,
    174
  ],
  "1643": [
    702,
    254
  ],
  "1644": [
    378,
    129
  ],
  "1645": [
    289,
    164
  ],
  "1646": [
    245,
    149
  ],
  "1647": [
    420,
    176
  ],
  "1648": [
    347,
    187
  ],
  "1649": [
    974,
    283
  ],
  "1650": [
    230,
    329
  ],
  "1651": [
    276,
    128
  ],
  "1652": [
    799,
    129
  ],
  "1653": [
    742,
    141
  ],
  "1654": [
    480,
    161
  ],
  "1655": [
    282,
    171
  ],
  "1656": [
    494,
    190
  ],
  "1657": [
    317,
    140
  ],
  "1658": [
    285,
    129
  ],
  "1659": [
    468,
    170
  ],
  "1660": [
    453,
    170
  ],
  "1661": [
    409,
    172
  ],
  "1662": [
    385,
    138
  ],
  "1663": [
    337,
    133
  ],
  "1664": [
    327,
    190
  ],
  "1665": [
    1023,
    149
  ],
  "1666": [
    312,
    140
  ],
  "1667": [
    523,
    284
  ],
  "1668": [
    827,
    145
  ],
  "1669": [
    304,
    185
  ],
  "1670": [
    290,
    128
  ],
  "1671": [
    494,
    186
  ],
  "1672": [
    703,
    158
  ],
  "1673": [
    458,
    363
  ],
  "1674": [
    1066,
    172
  ],
  "1675": [
    365,
    136
  ],
  "1676": [
    258,
    740
  ],
  "1677": [
    564,
    525
  ],
  "1678": [
    354,
    391
  ],
  "1679": [
    275,
    151
  ],
  "1680": [
    718,
    1113
  ],
  "1681": [
    1680,
    1113
  ],
  "1682": [
    317,
    180
  ],
  "1683": [
    350,
    1116
  ],
  "1684": [
    804,
    191
  ],
  "1685": [
    305,
    184
  ],
  "1686": [
    457,
    144
  ],
  "1687": [
    620,
    448
  ],
  "1688": [
    247,
    165
  ],
  "1689": [
    1459,
    469
  ],
  "1690": [
    370,
    277
  ],
  "1691": [
    514,
    186
  ],
  "1692": [
    879,
    133
  ],
  "1693": [
    1285,
    146
  ],
  "1694": [
    1030,
    528
  ],
  "1695": [
    273,
    174
  ],
  "1696": [
    300,
    152
  ],
  "1697": [
    946,
    363
  ],
  "1698": [
    1310,
    416
  ],
  "1699": [
    596,
    724
  ],
  "1700": [
    367,
    410
  ],
  "1701": [
    260,
    168
  ],
  "1702": [
    264,
    181
  ],
  "1703": [
    281,
    269
  ],
  "1704": [
    337,
    149
  ],
  "1705": [
    364,
    131
  ],
  "1706": [
    321,
    748
  ],
  "1707": [
    473,
    322
  ],
  "1708": [
    381,
    176
  ],
  "1709": [
    325,
    990
  ],
  "1710": [
    428,
    191
  ],
  "1711": [
    441,
    162
  ],
  "1712": [
    917,
    481
  ],
  "1713": [
    926,
    1615
  ],
  "1714": [
    1677,
    331
  ],
  "1715": [
    1714,
    458
  ],
  "1716": [
    1715,
    1699
  ],
  "1717": [
    1445,
    372
  ],
  "1718": [
    342,
    540
  ],
  "1719": [
    276,
    151
  ],
  "1720": [
    419,
    146
  ],
  "1721": [
    1333,
    358
  ],
  "1722": [
    480,
    151
  ],
  "1723": [
    319,
    183
  ],
  "1724": [
    333,
    277
  ],
  "1725": [
    282,
    190
  ],
  "1726": [
    482,
    187
  ],
  "1727": [
    697,
    594
  ],
  "1728": [
    287,
    564
  ],
  "1729": [
    327,
    148
  ],
  "1730": [
    764,
    350
  ],
  "1731": [
    507,
