{
  "977": [
    247,
    138
  ],
  "741": [
    637,
    191
  ],
  "17853": [
    685,
    642
  ],
  "1887": [
    397,
    174
  ],
  "8699": [
    850,
    330
  ],
  "27466": [
    368,
    3376
  ],
  "13377": [
    3241,
    6581
  ],
  "2584": [
    442,
    152
  ],
  "8328": [
    2131,
    2615
  ],
  "26506": [
    298,
    6611
  ],
  "16155": [
    1437,
    892
  ],
  "4200": [
    410,
    153
  ],
  "12592": [
    257,
    1037
  ],
  "3683": [
    619,
    861
  ],
  "15507": [
    322,
    445
  ],
  "9969": [
    475,
    1057
  ],
  "4446": [
    257,
    414
  ],
  "30145": [
    1394,
    10543
  ],
  "25036": [
    294,
    650
  ],
  "4685": [
    362,
    184
  ],
  "21907": [
    3454,
    3454
  ],
  "15535": [
    1604,
    5622
  ],
  "19096": [
    886,
    2669
  ],
  "20258": [
    2655,
    282
  ],
  "15475": [
    576,
    1170
  ],
  "16644": [
    16493,
    15848
  ],
  "14742": [
    423,
    824
  ],
  "17033": [
    639,
    1724
  ],
  "25536": [
    876,
    3976
  ],
  "7521": [
    291,
    1060
  ],
  "21476": [
    640,
    286
  ],
  "10709": [
    251,
    1489
  ],
  "26617": [
    491,
    504
  ],
  "743": [
    415,
    185
  ],
  "8302": [
    3711,
    1778
  ],
  "3542": [
    458,
    188
  ],
  "25236": [
    4464,
    6748
  ],
  "27774": [
    1088,
    2853
  ],
  "2610": [
    426,
    177
  ],
  "17470": [
    908,
    274
  ],
  "15127": [
    1195,
    1151
  ],
  "442": [
    233,
    187
  ],
  "21971": [
    457,
    1244
  ],
  "7780": [
    291,
    408
  ],
  "18642": [
    1736,
    470
  ],
  "5827": [
    1879,
    263
  ],
  "8525": [
    3893,
    142
  ],
  "24474": [
    840,
    191
  ],
  "4962": [
    251,
    1152
  ],
  "21688": [
    399,
    399
  ],
  "8821": [
    423,
    375
  ],
  "7723": [
    328,
    1472
  ],
  "28222": [
    501,
    3125
  ],
  "12192": [
    268,
    4101
  ],
  "8473": [
    1111,
    330
  ],
  "24078": [
    387,
    1916
  ],
  "4229": [
    1111,
    542
  ],
  "937": [
    256,
    346
  ],
  "6802": [
    3741,
    1446
  ],
  "5046": [
    620,
    582
  ],
  "22010": [
    4301,
    298
  ],
  "4074": [
    761,
    353
  ],
  "26990": [
    3719,
    1373
  ],
  "5752": [
    534,
    358
  ],
  "20524": [
    2767,
    10892
  ],
  "2388": [
    497,
    508
  ],
  "1969": [
    486,
    162
  ],
  "11387": [
    729,
    614
  ],
  "2798": [
    341,
    978
  ],
  "5829": [
    291,
    984
  ],
  "3446": [
    3226,
    1157
  ],
  "28335": [
    5889,
    274
  ],
  "5232": [
    1389,
    2701
  ],
  "20184": [
    1828,
    4007
  ],
  "21506": [
    6910,
    527
  ],
  "6172": [
    396,
    1381
  ],
  "19712": [
    282,
    1042
  ],
  "2413": [
    230,
    190
  ],
  "6499": [
    511,
    6363
  ],
  "23707": [
    939,
    169
  ],
  "9143": [
    1570,
    1633
  ],
  "28105": [
    988,
    1089
  ],
  "10300": [
    1038,
    282
  ],
  "10659": [
    594,
    257
  ],
  "16420": [
    2403,
    1633
  ],
  "16922": [
    679,
    539
  ],
  "10598": [
    1835,
    1499
  ],
  "29190": [
    1129,
    2153
  ],
  "6857": [
    2217,
    282
  ],
  "29288": [
    317,
    1119
  ],
  "26420": [
    722,
    163
  ],
  "3220": [
    953,
    171
  ],
  "3437": [
    438,
    469
  ],
  "2018": [
    557,
    287
  ],
  "26449": [
    316,
    158
  ],
  "3185": [
    359,
    140
  ],
  "21018": [
    4238,
    423
  ],
  "730": [
    229,
    179
  ],
  "7963": [
    358,
    1411
  ],
  "8630": [
    634,
    4002
  ],
  "10825": [
    2764,
    1944
  ],
  "15611": [
    1643,
    300
  ],
  "16205": [
    1946,
    1946
  ],
  "19964": [
    310,
    644
  ],
  "24421": [
    562,
    1619
  ],
  "7537": [
    251,
    2288
  ],
  "14141": [
    548,
    1932
  ],
  "11247": [
    655,
    1973
  ],
  "28401": [
    290,
    1763
  ],
  "29817": [
    4222,
    4571
  ],
  "17290": [
    752,
    2025
  ],
  "15948": [
    550,
    379
  ],
  "1403": [
    281,
    134
  ],
  "2561": [
    511,
    411
  ],
  "12969": [
    893,
    892
  ],
  "12034": [
    952,
    1784
  ],
  "11458": [
    262,
    901
  ],
  "24917": [
    4976,
    9366
  ],
  "5611": [
    505,
    1294
  ],
  "20247": [
    2207,
    284
  ],
  "2989": [
    421,
    532
  ],
  "27739": [
    772,
    6185
  ],
  "6010": [
    250,
    166
  ],
  "9662": [
    484,
    256
  ],
  "4105": [
    1174,
    641
  ],
  "27030": [
    287,
    1070
  ],
  "15528": [
    1768,
    997
  ],
  "11471": [
    631,
    352
  ],
  "10367": [
    851,
    304
  ],
  "2882": [
    813,
    399
  ],
  "21143": [
    862,
    399
  ],
  "22008": [
    874,
    563
  ],
  "9778": [
    7534,
    1057
  ],
  "10779": [
    423,
    1897
  ],
  "12439": [
    355,
    167
  ],
  "28746": [
    2796,
    630
  ],
  "6748": [
    554,
    329
  ],
  "12402": [
    1336,
    794
  ],
  "15935": [
    1063,
    6309
  ],
  "7287": [
    457,
    421
  ],
  "4829": [
    931,
    3078
  ],
  "11309": [
    2450,
    995
  ],
  "16698": [
    483,
    1593
  ],
  "901": [
    426,
    162
  ],
  "18350": [
    3671,
    519
  ],
  "24577": [
    586,
    1425
  ],
  "8944": [
    622,
    274
  ],
  "7330": [
    1322,
    4938
  ],
  "28887": [
    274,
    508
  ],
  "24047": [
    6502,
    361
  ],
  "15200": [
    5466,
    887
  ],
  "19679": [
    505,
    3616
  ],
  "16157": [
    1505,
    3732
  ],
  "8099": [
    2808,
    328
  ],
  "17017": [
    291,
    2007
  ],
  "7451": [
    369,
    163
  ],
  "23477": [
    14958,
    391
  ],
  "16780": [
    312,
    131
  ],
  "1165": [
    395,
    143
  ],
  "14003": [
    1200,
    662
  ],
  "17959": [
    309,
    304
  ],
  "29883": [
    1161,
    256
  ],
  "18569": [
    1321,
    465
  ],
  "24974": [
    282,
    1092
  ],
  "21437": [
    7075,
    17023
  ],
  "11128": [
    2229,
    6680
  ],
  "841": [
    753,
    361
  ],
  "18981": [
    356,
    2286
  ],
  "4224": [
    479,
    263
  ],
  "19871": [
    284,
    957
  ],
  "15454": [
    783,
    532
  ],
  "16084": [
    256,
    1379
  ],
  "21455": [
    563,
    13755
  ],
  "20060": [
    2062,
    570
  ],
  "944": [
    293,
    160
  ],
  "4026": [
    766,
    263
  ],
  "20056": [
    465,
    796
  ],
  "13416": [
    290,
    1264
  ],
  "24609": [
    1187,
    22025
  ],
  "22127": [
    5879,
    3352
  ],
  "6240": [
    733,
    860
  ],
  "21215": [
    251,
    13570
  ],
  "10351": [
    613,
    145
  ],
  "21300": [
    21299,
    1832
  ],
  "17560": [
    325,
    129
  ],
  "9932": [
    4093,
    564
  ],
  "24773": [
    634,
    634
  ],
  "18677": [
    5116,
    1641
  ],
  "25736": [
    550,
    2626
  ],
  "20038": [
    1090,
    547
  ],
  "254": [
    228,
    189
  ],
  "256": [
    242,
    141
  ],
  "18623": [
    300,
    1004
  ],
  "18436": [
    1998,
    1128
  ],
  "12476": [
    4245,
    875
  ],
  "10694": [
    352,
    431
  ],
  "20755": [
    504,
    527
  ],
  "1067": [
    264,
    180
  ],
  "2304": [
    231,
    177
  ],
  "4725": [
    1905,
    256
  ],
  "12521": [
    648,
    8863
  ],
  "13282": [
    1621,
    1201
  ],
  "17347": [
    2827,
    2583
  ],
  "19715": [
    337,
    546
  ],
  "2705": [
    256,
    1398
  ],
  "11494": [
    681,
    1114
  ],
  "19150": [
    979,
    1932
  ],
  "11291": [
    605,
    342
  ],
  "8036": [
    299,
    710
  ],
  "26148": [
    299,
    1227
  ],
  "9208": [
    3701,
    300
  ],
  "17357": [
    2507,
    2439
  ],
  "15069": [
    392,
    1481
  ],
  "14150": [
    804,
    4333
  ],
  "21573": [
    4813,
    263
  ],
  "1378": [
    355,
    173
  ],
  "18617": [
    282,
    1595
  ],
  "26788": [
    1134,
    916
  ],
  "17165": [
    1244,
    391
  ],
  "13744": [
    781,
    843
  ],
  "20239": [
    307,
    4275
  ],
  "9002": [
    2407,
    3204
  ],
  "21772": [
    2387,
    487
  ],
  "2942": [
    413,
    137
  ],
  "6187": [
    1454,
    420
  ],
  "22549": [
    446,
    322
  ],
  "26405": [
    861,
    1023
  ],
  "6837": [
    257,
    1098
  ],
  "28647": [
    16305,
    262
  ],
  "28678": [
    4832,
    4140
  ],
  "16503": [
    1033,
    2272
  ],
  "23235": [
    1179,
    22944
  ],
  "4887": [
    402,
    905
  ],
  "27529": [
    3211,
    1975
  ],
  "3063": [
    593,
    304
  ],
  "11603": [
    2448,
    257
  ],
  "14306": [
    698,
    438
  ],
  "28275": [
    2062,
    294
  ],
  "14047": [
    861,
    353
  ],
  "16995": [
    427,
    870
  ],
  "17187": [
    539,
    1011
  ],
  "527": [
    277,
    157
  ],
  "3127": [
    492,
    133
  ],
  "14640": [
    2723,
    473
  ],
  "22167": [
    1171,
    761
  ],
  "20911": [
    20670,
    1244
  ],
  "10594": [
    1644,
    1181
  ],
  "20171": [
    504,
    850
  ],
  "28631": [
    6034,
    1870
  ],
  "20531": [
    20530,
    815
  ],
  "29677": [
    2450,
    4337
  ],
  "8057": [
    297,
    160
  ],
  "27265": [
    27264,
    4084
  ],
  "1552": [
    295,
    146
  ],
  "10327": [
    597,
    143
  ],
  "22913": [
    9164,
    762
  ],
  "4874": [
    2482,
    263
  ],
  "14042": [
    1684,
    630
  ],
  "3416": [
    322,
    576
  ],
  "24637": [
    798,
    798
  ],
  "23770": [
    13789,
    331
  ],
  "12443": [
    1582,
    531
  ],
  "13097": [
    754,
    1100
  ],
  "11306": [
    5576,
    1173
  ],
  "3525": [
    348,
    189
  ],
  "7964": [
    892,
    3436
  ],
  "14505": [
    392,
    4234
  ],
  "5805": [
    257,
    539
  ],
  "5980": [
    1167,
    508
  ],
  "21399": [
    484,
    586
  ],
  "20613": [
    4733,
    436
  ],
  "14210": [
    301,
    138
  ],
  "1782": [
    738,
    143
  ],
  "8278": [
    651,
    356
  ],
  "2232": [
    1878,
    640
  ],
  "19949": [
    291,
    889
  ],
  "29822": [
    7540,
    3451
  ],
  "16827": [
    603,
    780
  ],
  "11810": [
    291,
    980
  ],
  "9238": [
    593,
    1262
  ],
  "26973": [
    1213,
    2117
  ],
  "27685": [
    7440,
    4543
  ],
  "9085": [
    875,
    399
  ],
  "5443": [
    636,
    331
  ],
  "4355": [
    525,
    746
  ],
  "7354": [
    268,
    3929
  ],
  "8323": [
    893,
    568
  ],
  "22733": [
    2520,
    727
  ],
  "25997": [
    14683,
    14683
  ],
  "6849": [
    930,
    400
  ],
  "11885": [
    10913,
    751
  ],
  "14747": [
    2531,
    590
  ],
  "26514": [
    528,
    162
  ],
  "7107": [
    498,
    331
  ],
  "19225": [
    859,
    420
  ],
  "18265": [
    18264,
    4067
  ],
  "30085": [
    268,
    8152
  ],
  "14222": [
    251,
    920
  ],
  "29609": [
    4665,
    419
  ],
  "27994": [
    5761,
    262
  ],
  "28737": [
    2432,
    1005
  ],
  "29148": [
    268,
    6808
  ],
  "9087": [
    1126,
    142
  ],
  "12617": [
    1297,
    574
  ],
  "9410": [
    651,
    928
  ],
  "7075": [
    1006,
    158
  ],
  "16233": [
    1846,
    842
  ],
  "24835": [
    377,
    1796
  ],
  "17984": [
    1176,
    1257
  ],
  "9743": [
    391,
    1646
  ],
  "20655": [
    724,
    1505
  ],
  "12749": [
    646,
    574
  ],
  "15037": [
    800,
    1209
  ],
  "8724": [
    769,
    714
  ],
  "7115": [
    282,
    400
  ],
  "8164": [
    710,
    1882
  ],
  "15064": [
    2015,
    3358
  ],
  "6669": [
    479,
    282
  ],
  "30224": [
    257,
    2462
  ],
  "3395": [
    323,
    165
  ],
  "8571": [
    307,
    715
  ],
  "17547": [
    2041,
    257
  ],
  "24369": [
    358,
    951
  ],
  "28127": [
    3752,
    1737
  ],
  "22774": [
    3455,
    1655
  ],
  "27462": [
    257,
    603
  ],
  "14411": [
    677,
    656
  ],
  "18787": [
    1585,
    17091
  ],
  "22331": [
    759,
    330
  ],
  "27078": [
    299,
    317
  ],
  "28317": [
    5528,
    2246
  ],
  "1381": [
    281,
    186
  ],
  "4423": [
    2178,
    3503
  ],
  "7624": [
    2621,
    257
  ],
  "3811": [
    545,
    990
  ],
  "12392": [
    259,
    1161
  ],
  "2274": [
    816,
    623
  ],
  "13013": [
    2435,
    1097
  ],
  "16223": [
    10517,
    8236
  ],
  "4577": [
    1920,
    1315
  ],
  "19341": [
    251,
    801
  ],
  "21570": [
    418,
    259
  ],
  "2401": [
    585,
    161
  ],
  "23035": [
    298,
    586
  ],
  "24552": [
    291,
    2720
  ],
  "12397": [
    7094,
    7094
  ],
  "4444": [
    342,
    746
  ],
  "11434": [
    1329,
    309
  ],
  "22092": [
    2098,
    353
  ],
  "22707": [
    4591,
    8525
  ],
  "26346": [
    16961,
    314
  ],
  "10246": [
    885,
    666
  ],
  "13882": [
    2930,
    1100
  ],
  "16645": [
    557,
    2429
  ],
  "2270": [
    578,
    263
  ],
  "4911": [
    244,
    171
  ],
  "21762": [
    21761,
    21504
  ],
  "16261": [
    251,
    688
  ],
  "24993": [
    813,
    405
  ],
  "26433": [
    546,
    636
  ],
  "8129": [
    1488,
    1552
  ],
  "16372": [
    1699,
    15748
  ],
  "23807": [
    3366,
    135
  ],
  "26080": [
    4977,
    414
  ],
  "27417": [
    413,
    159
  ],
  "19743": [
    629,
    173
  ],
  "5017": [
    4214,
    793
  ],
  "22621": [
    287,
    2154
  ],
  "23949": [
    574,
    1064
  ],
  "1210": [
    465,
    1142
  ],
  "28614": [
    6319,
    1886
  ],
  "8160": [
    457,
    431
  ],
  "12017": [
    8984,
    1827
  ],
  "11969": [
    1013,
    421
  ],
  "23127": [
    1383,
    1631
  ],
  "24409": [
    911,
    563
  ],
  "8593": [
    6366,
    549
  ],
  "18546": [
    257,
    941
  ],
  "26763": [
    251,
    19674
  ],
  "22111": [
    650,
    1397
  ],
  "25642": [
    1783,
    329
  ],
  "5274": [
    1064,
    274
  ],
  "21592": [
    20891,
    405
  ],
  "26655": [
    1119,
    956
  ],
  "8777": [
    707,
    468
  ],
  "12088": [
    639,
    329
  ],
  "23729": [
    268,
    5474
  ],
  "28635": [
    707,
    1314
  ],
  "3316": [
    3000,
    3287
  ],
  "6733": [
    3350,
    4615
  ],
  "17447": [
    251,
    1419
  ],
  "9988": [
    427,
    2911
  ],
  "24550": [
    5779,
    5807
  ],
  "671": [
    254,
    191
  ],
  "16784": [
    392,
    2465
  ],
  "2384": [
    409,
    165
  ],
  "7422": [
    1211,
    3460
  ],
  "25300": [
    5597,
    14018
  ],
  "22310": [
    22309,
    168
  ],
  "23884": [
    15875,
    274
  ],
  "5390": [
    376,
    408
  ],
  "10729": [
    1262,
    474
  ],
  "12940": [
    328,
    10491
  ],
  "12033": [
    1303,
    298
  ],
  "15461": [
    1926,
    1569
  ],
  "19162": [
    483,
    3487
  ],
  "19998": [
    420,
    969
  ],
  "12508": [
    1352,
    907
  ],
  "20016": [
    310,
    631
  ],
  "25976": [
    414,
    4022
  ],
  "29209": [
    761,
    967
  ],
  "22408": [
    1396,
    1809
  ],
  "10746": [
    2793,
    361
  ],
  "6178": [
    256,
    956
  ],
  "23975": [
    16041,
    2016
  ],
  "25614": [
    322,
    363
  ],
  "3530": [
    508,
    485
  ],
  "22340": [
    3754,
    1342
  ],
  "25505": [
    1199,
    659
  ],
  "9318": [
    411,
    1874
  ],
  "3195": [
    365,
    162
  ],
  "24692": [
    699,
    757
  ],
  "7623": [
    1090,
    368
  ],
  "3517": [
    256,
    904
  ],
  "23744": [
    2893,
    18566
  ],
  "27403": [
    3594,
    951
  ],
  "9791": [
    1249,
    532
  ],
  "24612": [
    535,
    1332
  ],
  "537": [
    230,
    181
  ],
  "17472": [
    1505,
    1630
  ],
  "4510": [
    313,
    171
  ],
  "29348": [
    328,
    1855
  ],
  "7259": [
    681,
    6942
  ],
  "13573": [
    724,
    560
  ],
  "20702": [
    3755,
    331
  ],
  "15725": [
    1291,
    7711
  ],
  "17955": [
    5239,
    287
  ],
  "15246": [
    1617,
    2981
  ],
  "13566": [
    872,
    291
  ],
  "17619": [
    8383,
    1533
  ],
  "24447": [
    945,
    342
  ],
  "13516": [
    6128,
    564
  ],
  "3769": [
    2175,
    3713
  ],
  "20601": [
    464,
    171
  ],
  "12866": [
    394,
    143
  ],
  "15360": [
    2336,
    330
  ],
  "22858": [
    12635,
    251
  ],
  "7676": [
    545,
    1752
  ],
  "29569": [
    583,
    2153
  ],
  "26045": [
    608,
    603
  ],
  "21206": [
    1446,
    455
  ],
  "6210": [
    2147,
    701
  ],
  "23638": [
    257,
    6036
  ],
  "19196": [
    417,
    134
  ],
  "25980": [
    375,
    766
  ],
  "6811": [
    427,
    1373
  ],
  "25978": [
    418,
    1655
  ],
  "4755": [
    1691,
    1174
  ],
  "22299": [
    908,
    1438
  ],
  "1420": [
    437,
    170
  ],
  "12668": [
    259,
    317
  ],
  "17254": [
    391,
    440
  ],
  "8717": [
    1459,
    322
  ],
  "26980": [
    479,
    3326
  ],
  "3279": [
    963,
    140
  ],
  "4400": [
    2829,
    1507
  ],
  "19099": [
    626,
    402
  ],
  "30176": [
    685,
    8463
  ],
  "8506": [
    284,
    2122
  ],
  "8066": [
    529,
    180
  ],
  "20694": [
    428,
    9444
  ],
  "27550": [
    282,
    429
  ],
  "12997": [
    268,
    5835
  ],
  "4714": [
    1939,
    1626
  ],
  "23523": [
    3642,
    16106
  ],
  "15438": [
    708,
    498
  ],
  "24293": [
    329,
    1025
  ],
  "2135": [
    775,
    659
  ],
  "16405": [
    1383,
    527
  ],
  "17621": [
    1157,
    2833
  ],
  "16927": [
    16926,
    2515
  ],
  "12559": [
    10340,
    12004
  ],
  "15365": [
    3624,
    3144
  ],
  "26549": [
    287,
    1192
  ],
  "19876": [
    494,
    1507
  ],
  "24760": [
    3211,
    4351
  ],
  "19448": [
    18893,
    813
  ],
  "26610": [
    286,
    1099
  ],
  "28985": [
    519,
    485
  ],
  "6413": [
    1062,
    3112
  ],
  "26081": [
    3024,
    274
  ],
  "26351": [
    1124,
    440
  ],
  "27343": [
    5733,
    262
  ],
  "20997": [
    2514,
    1590
  ],
  "28867": [
    304,
    6136
  ],
  "25946": [
    1602,
    1653
  ],
  "4524": [
    3693,
    153
  ],
  "28404": [
    15438,
    1028
  ],
  "27231": [
    379,
    857
  ],
  "6553": [
    319,
    141
  ],
  "21663": [
    475,
    1673
  ],
  "14319": [
    1437,
    1174
  ],
  "29324": [
    476,
    916
  ],
  "15607": [
    517,
    146
  ],
  "18487": [
    4552,
    3541
  ],
  "9069": [
    1910,
    614
  ],
  "7883": [
    358,
    5906
  ],
  "7426": [
    615,
    187
  ],
  "7894": [
    488,
    773
  ],
  "11548": [
    960,
    608
  ],
  "24012": [
    561,
    1628
  ],
  "17299": [
    461,
    146
  ],
  "15384": [
    337,
    384
  ],
  "6439": [
    2337,
    1207
  ],
  "8471": [
    2902,
    405
  ],
  "13428": [
    2219,
    1925
  ],
  "14907": [
    2083,
    1466
  ],
  "19537": [
    310,
    843
  ],
  "17617": [
    8862,
    9436
  ],
  "10678": [
    512,
    2364
  ],
  "19647": [
    457,
    563
  ],
  "7039": [
    307,
    330
  ],
  "23969": [
    310,
    2177
  ],
  "25373": [
    391,
    992
  ],
  "12763": [
    1468,
    262
  ],
  "22094": [
    687,
    322
  ],
  "19686": [
    535,
    497
  ],
  "26101": [
    817,
    12190
  ],
  "8344": [
    1133,
    150
  ],
  "6070": [
    3068,
    414
  ],
  "16830": [
    2328,
    470
  ],
  "3424": [
    429,
    400
  ],
  "29928": [
    5258,
    2819
  ],
  "26995": [
    1352,
    1057
  ],
  "1253": [
    720,
    318
  ],
  "9863": [
    1815,
    171
  ],
  "10289": [
    310,
    1518
  ],
  "26804": [
    1861,
    1546
  ],
  "290": [
    254,
    160
  ],
  "7746": [
    651,
    803
  ],
  "10496": [
    1470,
    187
  ],
  "21887": [
    4830,
    259
  ],
  "27248": [
    2197,
    9108
  ],
  "20074": [
    3056,
    4627
  ],
  "29546": [
    480,
    1049
  ],
  "18686": [
    816,
    282
  ],
  "20360": [
    662,
    780
  ],
  "24865": [
    752,
    1227
  ],
  "16993": [
    626,
    724
  ],
  "3937": [
    341,
    1068
  ],
  "16907": [
    576,
    257
  ],
  "5248": [
    312,
    155
  ],
  "19307": [
    3755,
    286
  ],
  "11493": [
    1660,
    381
  ],
  "23374": [
    1264,
    1132
  ],
  "28107": [
    3867,
    287
  ],
  "1037": [
    423,
    259
  ],
  "10948": [
    586,
    346
  ],
  "1211": [
    806,
    845
  ],
  "28071": [
    290,
    2235
  ],
  "602": [
    444,
    137
  ],
  "8998": [
    8949,
    850
  ],
  "16606": [
    299,
    2963
  ],
  "17546": [
    1219,
    2227
  ],
  "20144": [
    421,
    1346
  ],
  "2655": [
    589,
    399
  ],
  "17874": [
    346,
    2539
  ],
  "13884": [
    815,
    799
  ],
  "15093": [
    290,
    356
  ],
  "6233": [
    1353,
    967
  ],
  "6666": [
    4506,
    6482
  ],
  "15066": [
    402,
    685
  ],
  "17136": [
    4566,
    2910
  ],
  "19735": [
    391,
    1491
  ],
  "24119": [
    5450,
    487
  ],
  "5308": [
    294,
    290
  ],
  "19560": [
    6910,
    5130
  ],
  "27075": [
    2807,
    12466
  ],
  "24394": [
    1107,
    527
  ],
  "3705": [
    900,
    422
  ],
  "26937": [
    268,
    4968
  ],
  "27900": [
    966,
    750
  ],
  "21925": [
    1246,
    128
  ],
  "25698": [
    2121,
    1118
  ],
  "16875": [
    457,
    708
  ],
  "1672": [
    866,
    160
  ],
  "8481": [
    709,
    468
  ],
  "13042": [
    3932,
    828
  ],
  "15830": [
    2840,
    696
  ],
  "7776": [
    945,
    263
  ],
  "10438": [
    1711,
    294
  ],
  "10157": [
    1937,
    1108
  ],
  "27218": [
    2743,
    504
  ],
  "25043": [
    8538,
    1097
  ],
  "8247": [
    825,
    683
  ],
  "1888": [
    406,
    136
  ],
  "3304": [
    398,
    329
  ],
  "10040": [
    835,
    1585
  ],
  "21571": [
    1569,
    294
  ],
  "24297": [
    1803,
    776
  ],
  "25299": [
    563,
    11076
  ],
  "770": [
    509,
    138
  ],
  "9452": [
    2330,
    3396
  ],
  "27668": [
    1195,
    2761
  ],
  "30208": [
    18556,
    25098
  ],
  "22779": [
    835,
    624
  ],
  "7558": [
    573,
    639
  ],
  "20566": [
    2173,
    298
  ],
  "19639": [
    3012,
    19435
  ],
  "1087": [
    392,
    342
  ],
  "16291": [
    256,
    2724
  ],
  "17417": [
    617,
    5690
  ],
  "5083": [
    1586,
    294
  ],
  "23271": [
    1769,
    1033
  ],
  "6939": [
    1585,
    2728
  ],
  "18255": [
    426,
    172
  ],
  "6214": [
    5935,
    550
  ],
  "25008": [
    2092,
    630
  ],
  "30021": [
    2026,
    9381
  ],
  "7575": [
    291,
    429
  ],
  "18645": [
    636,
    1071
  ],
  "8114": [
    1564,
    274
  ],
  "10454": [
    1011,
    6606
  ],
  "17743": [
    1470,
    186
  ],
  "23206": [
    767,
    142
  ],
  "20597": [
    329,
    1978
  ],
  "3050": [
    248,
    158
  ],
  "5239": [
    688,
    542
  ],
  "22166": [
    758,
    740
  ],
  "6194": [
    1542,
    422
  ],
  "3752": [
    358,
    1829
  ],
  "18770": [
    773,
    4648
  ],
  "23654": [
    287,
    3632
  ],
  "24295": [
    859,
    2587
  ],
  "24940": [
    1382,
    2107
  ],
  "20975": [
    484,
    604
  ],
  "26007": [
    805,
    418
  ],
  "27279": [
    407,
    3151
  ],
  "18613": [
    1416,
    298
  ],
  "27699": [
    1203,
    175
  ],
  "2649": [
    1772,
    1824
  ],
  "4213": [
    1351,
    381
  ],
  "12247": [
    3264,
    1634
  ],
  "10715": [
    256,
    2286
  ],
  "29454": [
    26153,
    2703
  ],
  "9076": [
    700,
    183
  ],
  "29979": [
    1675,
    20729
  ],
  "22292": [
    1215,
    419
  ],
  "938": [
    250,
    145
  ],
  "3617": [
    488,
    859
  ],
  "4640": [
    298,
    532
  ],
  "9703": [
    3200,
    726
  ],
  "24233": [
    491,
    810
  ],
  "3604": [
    268,
    1341
  ],
  "5412": [
    1052,
    583
  ],
  "3149": [
    1303,
    466
  ],
  "11072": [
    573,
    1220
  ],
  "10982": [
    3254,
    7463
  ],
  "12022": [
    2888,
    294
  ],
  "15901": [
    301,
    188
  ],
  "28146": [
    2583,
    534
  ],
  "14650": [
    1961,
    1546
  ],
  "22589": [
    5458,
    1168
  ],
  "19147": [
    3483,
    868
  ],
  "10150": [
    400,
    2051
  ],
  "15671": [
    411,
    579
  ],
  "26296": [
    15405,
    12153
  ],
  "8290": [
    1661,
    399
  ],
  "26705": [
    2455,
    11222
  ],
  "2046": [
    330,
    263
  ],
  "18022": [
    17417,
    10912
  ],
  "22157": [
    1069,
    815
  ],
  "14646": [
    1538,
    353
  ],
  "7215": [
    1613,
    470
  ],
  "12278": [
    1977,
    828
  ],
  "10653": [
    803,
    317
  ],
  "5869": [
    302,
    182
  ],
  "478": [
    244,
    140
  ],
  "4155": [
    470,
    2866
  ],
  "14944": [
    2376,
    5114
  ],
  "26487": [
    2857,
    2880
  ],
  "22547": [
    274,
    307
  ],
  "16062": [
    547,
    505
  ],
  "6774": [
    336,
    1461
  ],
  "10713": [
    1099,
    1036
  ],
  "10870": [
    701,
    829
  ],
  "14458": [
    3728,
    419
  ],
  "1723": [
    310,
    367
  ],
  "10350": [
    431,
    379
  ],
  "28724": [
    582,
    416
  ],
  "22062": [
    2276,
    2503
  ],
  "13670": [
    709,
    10081
  ],
  "29115": [
    1457,
    1615
  ],
  "8188": [
    609,
    274
  ],
  "18796": [
    402,
    376
  ],
  "10290": [
    755,
    172
  ],
  "10274": [
    7897,
    6026
  ],
  "13807": [
    1528,
    1371
  ],
  "4604": [
    1060,
    322
  ],
  "27396": [
    834,
    7053
  ],
  "8668": [
    761,
    814
  ],
  "23705": [
    2875,
    1469
  ],
  "6925": [
    352,
    1044
  ],
  "13420": [
    392,
    679
  ],
  "1429": [
    334,
    190
  ],
  "2905": [
    300,
    643
  ],
  "14758": [
    2238,
    1064
  ],
  "26104": [
    240,
    142
  ],
  "2265": [
    302,
    156
  ],
  "1355": [
    612,
    1338
  ],
  "1874": [
    369,
    154
  ],
  "7473": [
    256,
    875
  ],
  "12374": [
    932,
    1773
  ],
  "8237": [
    1866,
    848
  ],
  "3527": [
    371,
    639
  ],
  "1971": [
    309,
    257
  ],
  "6039": [
    527,
    307
  ],
  "12917": [
    8265,
    1632
  ],
  "22575": [
    15900,
    488
  ],
  "23503": [
    684,
    11725
  ],
  "8692": [
    515,
    1082
  ],
  "29829": [
    586,
    501
  ],
  "21565": [
    859,
    1531
  ],
  "17128": [
    1378,
    2500
  ],
  "11178": [
    274,
    892
  ],
  "13359": [
    728,
    544
  ],
  "1800": [
    354,
    166
  ],
  "28372": [
    654,
    498
  ],
  "6910": [
    398,
    1526
  ],
  "28195": [
    969,
    2137
  ],
  "19409": [
    314,
    1588
  ],
  "21495": [
    3651,
    476
  ],
  "23385": [
    1721,
    300
  ],
  "25112": [
    654,
    2827
  ],
  "3456": [
    251,
    468
  ],
  "9229": [
    8937,
    4956
  ],
  "11301": [
    422,
    304
  ],
  "17077": [
    6344,
    6082
  ],
  "21599": [
    1002,
    11097
  ],
  "21698": [
    317,
    1512
  ],
  "2260": [
    2134,
    634
  ],
  "5830": [
    344,
    144
  ],
  "22864": [
    429,
    766
  ],
  "25306": [
    2098,
    1366
  ],
  "16753": [
    5332,
    14874
  ],
  "3194": [
    1283,
    129
  ],
  "18556": [
    979,
    1426
  ],
  "21201": [
    251,
    923
  ],
  "23047": [
    1687,
    752
  ],
  "29750": [
    3130,
    1158
  ],
  "3091": [
    283,
    145
  ],
  "1467": [
    253,
    148
  ],
  "23341": [
    593,
    379
  ],
  "26671": [
    2557,
    20495
  ],
  "15308": [
    1965,
    352
  ],
  "2054": [
    371,
    286
  ],
  "30048": [
    309,
    535
  ],
  "21304": [
    317,
    1452
  ],
  "18312": [
    3002,
    2173
  ],
  "23092": [
    714,
    512
  ],
  "28535": [
    5200,
    794
  ],
  "19065": [
    459,
    1223
  ],
  "29873": [
    833,
    8788
  ],
  "3216": [
    283,
    136
  ],
  "17096": [
    1394,
    1576
  ],
  "390": [
    232,
    174
  ],
  "13543": [
    251,
    3930
  ],
  "14929": [
    1008,
    317
  ],
  "15385": [
    285,
    167
  ],
  "29949": [
    7846,
    15175
  ],
  "5478": [
    607,
    391
  ],
  "24508": [
    519,
    1506
  ],
  "9188": [
    755,
    169
  ],
  "4919": [
    1099,
    298
  ],
  "11894": [
    4469,
    2000
  ],
  "27132": [
    4144,
    752
  ],
  "29831": [
    8136,
    18915
  ],
  "9009": [
    443,
    160
  ],
  "28488": [
    609,
    531
  ],
  "28533": [
    268,
    484
  ],
  "3152": [
    1082,
    263
  ],
  "10950": [
    886,
    2139
  ],
  "17898": [
    1119,
    468
  ],
  "10770": [
    703,
    358
  ],
  "19280": [
    387,
    501
  ],
  "21339": [
    1371,
    5593
  ],
  "26316": [
    605,
    624
  ],
  "5589": [
    864,
    137
  ],
  "14088": [
    736,
    286
  ],
  "2518": [
    284,
    1743
  ],
  "23624": [
    251,
    6580
  ],
  "9075": [
    1451,
    1752
  ],
  "6740": [
    294,
    544
  ],
  "7928": [
    2047,
    874
  ],
  "20792": [
    307,
    1427
  ],
  "24191": [
    1248,
    1647
  ],
  "11701": [
    284,
    1610
  ],
  "16056": [
    268,
    3036
  ],
  "14537": [
    488,
    1159
  ],
  "24752": [
    1441,
    399
  ],
  "20419": [
    935,
    1383
  ],
  "1322": [
    840,
    139
  ],
  "4585": [
    538,
    342
  ],
  "13597": [
    1594,
    1483
  ],
  "16969": [
    1498,
    607
  ],
  "17557": [
    554,
    5139
  ],
  "23823": [
    973,
    17028
  ],
  "9865": [
    582,
    2087
  ],
  "3966": [
    379,
    382
  ],
  "12170": [
    287,
    881
  ],
  "25256": [
    490,
    274
  ],
  "8295": [
    2197,
    746
  ],
  "10846": [
    479,
    286
  ],
  "6506": [
    1140,
    298
  ],
  "18035": [
    573,
    656
  ],
  "9525": [
    1655,
    1412
  ],
  "15341": [
    763,
    966
  ],
  "16385": [
    1218,
    548
  ],
  "27074": [
    27073,
    1506
  ],
  "23184": [
    2748,
    314
  ],
  "25276": [
    341,
    1421
  ],
  "27145": [
    1179,
    756
  ],
  "25068": [
    416,
    4379
  ],
  "9841": [
    707,
    1867
  ],
  "23674": [
    10941,
    274
  ],
  "17623": [
    2997,
    8730
  ],
  "22260": [
    5295,
    1164
  ],
  "8216": [
    304,
    636
  ],
  "693": [
    349,
    145
  ],
  "17886": [
    753,
    330
  ],
  "27991": [
    360,
    188
  ],
  "6034": [
    438,
    988
  ],
  "13433": [
    926,
    429
  ],
  "19939": [
    3466,
    918
  ],
  "28145": [
    996,
    1592
  ],
  "8637": [
    2843,
    521
  ],
  "25819": [
    2827,
    3159
  ],
  "388": [
    231,
    142
  ],
  "10937": [
    695,
    189
  ],
  "1283": [
    229,
    171
  ],
  "19110": [
    1644,
    375
  ],
  "1531": [
    263,
    896
  ],
  "14419": [
    955,
    381
  ],
  "28370": [
    328,
    9227
  ],
  "711": [
    667,
    566
  ],
  "10595": [
    726,
    263
  ],
  "6005": [
    1013,
    298
  ],
  "23133": [
    573,
    10580
  ],
  "25992": [
    9633,
    565
  ],
  "4579": [
    645,
    2287
  ],
  "15564": [
    474,
    576
  ],
  "23731": [
    1655,
    2610
  ],
  "24313": [
    982,
    5218
  ],
  "8071": [
    459,
    931
  ],
  "19739": [
    505,
    658
  ],
  "1088": [
    365,
    131
  ],
  "3556": [
    583,
    3186
  ],
  "14137": [
    318,
    2711
  ],
  "22357": [
    836,
    1135
  ],
  "27905": [
    2608,
    497
  ],
  "6160": [
    6149,
    1864
  ],
  "389": [
    245,
    166
  ],
  "8372": [
    1527,
    710
  ],
  "17135": [
    6362,
    262
  ],
  "25755": [
    294,
    699
  ],
  "26248": [
    1532,
    257
  ],
  "17463": [
    9884,
    2825
  ],
  "13155": [
    4510,
    2051
  ],
  "2650": [
    769,
    411
  ],
  "17854": [
    1197,
    1426
  ],
  "18224": [
    2428,
    322
  ],
  "14384": [
    3060,
    476
  ],
  "17376": [
    593,
    2060
  ],
  "9568": [
    465,
    7423
  ],
  "11339": [
    515,
    674
  ],
  "21602": [
    2998,
    287
  ],
  "9174": [
    618,
    2694
  ],
  "1809": [
    648,
    352
  ],
  "12658": [
    879,
    658
  ],
  "15698": [
    1488,
    298
  ],
  "11466": [
    331,
    945
  ],
  "17390": [
    1762,
    1419
  ],
  "3787": [
    321,
    189
  ],
  "22923": [
    3579,
    1729
  ],
  "10651": [
    368,
    956
  ],
  "6871": [
    256,
    4074
  ],
  "9866": [
    562,
    2662
  ],
  "1193": [
    272,
    131
  ],
  "26166": [
    22886,
    3729
  ],
  "28123": [
    3267,
    9039
  ],
  "16870": [
    1448,
    4361
  ],
  "3388": [
    326,
    129
  ],
  "20727": [
    6765,
    286
  ],
  "20781": [
    11115,
    2048
  ],
  "25752": [
    2042,
    4055
  ],
  "25953": [
    290,
    318
  ],
  "17381": [
    650,
    459
  ],
  "13106": [
    2782,
    294
  ],
  "22252": [
    1009,
    257
  ],
  "17837": [
    491,
    2341
  ],
  "25985": [
    287,
    5619
  ],
  "4538": [
    377,
    402
  ],
  "10258": [
    2699,
    1886
  ],
  "23226": [
    1930,
    3154
  ],
  "29142": [
    2448,
    3428
  ],
  "1688": [
    293,
    158
  ],
  "6027": [
    226,
    150
  ],
  "12432": [
    1145,
    377
  ],
  "13920": [
    256,
    3561
  ],
  "12551": [
    822,
    705
  ],
  "14223": [
    4144,
    391
  ],
  "19636": [
    3082,
    642
  ],
  "6565": [
    549,
    570
  ],
  "16041": [
    2433,
    251
  ],
  "18226": [
    1027,
    286
  ],
  "19478": [
    675,
    511
  ],
  "25568": [
    2650,
    524
  ],
  "27399": [
    324,
    138
  ],
  "24132": [
    921,
    3853
  ],
  "8843": [
    632,
    165
  ],
  "10683": [
    4244,
    3998
  ],
  "10061": [
    783,
    792
  ],
  "21104": [
    4222,
    6288
  ],
  "19060": [
    599,
    309
  ],
  "18523": [
    251,
    624
  ],
  "27998": [
    13303,
    1882
  ],
  "3977": [
    1008,
    549
  ],
  "14683": [
    347,
    132
  ],
  "6936": [
    485,
    2021
  ],
  "7236": [
    336,
    2177
  ],
  "6974": [
    575,
    1070
  ],
  "19861": [
    9015,
    2868
  ],
  "723": [
    229,
    152
  ],
  "23020": [
    4104,
    1131
  ],
  "24391": [
    1060,
    2009
  ],
  "5656": [
    805,
    1855
  ],
  "22509": [
    3374,
    263
  ],
  "9651": [
    352,
    1810
  ],
  "19032": [
    1506,
    552
  ],
  "29406": [
    9749,
    1555
  ],
  "17444": [
    291,
    2591
  ],
  "4700": [
    437,
    179
  ],
  "5692": [
    3170,
    1168
  ],
  "3789": [
    287,
    387
  ],
  "6723": [
    720,
    1225
  ],
  "11561": [
    524,
    1102
  ],
  "14966": [
    1573,
    622
  ],
  "9166": [
    528,
    164
  ],
  "17578": [
    714,
    590
  ],
  "1851": [
    953,
    131
  ],
  "19077": [
    777,
    1110
  ],
  "19515": [
    579,
    1193
  ],
  "23730": [
    19613,
    1212
  ],
  "7348": [
    2087,
    304
  ],
  "8564": [
    2133,
    847
  ],
  "15715": [
    291,
    13890
  ],
  "26914": [
    1346,
    466
  ],
  "6543": [
    6485,
    1650
  ],
  "27431": [
    525,
    512
  ],
  "11600": [
    5265,
    2300
  ],
  "20151": [
    1508,
    501
  ],
  "22503": [
    1807,
    1220
  ],
  "17205": [
    983,
    920
  ],
  "22006": [
    310,
    3859
  ],
  "22794": [
    1678,
    1502
  ],
  "5519": [
    642,
    2535
  ],
  "13267": [
    619,
    563
  ],
  "4581": [
    904,
    485
  ],
  "12677": [
    256,
    521
  ],
  "25472": [
    1677,
    681
  ],
  "17792": [
    8286,
    291
  ],
  "8096": [
    291,
    1430
  ],
  "19654": [
    7052,
    1556
  ],
  "7245": [
    403,
    171
  ],
  "22138": [
    263,
    686
  ],
  "22723": [
    17488,
    11421
  ],
  "20829": [
    1617,
    845
  ],
  "16377": [
    2063,
    599
  ],
  "16688": [
    2778,
    1950
  ],
  "10817": [
    411,
    1554
  ],
  "8827": [
    538,
    746
  ],
  "14122": [
    4680,
    300
  ],
  "16939": [
    3274,
    2368
  ],
  "30116": [
    737,
    1591
  ],
  "25902": [
    1299,
    304
  ],
  "5259": [
    1128,
    2069
  ],
  "27290": [
    251,
    1731
  ],
  "22051": [
    2122,
    4963
  ],
  "25403": [
    983,
    674
  ],
  "23912": [
    2385,
    938
  ],
  "11708": [
    917,
    917
  ],
  "28234": [
    2274,
    1112
  ],
  "18893": [
    1675,
    346
  ],
  "9423": [
    1378,
    5806
  ],
  "21672": [
    696,
    3805
  ],
  "7783": [
    473,
    257
  ],
  "15363": [
    1696,
    822
  ],
  "16322": [
    1403,
    2289
  ],
  "4274": [
    1085,
    300
  ],
  "5213": [
    317,
    544
  ],
  "6996": [
    496,
    149
  ],
  "25751": [
    3999,
    257
  ],
  "3507": [
    578,
    251
  ],
  "24055": [
    5568,
    901
  ],
  "8250": [
    8039,
    2133
  ],
  "17255": [
    1459,
    263
  ],
  "27970": [
    2796,
    607
  ],
  "10741": [
    423,
    1608
  ],
  "18242": [
    1813,
    331
  ],
  "19740": [
    328,
    1007
  ],
  "2785": [
    251,
    1054
  ],
  "22578": [
    3333,
    2177
  ],
  "19830": [
    268,
    841
  ],
  "25595": [
    1502,
    379
  ],
  "16148": [
    3783,
    480
  ],
  "26587": [
    804,
    1549
  ],
  "25729": [
    693,
    7119
  ],
  "9385": [
    8955,
    946
  ],
  "24067": [
    1169,
    680
  ],
  "20498": [
    9791,
    274
  ],
  "5389": [
    783,
    5086
  ],
  "8219": [
    7237,
    512
  ],
  "2376": [
    359,
    159
  ],
  "3272": [
    584,
    168
  ],
  "12550": [
    3164,
    2425
  ],
  "12287": [
    554,
    684
  ],
  "17614": [
    1478,
    4452
  ],
  "2230": [
    264,
    169
  ],
  "859": [
    327,
    151
  ],
  "29788": [
    892,
    465
  ],
  "3831": [
    635,
    282
  ],
  "5318": [
    693,
    532
  ],
  "8009": [
    256,
    761
  ],
  "4556": [
    579,
    420
  ],
  "18384": [
    764,
    5315
  ],
  "12111": [
    5264,
    5264
  ],
  "25397": [
    643,
    708
  ],
  "20487": [
    405,
    1514
  ],
  "21715": [
    13046,
    451
  ],
  "11127": [
    766,
    282
  ],
  "24660": [
    6298,
    10668
  ],
  "13096": [
    371,
    291
  ],
  "26396": [
    2005,
    336
  ],
  "8380": [
    602,
    1422
  ],
  "4104": [
    423,
    582
  ],
  "6151": [
    381,
    470
  ],
  "7341": [
    480,
    490
  ],
  "16571": [
    16297,
    1614
  ],
  "25954": [
    508,
    3615
  ],
  "6215": [
    538,
    1310
  ],
  "22631": [
    422,
    1080
  ],
  "20552": [
    849,
    1220
  ],
  "27056": [
    5597,
    2449
  ],
  "26155": [
    2468,
    4599
  ],
  "1018": [
    338,
    184
  ],
  "1590": [
    359,
    146
  ],
  "18612": [
    1080,
    263
  ],
  "11627": [
    1830,
    304
  ],
  "22208": [
    1289,
    467
  ],
  "5283": [
    4820,
    1770
  ],
  "20636": [
    2126,
    304
  ],
  "23007": [
    570,
    436
  ],
  "17536": [
    6317,
    6317
  ],
  "19450": [
    1015,
    1273
  ],
  "8523": [
    8499,
    996
  ],
  "22924": [
    411,
    684
  ],
  "4922": [
    1176,
    263
  ],
  "22952": [
    22422,
    18412
  ],
  "7634": [
    884,
    1898
  ],
  "25864": [
    714,
    262
  ],
  "19791": [
    818,
    257
  ],
  "8039": [
    1669,
    405
  ],
  "9458": [
    4672,
    942
  ],
  "11462": [
    251,
    788
  ],
  "19607": [
    1503,
    800
  ],
  "20140": [
    650,
    400
  ],
  "29910": [
    2012,
    5271
  ],
  "22128": [
    9555,
    18721
  ],
  "21355": [
    1092,
    7067
  ],
  "3945": [
    251,
    1202
  ],
  "28901": [
    287,
    604
  ],
  "9867": [
    3969,
    533
  ],
  "2562": [
    288,
    161
  ],
  "734": [
    279,
    133
  ],
  "9359": [
    603,
    257
  ],
  "14043": [
    268,
    3052
  ],
  "1457": [
    268,
    561
  ],
  "10677": [
    411,
    823
  ],
  "3820": [
    275,
    143
  ],
  "11428": [
    676,
    146
  ],
  "20513": [
    1424,
    1344
  ],
  "6540": [
    257,
    1575
  ],
  "13668": [
    445,
    1969
  ],
  "5567": [
    374,
    132
  ],
  "29076": [
    3292,
    555
  ],
  "9962": [
    784,
    7287
  ],
  "20921": [
    1172,
    1855
  ],
  "13017": [
    2769,
    133
  ],
  "9750": [
    766,
    531
  ],
  "15907": [
    4157,
    3780
  ],
  "19632": [
    392,
    473
  ],
  "24598": [
    4367,
    7711
  ],
  "24854": [
    464,
    128
  ],
  "27022": [
    27021,
    941
  ],
  "3494": [
    2090,
    2090
  ],
  "5216": [
    251,
    775
  ],
  "10578": [
    1669,
    3883
  ],
  "20378": [
    20377,
    819
  ],
  "28285": [
    512,
    18239
  ],
  "22171": [
    1171,
    578
  ],
  "14449": [
    688,
    346
  ],
  "4868": [
    4609,
    1767
  ],
  "4765": [
    1984,
    4617
  ],
  "5595": [
    404,
    181
  ],
  "1199": [
    672,
    153
  ],
  "8156": [
    547,
    1735
  ],
  "1098": [
    307,
    527
  ],
  "18131": [
    655,
    563
  ],
  "20922": [
    1290,
    290
  ],
  "25760": [
    2703,
    274
  ],
  "25091": [
    13203,
    450
  ],
  "25781": [
    893,
    3598
  ],
  "11402": [
    483,
    605
  ],
  "18443": [
    3082,
    328
  ],
  "27317": [
    2293,
    379
  ],
  "4563": [
    1027,
    322
  ],
  "20188": [
    268,
    3259
  ],
  "27320": [
    626,
    17987
  ],
  "28834": [
    1088,
    25545
  ],
  "5320": [
    318,
    1535
  ],
  "17181": [
    1209,
    1209
  ],
  "24465": [
    642,
    4592
  ],
  "25975": [
    5019,
    287
  ],
  "10080": [
    411,
    732
  ],
  "30020": [
    2200,
    892
  ],
  "17843": [
    1861,
    304
  ],
  "1431": [
    231,
    163
  ],
  "16145": [
    1190,
    405
  ],
  "2423": [
    486,
    140
  ],
  "14007": [
    452,
    146
  ],
  "29420": [
    290,
    3202
  ],
  "10365": [
    595,
    163
  ],
  "24239": [
    634,
    516
  ],
  "12465": [
    697,
    154
  ],
  "30210": [
    3783,
    19274
  ],
  "12622": [
    554,
    256
  ],
  "9437": [
    387,
    304
  ],
  "16225": [
    747,
    641
  ],
  "26734": [
    10269,
    318
  ],
  "21064": [
    3161,
    1116
  ],
  "19749": [
    9006,
    4397
  ],
  "9940": [
    559,
    440
  ],
  "25528": [
    472,
    299
  ],
  "30060": [
    1277,
    309
  ],
  "14101": [
    546,
    291
  ],
  "674": [
    270,
    165
  ],
  "8274": [
    1661,
    814
  ],
  "22571": [
    1247,
    453
  ],
  "24682": [
    405,
    813
  ],
  "4420": [
    1956,
    1108
  ],
  "14367": [
    377,
    607
  ],
  "22141": [
    793,
    1101
  ],
  "26747": [
    639,
    422
  ],
  "10737": [
    4248,
    4248
  ],
  "27578": [
    1796,
    1522
  ],
  "29799": [
    960,
    729
  ],
  "2557": [
    1116,
    1116
  ],
  "6206": [
    407,
    309
  ],
  "7413": [
    940,
    1791
  ],
  "22401": [
    5045,
    11338
  ],
  "1661": [
    503,
    186
  ],
  "15693": [
    937,
    290
  ],
  "28397": [
    1224,
    919
  ],
  "22170": [
    8629,
    440
  ],
  "30174": [
    1002,
    1145
  ],
  "2387": [
    807,
    353
  ],
  "12924": [
    268,
    1022
  ],
  "15082": [
    1336,
    4165
  ],
  "2978": [
    1053,
    2397
  ],
  "15701": [
    1436,
    942
  ],
  "27531": [
    310,
    504
  ],
  "17281": [
    2173,
    13238
  ],
  "24030": [
    682,
    1565
  ],
  "7603": [
    392,
    756
  ],
  "27789": [
    2169,
    4131
  ],
  "3117": [
    278,
    145
  ],
  "5338": [
    837,
    607
  ],
  "20507": [
    1903,
    783
  ],
  "20522": [
    317,
    2452
  ],
  "3228": [
    419,
    287
  ],
  "9139": [
    2219,
    300
  ],
  "5765": [
    1351,
    4535
  ],
  "19357": [
    479,
    1561
  ],
  "21659": [
    15856,
    257
  ],
  "18588": [
    1490,
    474
  ],
  "30207": [
    1253,
    2930
  ],
  "12183": [
    1727,
    4065
  ],
  "8868": [
    510,
    666
  ],
  "18269": [
    1448,
    1799
  ],
  "17532": [
    421,
    1048
  ],
  "20253": [
    375,
    607
  ],
  "4978": [
    368,
    1746
  ],
  "24994": [
    778,
    375
  ],
  "7837": [
    628,
    543
  ],
  "19947": [
    2728,
    2015
  ],
  "17726": [
    506,
    133
  ],
  "3467": [
    557,
    1316
  ],
  "24321": [
    21535,
    1332
  ],
  "11259": [
    5219,
    655
  ],
  "22156": [
    919,
    919
  ],
  "359": [
    229,
    175
  ],
  "22024": [
    284,
    3217
  ],
  "27477": [
    294,
    2489
  ],
  "19006": [
    884,
    652
  ],
  "4351": [
    342,
    2409
  ],
  "6536": [
    277,
    163
  ],
  "10227": [
    251,
    1327
  ],
  "21452": [
    8111,
    3154
  ],
  "9999": [
    1026,
    138
  ],
  "2926": [
    366,
    160
  ],
  "10670": [
    4288,
    898
  ],
  "15774": [
    257,
    3187
  ],
  "26869": [
    2588,
    2119
  ],
  "21049": [
    1262,
    2132
  ],
  "12269": [
    399,
    1542
  ],
  "11773": [
    423,
    521
  ],
  "14385": [
    428,
    1361
  ],
  "7458": [
    257,
    2388
  ],
  "13526": [
    7540,
    2425
  ],
  "16891": [
    472,
    1101
  ],
  "21983": [
    1009,
    1725
  ],
  "24786": [
    636,
    758
  ],
  "11643": [
    1250,
    3342
  ],
  "18751": [
    1798,
    391
  ],
  "18419": [
    1001,
    1002
  ],
  "21928": [
    1857,
    9630
  ],
  "21516": [
    617,
    5967
  ],
  "23539": [
    251,
    1118
  ],
  "11576": [
    710,
    485
  ],
  "30142": [
    12940,
    9298
  ],
  "9444": [
    7125,
    2009
  ],
  "22103": [
    418,
    445
  ],
  "10917": [
    256,
    776
  ],
  "19725": [
    3097,
    2949
  ],
  "17676": [
    299,
    1278
  ],
  "24251": [
    1699,
    473
  ],
  "9466": [
    2953,
    5406
  ],
  "12309": [
    251,
    1009
  ],
  "15179": [
    1250,
    804
  ],
  "16727": [
    248,
    191
  ],
  "6012": [
    1474,
    314
  ],
  "23392": [
    330,
    898
  ],
  "4853": [
    346,
    257
  ],
  "5657": [
    247,
    160
  ],
  "27727": [
    2071,
    630
  ],
  "2189": [
    1026,
    164
  ],
  "24010": [
    310,
    8037
  ],
  "12198": [
    891,
    549
  ],
  "12197": [
    1544,
    453
  ],
  "17011": [
    396,
    4113
  ],
  "6596": [
    323,
    159
  ],
  "26815": [
    1960,
    353
  ],
  "29195": [
    2594,
    352
  ],
  "17148": [
    368,
    367
  ],
  "29718": [
    3743,
    684
  ],
  "15736": [
    6175,
    859
  ],
  "22475": [
    418,
    300
  ],
  "11804": [
    2479,
    399
  ],
  "21140": [
    20251,
    13723
  ],
  "29775": [
    6846,
    256
  ],
  "14498": [
    331,
    1688
  ],
  "3130": [
    294,
    287
  ],
  "24426": [
    509,
    129
  ],
  "15933": [
    1178,
    307
  ],
  "22073": [
    10795,
    1752
  ],
  "4435": [
    1043,
    298
  ],
  "8676": [
    407,
    405
  ],
  "2090": [
    723,
    187
  ],
  "26737": [
    611,
    1018
  ],
  "2618": [
    315,
    167
  ],
  "8979": [
    751,
    8801
  ],
  "24482": [
    707,
    3294
  ],
  "19687": [
    822,
    421
  ],
  "18303": [
    686,
    746
  ],
  "13462": [
    674,
    1554
  ],
  "25107": [
    1405,
    361
  ],
  "23563": [
    476,
    662
  ],
  "6751": [
    251,
    1934
  ],
  "8871": [
    475,
    2382
  ],
  "15727": [
    817,
    2638
  ],
  "27848": [
    2400,
    309
  ],
  "13749": [
    282,
    341
  ],
  "18939": [
    408,
    2506
  ],
  "20917": [
    1178,
    2000
  ],
  "26665": [
    290,
    6157
  ],
  "11515": [
    1259,
    377
  ],
  "18768": [
    526,
    134
  ],
  "1422": [
    435,
    153
  ],
  "7069": [
    2138,
    785
  ],
  "20577": [
    7725,
    586
  ],
  "22776": [
    758,
    725
  ],
  "29745": [
    1248,
    10111
  ],
  "9631": [
    290,
    689
  ],
  "3714": [
    943,
    263
  ],
  "4497": [
    950,
    143
  ],
  "10949": [
    876,
    887
  ],
  "6866": [
    451,
    331
  ],
  "401": [
    232,
    132
  ],
  "26397": [
    329,
    583
  ],
  "26966": [
    1275,
    626
  ],
  "29925": [
    919,
    257
  ],
  "22472": [
    485,
    436
  ],
  "15202": [
    3329,
    944
  ],
  "29746": [
    440,
    951
  ],
  "1096": [
    323,
    137
  ],
  "8853": [
    318,
    1971
  ],
  "15269": [
    434,
    176
  ],
  "16497": [
    625,
    263
  ],
  "18105": [
    5337,
    527
  ],
  "4091": [
    2794,
    1453
  ],
  "746": [
    289,
    151
  ],
  "25232": [
    1207,
    314
  ],
  "24303": [
    268,
    2581
  ],
  "26018": [
    2172,
    15128
  ],
  "20013": [
    4432,
    3229
  ],
  "11495": [
    4147,
    892
  ],
  "16963": [
    1627,
    813
  ],
  "7362": [
    248,
    133
  ],
  "15685": [
    268,
    2092
  ],
  "25685": [
    724,
    3119
  ],
  "14555": [
    1605,
    307
  ],
  "16446": [
    2048,
    304
  ],
  "2881": [
    545,
    916
  ],
  "11554": [
    1765,
    286
  ],
  "3244": [
    3223,
    1831
  ],
  "5522": [
    2913,
    411
  ],
  "19540": [
    2415,
    531
  ],
  "21397": [
    885,
    1366
  ],
  "27803": [
    1099,
    2841
  ],
  "4825": [
    2754,
    4812
  ],
  "17068": [
    8646,
    497
  ],
  "28596": [
    3070,
    300
  ],
  "3781": [
    304,
    384
  ],
  "23066": [
    22479,
    5524
  ],
  "23416": [
    294,
    561
  ],
  "9677": [
    7183,
    6856
  ],
  "26452": [
    446,
    803
  ],
  "9665": [
    899,
    710
  ],
  "14651": [
    446,
    317
  ],
  "10692": [
    1129,
    467
  ],
  "4267": [
    601,
    184
  ],
  "9019": [
    2667,
    256
  ],
  "1103": [
    378,
    137
  ],
  "9749": [
    496,
    153
  ],
  "19446": [
    10736,
    257
  ],
  "5541": [
    362,
    155
  ],
  "19649": [
    2390,
    563
  ],
  "27606": [
    778,
    446
  ],
  "635": [
    242,
    142
  ],
  "2781": [
    435,
    141
  ],
  "26802": [
    1545,
    314
  ],
  "12907": [
    992,
    992
  ],
  "23522": [
    304,
    563
  ],
  "7924": [
    405,
    1619
  ],
  "12147": [
    2320,
    309
  ],
  "8580": [
    1880,
    2814
  ],
  "22812": [
    848,
    1549
  ],
  "2322": [
    268,
    682
  ],
  "9283": [
    850,
    274
  ],
  "7209": [
    5430,
    328
  ],
  "11415": [
    337,
    491
  ],
  "6146": [
    257,
    1400
  ],
  "17192": [
    1773,
    282
  ],
  "21610": [
    3582,
    1972
  ],
  "22507": [
    525,
    1552
  ],
  "1640": [
    521,
    287
  ],
  "18531": [
    287,
    2148
  ],
  "8966": [
    728,
    891
  ],
  "3096": [
    1050,
    564
  ],
  "21219": [
    913,
    2283
  ],
  "3639": [
    688,
    309
  ],
  "5844": [
    592,
    262
  ],
  "20075": [
    1762,
    1762
  ],
  "2130": [
    423,
    337
  ],
  "7198": [
    251,
    648
  ],
  "10384": [
    473,
    2229
  ],
  "26989": [
    2883,
    2583
  ],
  "348": [
    229,
    185
  ],
  "4395": [
    396,
    646
  ],
  "12639": [
    268,
    2747
  ],
  "13845": [
    1589,
    152
  ],
  "16816": [
    801,
    12839
  ],
  "29244": [
    1394,
    1920
  ],
  "4023": [
    1200,
    1118
  ],
  "16194": [
    440,
    263
  ],
  "17923": [
    488,
    1343
  ],
  "6059": [
    254,
    145
  ],
  "24288": [
    719,
    4702
  ],
  "14504": [
    781,
    294
  ],
  "25915": [
    3275,
    1965
  ],
  "19626": [
    3447,
    3390
  ],
  "7810": [
    535,
    274
  ],
  "12733": [
    8181,
    450
  ],
  "14487": [
    7952,
    263
  ],
  "14582": [
    4883,
    490
  ],
  "17322": [
    1676,
    136
  ],
  "27498": [
